
 {
  "word": "a little sth",
  "part_of_speech": "phrase",
  "translation": "קצת משהו",
  "definition_1": "A small, unspecified amount of a substance or object.",
  "definition_2": "An amount that is not large or significant.",
  "definition_3": "Used to describe a slight quantity of something.",
  "definition_4": "A small portion or degree of a thing.",
  "example_1": "\"I need a little sth sweet after dinner.\"",
  "example_2": "\"Can you add a little sth to spice up this soup?\""
 },
 {
  "word": "aggressive",
  "part_of_speech": "adj",
  "translation": "תוקפני",
  "definition_1": "Behaving in an angry or forceful way towards another person.",
  "definition_2": "Ready or likely to start fights or arguments.",
  "definition_3": "Forceful and energetic in trying to win or succeed.",
  "definition_4": "Acting with a lot of confidence and determination.",
  "example_1": "The dog looked aggressive when it barked at the mailman.",
  "example_2": "The company launched an aggressive marketing campaign."
 },
 {
  "word": "air force",
  "part_of_speech": "n",
  "translation": "חיל האוויר",
  "definition_1": "The part of a country's military that fights in the air.",
  "definition_2": "A country's military organization responsible for aerial warfare.",
  "definition_3": "The branch of the armed services that uses aircraft.",
  "definition_4": "A large group of military airplanes and the people who operate them.",
  "example_1": "My uncle joined the air force when he was eighteen.",
  "example_2": "The mission required the assistance of the air force planes."
 },
 {
  "word": "alarm",
  "part_of_speech": "n",
  "translation": "אזעקה; בהלה",
  "definition_1": "A warning sound or signal that informs people of danger.",
  "definition_2": "A sudden feeling of fear or worry.",
  "definition_3": "A device that wakes someone up at a set time (e.g., a clock).",
  "definition_4": "A system designed to detect and deter unauthorized entry.",
  "example_1": "The fire alarm went off as soon as the smoke reached the ceiling.",
  "example_2": "I felt a sense of alarm when I couldn't find my keys."
 },
 {
  "word": "all is well",
  "part_of_speech": "phrase",
  "translation": "הכול בסדר",
  "definition_1": "Everything is satisfactory and in a good condition.",
  "definition_2": "Used to communicate that there is no problem or danger.",
  "definition_3": "A phrase indicating that a situation is safe and without trouble.",
  "definition_4": "A simple reassurance that the current situation is positive.",
  "example_1": "After the storm, we checked on them and they confirmed that all is well.",
  "example_2": "She smiled to show her parents that all is well with her new job."
 },
 {
  "word": "all over the place",
  "part_of_speech": "phrase",
  "translation": "מפוזר בכל מקום; לא מסודר",
  "definition_1": "Scattered or disorganized in many different locations.",
  "definition_2": "Found or happening everywhere in a large area.",
  "definition_3": "Describes something that is chaotic or lacks proper structure.",
  "definition_4": "Not concentrated in one single area.",
  "example_1": "After the party, the decorations were all over the place.",
  "example_2": "His lecture notes were all over the place, making it difficult to study."
 },
 {
  "word": "ambassador",
  "part_of_speech": "n",
  "translation": "שגריר",
  "definition_1": "An official representative of a country in another country.",
  "definition_2": "A high-ranking diplomatic official.",
  "definition_3": "A person who promotes a specific activity or organization.",
  "definition_4": "A representative sent to another land to conduct diplomatic business.",
  "example_1": "The new ambassador arrived in the capital city last week.",
  "example_2": "She was appointed as a Goodwill Ambassador for the charity."
 },
 {
  "word": "arrow (sign)",
  "part_of_speech": "n",
  "translation": "חץ; סימן",
  "definition_1": "A mark or sign, usually with a pointed head, that shows direction or location.",
  "definition_2": "A long, thin weapon shot from a bow.",
  "definition_3": "A symbol used on signs or maps to guide people.",
  "definition_4": "A graphic pointer used in computer interfaces.",
  "example_1": "Follow the arrow to find the exit of the building.",
  "example_2": "He drew a simple arrow on the map to indicate the way."
 },
 {
  "word": "artistic",
  "part_of_speech": "adj",
  "translation": "אומנותי; של אומנות",
  "definition_1": "Having or revealing creative skill in a visual or performing art.",
  "definition_2": "Relating to art or artists.",
  "definition_3": "Showing a high level of imagination and skill in creation.",
  "definition_4": "Able to produce works of art or aesthetic quality.",
  "example_1": "Her paintings showed a unique and profound artistic vision.",
  "example_2": "The lighting gave the room a very artistic look and feel."
 },
 {
  "word": "at fault",
  "part_of_speech": "phrase",
  "translation": "אשם",
  "definition_1": "Responsible for a mistake, error, or undesirable situation.",
  "definition_2": "The person or thing that is to blame for something bad happening.",
  "definition_3": "In a position of having done something wrong.",
  "definition_4": "Describing the party legally or morally responsible for an incident.",
  "example_1": "The driver was judged to be at fault for the accident.",
  "example_2": "No one was willing to admit they were at fault for the confusion."
 },
 {
  "word": "bank (river)",
  "part_of_speech": "n",
  "translation": "גדה (של נהר)",
  "definition_1": "The sloping ground on either side of a river or a lake.",
  "definition_2": "The land alongside a body of water.",
  "definition_3": "The edge of a stream or canal.",
  "definition_4": "A mass of land that rises sharply near a river's edge.",
  "example_1": "We had a picnic on the grassy bank of the river.",
  "example_2": "The fog was thick and covered the entire river bank."
 },
 {
  "word": "bank account",
  "part_of_speech": "n",
  "translation": "חשבון בנק",
  "definition_1": "An arrangement with a bank to keep your money safe.",
  "definition_2": "A record of the money that a customer has deposited in a bank.",
  "definition_3": "The funds held by a bank for a client.",
  "definition_4": "A service provided by a financial institution for managing money.",
  "example_1": "I need to open a new bank account for my savings.",
  "example_2": "Check your bank account to see if the payment has been processed."
 },
 {
  "word": "bargain",
  "part_of_speech": "n",
  "translation": "מציאה",
  "definition_1": "Something bought or offered for sale at a lower price than expected.",
  "definition_2": "A purchase that is considered favorable because of its low cost.",
  "definition_3": "An agreement between two or more parties about what each will do.",
  "definition_4": "An opportunity to buy something for a very good price.",
  "example_1": "At fifty percent off, the dress was a real bargain.",
  "example_2": "We managed to strike a good bargain with the seller."
 },
 {
  "word": "base (military)",
  "part_of_speech": "n",
  "translation": "בסיס (צבאי)",
  "definition_1": "A main military station where personnel live and train.",
  "definition_2": "A military establishment where operations are planned and directed.",
  "definition_3": "The starting point or foundation for a structure or idea.",
  "definition_4": "A central place where an organization or activity operates from.",
  "example_1": "He was stationed at a naval base overseas for two years.",
  "example_2": "The soldiers returned to the base after completing their exercise."
 },
 {
  "word": "bay",
  "part_of_speech": "n",
  "translation": "מפרץ",
  "definition_1": "A broad inlet of the sea where the land curves inwards.",
  "definition_2": "A body of water partially enclosed by land but with a wide mouth opening to the sea.",
  "definition_3": "An area of the coast where the water is sheltered.",
  "definition_4": "A large curve or recess in a coastline.",
  "example_1": "The ship dropped anchor in the peaceful bay.",
  "example_2": "San Francisco Bay is famous for its beautiful views."
 },
 {
  "word": "be expecting (a baby)",
  "part_of_speech": "phrase",
  "translation": "להיות בהיריון; לצפות (לתינוק)",
  "definition_1": "To be pregnant, waiting for a baby to be born.",
  "definition_2": "To be in the state of having a developing child inside the body.",
  "definition_3": "To look forward to the arrival of a child soon.",
  "definition_4": "Used to say that a woman will soon give birth.",
  "example_1": "They announced that they are expecting their first baby next spring.",
  "example_2": "The doctor confirmed that she is expecting twins."
 },
 {
  "word": "believe it or not",
  "part_of_speech": "phrase",
  "translation": "תאמין או לא",
  "definition_1": "Used to introduce a surprising or unlikely statement that is actually true.",
  "definition_2": "A phrase that signals the following information may be hard to accept.",
  "definition_3": "Used to emphasize the truth of something unexpected.",
  "definition_4": "Regardless of your skepticism, this fact is real.",
  "example_1": "Believe it or not, he won the lottery three times in one year.",
  "example_2": "I saw a deer in my backyard, believe it or not!"
 },
 {
  "word": "bell",
  "part_of_speech": "n",
  "translation": "פעמון",
  "definition_1": "A hollow, metal object that makes a sound when struck.",
  "definition_2": "A device that produces a ringing sound, used as a signal or warning.",
  "definition_3": "A piece of equipment used to summon someone or signal the start\/end of something.",
  "definition_4": "An instrument commonly found in churches or schools for making a loud sound.",
  "example_1": "The school bell rang, signaling the end of the lesson.",
  "example_2": "I heard the distant ringing of a church bell."
 },
 {
  "word": "bench",
  "part_of_speech": "n",
  "translation": "ספסל",
  "definition_1": "A long seat for several people, typically made of wood or stone.",
  "definition_2": "A seat often found in public places like parks or courts.",
  "definition_3": "A long, sturdy work table used in workshops or laboratories.",
  "definition_4": "The place where substitute players sit during a sports game.",
  "example_1": "We sat on the park bench and watched the people go by.",
  "example_2": "The coach decided to leave the star player on the bench."
 },
 {
  "word": "blow up (sth\/sb) or blow (sth\/sb) up",
  "part_of_speech": "phrasal verb",
  "translation": "לפוצץ (משהו\/מישהו); לנפח",
  "definition_1": "To destroy something or someone with an explosive device.",
  "definition_2": "To inflate something with air or gas (like a balloon).",
  "definition_3": "To suddenly become very angry (informal).",
  "definition_4": "To make a photograph or image much larger.",
  "example_1": "The engineers had to blow up the old bridge to build a new one.",
  "example_2": "He was so frustrated he felt like he was going to blow up."
 },
 {
  "word": "boiled",
  "part_of_speech": "adj",
  "translation": "מבושל (במים)",
  "definition_1": "Cooked by being put into hot, rapidly bubbling water.",
  "definition_2": "Describes food that has been prepared in water at 100°C (212°F).",
  "definition_3": "Having reached the temperature where liquid turns to gas.",
  "definition_4": "Denoting food, often eggs, prepared by immersing in boiling water.",
  "example_1": "For breakfast, I usually have two hard-boiled eggs.",
  "example_2": "The meat was tough because it was only lightly boiled."
 },
 {
  "word": "brake",
  "part_of_speech": "v",
  "translation": "לבלום",
  "definition_1": "To slow down or stop a vehicle using a device.",
  "definition_2": "To apply the mechanism that causes a vehicle to slow or stop.",
  "definition_3": "To reduce the speed of something in motion.",
  "definition_4": "To interrupt or check the progress of something.",
  "example_1": "She had to brake quickly when the car in front of her stopped.",
  "example_2": "Remember to brake gently on icy roads."
 },
 {
  "word": "brake",
  "part_of_speech": "n",
  "translation": "בלם",
  "definition_1": "A device used to slow down or stop a vehicle or machine.",
  "definition_2": "The mechanism operated by the driver to reduce speed.",
  "definition_3": "The pedal or lever used to activate the braking mechanism.",
  "definition_4": "Anything that slows or stops an action.",
  "example_1": "I pressed the brake pedal hard to avoid hitting the pole.",
  "example_2": "The bicycle needs new brakes before you ride it."
 },
 {
  "word": "branch (business)",
  "part_of_speech": "n",
  "translation": "סניף (של עסק)",
  "definition_1": "A local office or store belonging to a large company or organization.",
  "definition_2": "A subdivision of a larger system or organization.",
  "definition_3": "A separate part of a tree growing out from the trunk.",
  "definition_4": "One of the parts of a family or subject.",
  "example_1": "The bank is opening a new branch on the other side of town.",
  "example_2": "He works at the London branch of the international corporation."
 },
 {
  "word": "brick",
  "part_of_speech": "n",
  "translation": "לבנה",
  "definition_1": "A block of baked clay used for building walls and houses.",
  "definition_2": "A solid, rectangular unit used as a building material.",
  "definition_3": "A small, dense piece of matter shaped like a block.",
  "definition_4": "A hard, durable material used in construction.",
  "example_1": "The entire building was constructed with red bricks.",
  "example_2": "He carried a heavy pile of bricks to the construction site."
 },
 {
  "word": "bucket",
  "part_of_speech": "n",
  "translation": "דלי",
  "definition_1": "A round, open container with a handle, used for carrying liquids or materials.",
  "definition_2": "A typically cylindrical container used to hold water or sand.",
  "definition_3": "A large scoop attached to a digger or crane.",
  "definition_4": "An open-top container, often used for mopping floors.",
  "example_1": "Fill the bucket with water so I can wash the car.",
  "example_2": "We used a small plastic bucket to collect seashells on the beach."
 },
 {
  "word": "bug",
  "part_of_speech": "n",
  "translation": "חרק; באג (טכני)",
  "definition_1": "A small insect or similar creature.",
  "definition_2": "A fault or error in a computer program or system.",
  "definition_3": "A hidden listening device (informal).",
  "definition_4": "A sudden illness caused by a virus (informal).",
  "example_1": "I found a strange little bug crawling on the window sill.",
  "example_2": "The new software update has a serious security bug."
 },
 {
  "word": "bull",
  "part_of_speech": "n",
  "translation": "פר",
  "definition_1": "An adult male of the cattle family.",
  "definition_2": "The male animal of a few other species, such as elephants.",
  "definition_3": "A large, strong, and powerful creature.",
  "definition_4": "The name of a constellation (Taurus).",
  "example_1": "The farmer kept a prize bull for breeding.",
  "example_2": "He spoke with a stubborn force, like a charging bull."
 },
 {
  "word": "bunch",
  "part_of_speech": "n",
  "translation": "צרור; חבורה",
  "definition_1": "A collection of things or people grouped together.",
  "definition_2": "A number of items fastened or growing together (e.g., bananas, grapes).",
  "definition_3": "A group of people (informal).",
  "definition_4": "A cluster or collection of similar items.",
  "example_1": "He gave her a beautiful bunch of flowers for her birthday.",
  "example_2": "We are a close bunch of friends who meet every weekend."
 },
 {
  "word": "burst into tears",
  "part_of_speech": "phrase",
  "translation": "להתפרץ בבכי",
  "definition_1": "To suddenly begin to cry very hard.",
  "definition_2": "To start weeping abruptly and intensely.",
  "definition_3": "To unexpectedly begin to cry with full emotion.",
  "definition_4": "The action of quickly starting to shed tears.",
  "example_1": "When she heard the bad news, she immediately burst into tears.",
  "example_2": "The child tripped and fell, then burst into tears."
 },
 {
  "word": "bury",
  "part_of_speech": "v",
  "translation": "לקבור",
  "definition_1": "To put a dead body into the ground.",
  "definition_2": "To place something underground or cover it completely.",
  "definition_3": "To hide or cover something out of sight.",
  "definition_4": "To completely immerse yourself in an activity (e.g., a book).",
  "example_1": "They decided to bury the old treasure chest in the garden.",
  "example_2": "After the funeral, they went to bury their grandmother."
 },
 {
  "word": "butcher",
  "part_of_speech": "n",
  "translation": "קצב",
  "definition_1": "A person whose job is to cut up and sell meat in a shop.",
  "definition_2": "Someone who prepares and sells meat.",
  "definition_3": "A person who kills animals for food.",
  "definition_4": "A shop where meat is sold (informal).",
  "example_1": "I went to the butcher to buy a good piece of steak.",
  "example_2": "The butcher advised me on the best way to cook the chicken."
 },
 {
  "word": "cab",
  "part_of_speech": "n",
  "translation": "מונית",
  "definition_1": "A taxi, a vehicle for public hire.",
  "definition_2": "The driver's compartment in a truck, train, or construction vehicle.",
  "definition_3": "A car that is available to be hired for transportation.",
  "definition_4": "A vehicle for transporting passengers for a fee.",
  "example_1": "We missed the last bus, so we had to take a cab home.",
  "example_2": "Can you call a cab to take me to the airport?"
 },
 {
  "word": "cabin",
  "part_of_speech": "n",
  "translation": "בקתה; תא (בספינה\/מטוס)",
  "definition_1": "A small, simple house, especially one built of wood in a rural area.",
  "definition_2": "A private room or compartment on a ship or an aircraft.",
  "definition_3": "A sheltered space in a small boat.",
  "definition_4": "A small dwelling often used for temporary stays.",
  "example_1": "They rented a small wooden cabin in the mountains for their vacation.",
  "example_2": "The flight attendant showed me to my cabin on the cruise ship."
 },
 {
  "word": "catalog\/catalogue",
  "part_of_speech": "n",
  "translation": "קטלוג",
  "definition_1": "A complete list of items, often arranged in alphabetical or systematic order.",
  "definition_2": "A book or pamphlet containing a list of goods for sale.",
  "definition_3": "A systematic list of all the books in a library.",
  "definition_4": "A descriptive list of resources, products, or services.",
  "example_1": "I ordered the new sofa directly from the furniture catalog.",
  "example_2": "The library maintains a comprehensive catalogue of all its archives."
 },
 {
  "word": "cave",
  "part_of_speech": "n",
  "translation": "מערה",
  "definition_1": "A large, natural hollow space in the side of a cliff, hill, or underground.",
  "definition_2": "A deep recess in the earth or rock.",
  "definition_3": "A natural chamber used as shelter by early humans or animals.",
  "definition_4": "A large cavity formed by natural processes in rock.",
  "example_1": "We explored an enormous limestone cave deep in the forest.",
  "example_2": "The ancient drawings were preserved on the walls of the cave."
 },
 {
  "word": "certificate",
  "part_of_speech": "n",
  "translation": "תעודה; אישור",
  "definition_1": "An official document confirming a fact, such as a birth or qualification.",
  "definition_2": "A document that formally states something is true or correct.",
  "definition_3": "A written statement that proves you have completed a course or passed an exam.",
  "definition_4": "A paper confirming ownership or achievement.",
  "example_1": "She received a certificate upon graduation from the cooking class.",
  "example_2": "You need a valid health certificate to travel with your pet."
 },
 {
  "word": "charge (energy supply)",
  "part_of_speech": "v",
  "translation": "להטעין (אספקת אנרגיה)",
  "definition_1": "To put electricity into a battery or other device.",
  "definition_2": "To fill a device with the necessary electrical energy.",
  "definition_3": "To formally accuse someone of a crime.",
  "definition_4": "To ask for a specific amount of money as a price for a service.",
  "example_1": "I forgot to charge my phone last night, so the battery is dead.",
  "example_2": "Plug in the laptop to charge it before the meeting starts."
 },
 {
  "word": "check in\/check out",
  "part_of_speech": "v",
  "translation": "להירשם (כניסה\/יציאה)",
  "definition_1": "To register one's arrival at a hotel or airport (check in).",
  "definition_2": "To pay the bill and leave a hotel (check out).",
  "definition_3": "To verify or investigate the details of a situation.",
  "definition_4": "To mark an item as taken or returned from a library or store.",
  "example_1": "We need to check in at the hotel before 4 PM.",
  "example_2": "Please remember to check out of your room by 11 o'clock."
 },
 {
  "word": "Cheers!",
  "part_of_speech": "exclam",
  "translation": "לחיים! (ברכת הרמה); תודה",
  "definition_1": "Used as a toast before drinking in celebration.",
  "definition_2": "An informal way of saying \"thank you\" or \"goodbye\" (British English).",
  "definition_3": "A brief expression of good wishes or encouragement.",
  "definition_4": "Used to express good health or happiness when drinking with others.",
  "example_1": "Raise your glass! Cheers! To a happy and successful year!",
  "example_2": "Here's your coffee. Cheers!"
 },
 {
  "word": "cold (unfriendly)",
  "part_of_speech": "adj",
  "translation": "קר; לא ידידותי",
  "definition_1": "Lacking emotion, affection, or warmth in personality.",
  "definition_2": "Distant and unfriendly in manner.",
  "definition_3": "Having a low temperature or feeling the absence of heat.",
  "definition_4": "Describing a person who is reserved and hard to get to know.",
  "example_1": "She gave him a very cold look after he interrupted her.",
  "example_2": "The weather suddenly turned cold, so I put on a heavy coat."
 },
 {
  "word": "collar",
  "part_of_speech": "n",
  "translation": "צווארון",
  "definition_1": "The part of a shirt, coat, or dress that fits around the neck.",
  "definition_2": "A band or strap put around the neck of an animal.",
  "definition_3": "A piece of clothing material that folds down or stands up at the neckline.",
  "definition_4": "The name for a certain type of job (e.g., white-collar).",
  "example_1": "I accidentally stained the collar of my favorite white shirt.",
  "example_2": "He fastened the dog's leather collar before taking it for a walk."
 },
 {
  "word": "crash",
  "part_of_speech": "v",
  "translation": "להתרסק; להתנגש",
  "definition_1": "To hit something hard enough to cause damage or break something.",
  "definition_2": "To suddenly stop working (a computer system).",
  "definition_3": "To fall asleep quickly, usually due to exhaustion.",
  "definition_4": "To attend a party or event without an invitation.",
  "example_1": "The small plane was forced to crash land in a nearby field.",
  "example_2": "I lost all my work when my computer suddenly crashed."
 },
 {
  "word": "crash",
  "part_of_speech": "n",
  "translation": "התרסקות; קריסה",
  "definition_1": "An accident where a vehicle hits something hard, resulting in damage.",
  "definition_2": "A sudden, loud noise caused by something breaking or falling.",
  "definition_3": "A sudden and serious drop in the price or value of something (e.g., the stock market).",
  "definition_4": "The failure of a computer or software program.",
  "example_1": "There was a loud crash as the boxes tumbled down the stairs.",
  "example_2": "The police are investigating the cause of the terrible car crash."
 },
 {
  "word": "cross (symbol)",
  "part_of_speech": "n",
  "translation": "צלב (סמל)",
  "definition_1": "A mark, object, or symbol made of two lines intersecting each other.",
  "definition_2": "The religious symbol of Christianity.",
  "definition_3": "An animal or plant that is a mix of two different types.",
  "definition_4": "A thing that is seen as a burden or struggle.",
  "example_1": "She wears a small silver cross around her neck.",
  "example_2": "There was a red cross drawn on the map to mark the spot."
 },
 {
  "word": "customs",
  "part_of_speech": "n",
  "translation": "מכס; המכס",
  "definition_1": "The official place where people's baggage is checked for illegal goods upon entering a country.",
  "definition_2": "The government department that collects taxes on goods bought from other countries.",
  "definition_3": "A tax on imported goods.",
  "definition_4": "The inspection process for international travelers' luggage.",
  "example_1": "I had to declare my electronic devices at customs.",
  "example_2": "He was held up for an hour while going through customs at the border."
 },
 {
  "word": "date (going out)",
  "part_of_speech": "n",
  "translation": "דייט; פגישה רומנטית",
  "definition_1": "A social or romantic appointment between two people.",
  "definition_2": "The person you meet for a romantic or social appointment.",
  "definition_3": "A specific point in time expressed in days and years.",
  "definition_4": "A sweet, sticky brown fruit.",
  "example_1": "He asked her out on a date to the new Italian restaurant.",
  "example_2": "Our first date was a disaster, but we laughed about it later."
 },
 {
  "word": "deck (floor on ship)",
  "part_of_speech": "n",
  "translation": "סיפון (קומה על ספינה)",
  "definition_1": "A floor of a ship or boat.",
  "definition_2": "A flat area outside a house, often made of wood, used for relaxing.",
  "definition_3": "A pack of playing cards.",
  "definition_4": "A platform on a ship that covers the hull.",
  "example_1": "We stood on the upper deck to watch the dolphins swimming by.",
  "example_2": "The ship had three separate decks for passengers."
 },
 {
  "word": "defeat",
  "part_of_speech": "v",
  "translation": "להביס",
  "definition_1": "To win a victory over someone in a battle, game, or competition.",
  "definition_2": "To overcome or conquer an opponent.",
  "definition_3": "To cause someone to lose.",
  "definition_4": "To frustrate or make a person unable to accomplish a goal.",
  "example_1": "Our team managed to defeat the champions in the final match.",
  "example_2": "We must not let a small setback defeat our greater ambition."
 },
 {
  "word": "defeat",
  "part_of_speech": "n",
  "translation": "תבוסה; הפסד",
  "definition_1": "An instance of losing to an opponent in a competition or battle.",
  "definition_2": "The act of being beaten or conquered.",
  "definition_3": "A failure to win.",
  "definition_4": "The outcome of an unsuccessful attempt.",
  "example_1": "The candidate accepted his unexpected defeat in the election.",
  "example_2": "Despite the bitter defeat, the team played with honor."
 },
 {
  "word": "devil",
  "part_of_speech": "n",
  "translation": "שטן",
  "definition_1": "The chief evil spirit in various religions; a very wicked person.",
  "definition_2": "The enemy of God and humans in Christianity.",
  "definition_3": "A person who is very naughty or mischievous (often used humorously).",
  "definition_4": "An evil force or personification of evil.",
  "example_1": "The religious painting depicted the devil tempting a man.",
  "example_2": "He was always playing tricks, a little devil with a charming smile."
 },
 {
  "word": "diagram",
  "part_of_speech": "n",
  "translation": "דיאגרמה; תרשים",
  "definition_1": "A simple drawing that explains how something works or shows how parts relate to each other.",
  "definition_2": "A plan, drawing, or outline used to illustrate an object or process.",
  "definition_3": "A simplified graphic representation of a structure or system.",
  "definition_4": "A sketch used to convey information clearly.",
  "example_1": "The instructions included a clear diagram for assembling the shelf.",
  "example_2": "Our teacher drew a diagram of the human heart on the whiteboard."
 },
 {
  "word": "difficult (not friendly)",
  "part_of_speech": "adj",
  "translation": "קשה; לא ידידותי",
  "definition_1": "Used to describe a person who is unfriendly, demanding, or hard to please.",
  "definition_2": "Hard to do, understand, or deal with.",
  "definition_3": "Requiring a lot of effort or skill.",
  "definition_4": "Full of problems or challenges.",
  "example_1": "The exam was incredibly difficult, and I struggled to finish it.",
  "example_2": "He has a reputation for being a very difficult person to work with."
 },
 {
  "word": "dishonest",
  "part_of_speech": "adj",
  "translation": "לא ישר; רמאי",
  "definition_1": "Behaving in an untrustworthy or deceitful way.",
  "definition_2": "Not truthful or fair; misleading.",
  "definition_3": "Intending to cheat or lie.",
  "definition_4": "Lacking integrity or sincerity.",
  "example_1": "The manager was fired for his dishonest financial practices.",
  "example_2": "It was a small lie, but it showed that she was completely dishonest."
 },
 {
  "word": "disk",
  "part_of_speech": "n",
  "translation": "דיסק",
  "definition_1": "A flat, circular object used to store computer data.",
  "definition_2": "A piece of computer storage, such as a compact disc (CD).",
  "definition_3": "Any flat, thin, circular shape.",
  "definition_4": "A flat, round part of the body, such as one between the bones of the spine.",
  "example_1": "I saved the presentation file onto a portable disk.",
  "example_2": "The new computer has a huge hard disk for storing files."
 },
 {
  "word": "divorce",
  "part_of_speech": "n",
  "translation": "גירושין",
  "definition_1": "The legal ending of a marriage.",
  "definition_2": "An official separation of a married couple.",
  "definition_3": "The dissolution of a marital union.",
  "definition_4": "The formal split of two people who were husband and wife.",
  "example_1": "They agreed to get a divorce after ten years of marriage.",
  "example_2": "The process of getting a divorce can be complicated and painful."
 },
 {
  "word": "Don't ask me!",
  "part_of_speech": "phrase",
  "translation": "אל תשאל אותי! (אין לי מושג)",
  "definition_1": "Used to express that you do not know the answer to a question.",
  "definition_2": "A way of saying \"I have no idea\" or \"I'm the last person to ask.\"",
  "definition_3": "An expression of frustration that you are being asked something you cannot answer.",
  "definition_4": "Used to indicate total lack of knowledge about a subject.",
  "example_1": "Where is the remote control? Don't ask me! I haven't seen it.",
  "example_2": "Why did he quit his job? Don't ask me! It makes no sense."
 },
 {
  "word": "Don't ask!",
  "part_of_speech": "phrase",
  "translation": "אל תשאל! (תשובה ארוכה או רעה מדי)",
  "definition_1": "Used to indicate that the answer to a question is long, complicated, or unpleasant.",
  "definition_2": "An expression meaning the situation is bad or requires too much explanation.",
  "definition_3": "A phrase used to avoid explaining a difficult or painful matter.",
  "definition_4": "Implies that the situation is so poor or complicated that you shouldn't talk about it.",
  "example_1": "How was your blind date? Don't ask! It was awful.",
  "example_2": "Did you finish the project yet? Don't ask! I'm running very late."
 },
 {
  "word": "dreadful",
  "part_of_speech": "adj",
  "translation": "נורא; איום",
  "definition_1": "Causing great fear, suffering, or dread.",
  "definition_2": "Extremely bad, unpleasant, or shocking.",
  "definition_3": "Of very poor quality.",
  "definition_4": "Something that is terrible or appalling.",
  "example_1": "The weather on their vacation was absolutely dreadful.",
  "example_2": "I had a dreadful headache that lasted all day."
 },
 {
  "word": "drink (alchohol)",
  "part_of_speech": "v",
  "translation": "לשתות (אלכוהול)",
  "definition_1": "To regularly consume alcoholic beverages.",
  "definition_2": "To consume a liquid.",
  "definition_3": "To spend time socializing while consuming alcohol.",
  "definition_4": "To absorb liquid (used for plants or materials).",
  "example_1": "He promised himself that he would not drink at the party tonight.",
  "example_2": "She decided to stop drinking after her doctor advised her to."
 },
 {
  "word": "drive (computer)",
  "part_of_speech": "n",
  "translation": "כונן (מחשב)",
  "definition_1": "A device or mechanism that stores digital information on a computer.",
  "definition_2": "A computer component used for reading and writing data (e.g., hard drive).",
  "definition_3": "A journey in a vehicle.",
  "definition_4": "A strong desire or enthusiasm for something.",
  "example_1": "The technician installed a new solid-state drive in my desktop computer.",
  "example_2": "Make sure you save all the important files on the shared network drive."
 },
 {
  "word": "drop (liquid)",
  "part_of_speech": "n",
  "translation": "טיפה (נוזל)",
  "definition_1": "A tiny falling or hanging portion of liquid.",
  "definition_2": "A small, spherical amount of fluid.",
  "definition_3": "A sudden decrease in amount, level, or quality.",
  "definition_4": "The distance that something falls.",
  "example_1": "There was a small drop of oil on the kitchen counter.",
  "example_2": "I need a couple of drops of vanilla extract for the cake recipe."
 },
 {
  "word": "drunk",
  "part_of_speech": "adj",
  "translation": "שיכור",
  "definition_1": "Affected by alcohol to the extent of losing control of one's faculties.",
  "definition_2": "In a state where mental and physical abilities are impaired by consuming too much alcohol.",
  "definition_3": "Intoxicated by alcoholic beverages.",
  "definition_4": "Unable to think or act clearly because of alcohol.",
  "example_1": "He was so drunk that he couldn't walk in a straight line.",
  "example_2": "The police arrested the driver for driving while drunk."
 },
 {
  "word": "elbow",
  "part_of_speech": "n",
  "translation": "מֶרְפֵּק",
  "definition_1": "The joint connecting the forearm and the upper arm.",
  "definition_2": "The outer part of the middle of a person's arm.",
  "definition_3": "A bend in a pipe or road that looks like the human joint.",
  "definition_4": "A strong push with this part of the arm.",
  "example_1": "I hit my elbow hard when I fell off the chair.",
  "example_2": "He used his elbow to gently push past the crowd."
 },
 {
  "word": "engagement",
  "part_of_speech": "n",
  "translation": "אירוסין; התחייבות",
  "definition_1": "An agreement to marry someone.",
  "definition_2": "The period of time during which two people are promised to be married.",
  "definition_3": "A formal agreement or promise to do something.",
  "definition_4": "A commitment to an appointment or duty.",
  "example_1": "They announced their engagement at a surprise party last Saturday.",
  "example_2": "I have a previous engagement and cannot attend the meeting."
 },
 {
  "word": "explode",
  "part_of_speech": "v",
  "translation": "להתפוצץ",
  "definition_1": "To burst or shatter violently, often due to an internal force or sudden chemical reaction.",
  "definition_2": "To suddenly increase greatly in number or amount.",
  "definition_3": "To release a large amount of energy suddenly and noisily.",
  "definition_4": "To suddenly lose your temper and become very angry.",
  "example_1": "The old boiler was in such bad shape that it was expected to explode.",
  "example_2": "The population of the city is expected to explode in the next decade."
 },
 {
  "word": "fall in love",
  "part_of_speech": "phrase",
  "translation": "להתאהב",
  "definition_1": "To start feeling love for someone.",
  "definition_2": "To begin a romantic relationship because of strong feelings of affection.",
  "definition_3": "To develop deep, passionate feelings for another person.",
  "definition_4": "To find someone or something irresistible and start to adore them.",
  "example_1": "It only took them a few weeks to fall in love after they first met.",
  "example_2": "She went to Italy and immediately fell in love with the city of Rome."
 },
 {
  "word": "fasten",
  "part_of_speech": "v",
  "translation": "לחגור; לקשור; לרכוס",
  "definition_1": "To close or secure a piece of clothing, belt, or device.",
  "definition_2": "To attach or join two things together firmly.",
  "definition_3": "To fix something in position so that it does not move.",
  "definition_4": "To secure something with a buckle, zip, or button.",
  "example_1": "Please fasten your seat belts before the plane takes off.",
  "example_2": "He used a piece of tape to fasten the poster to the wall."
 },
 {
  "word": "fly (insect)",
  "part_of_speech": "n",
  "translation": "זבוב (חרק)",
  "definition_1": "A common small insect with two wings.",
  "definition_2": "A small, annoying creature that can move through the air.",
  "definition_3": "A specific type of winged pest.",
  "definition_4": "A piece of fabric that covers the opening in the front of trousers.",
  "example_1": "There was a persistent fly buzzing around the kitchen all morning.",
  "example_2": "He swatted at the fly but missed it completely."
 },
 {
  "word": "folk",
  "part_of_speech": "n",
  "translation": "אנשים; עם; העם",
  "definition_1": "People in general, or a particular group of people.",
  "definition_2": "A nation or ethnic group.",
  "definition_3": "Your parents or relatives (informal).",
  "definition_4": "People, especially the common people of a region.",
  "example_1": "The local folk were very welcoming to the tourists.",
  "example_2": "My folk are coming over for dinner this weekend."
 },
 {
  "word": "folk",
  "part_of_speech": "adj",
  "translation": "עממי",
  "definition_1": "Relating to the traditional art, culture, or beliefs of a community or nation.",
  "definition_2": "Describes music or stories created by ordinary people.",
  "definition_3": "Traditional and typical of a particular region or group.",
  "definition_4": "Originating from the common people's customs.",
  "example_1": "She sang a beautiful folk song she learned from her grandmother.",
  "example_2": "The museum displayed examples of regional folk art."
 },
 {
  "word": "fool",
  "part_of_speech": "n",
  "translation": "טיפש; שוטה",
  "definition_1": "A person who acts unwisely or lacks good judgment.",
  "definition_2": "Someone who is easily tricked or made fun of.",
  "definition_3": "A person who is silly or behaves in an entertaining way.",
  "definition_4": "A person with poor common sense.",
  "example_1": "Don't be a fool and fall for that obvious scam.",
  "example_2": "He felt like a fool for forgetting his own anniversary."
 },
 {
  "word": "for fun or for the fun of it",
  "part_of_speech": "phrase",
  "translation": "בשביל הכיף",
  "definition_1": "Doing something purely for pleasure and enjoyment, not for any serious reason.",
  "definition_2": "Engaging in an activity without a practical goal, just for a good time.",
  "definition_3": "An action taken simply because it is entertaining or amusing.",
  "definition_4": "Describes a lighthearted or frivolous motivation.",
  "example_1": "We didn't need to win the game; we were just playing for fun.",
  "example_2": "He learned to juggle for the fun of it, not to become a professional."
 },
 {
  "word": "force (group of people)",
  "part_of_speech": "n",
  "translation": "כוח; קבוצת אנשים",
  "definition_1": "A group of people organized for a specific purpose (e.g., police force).",
  "definition_2": "The power or energy behind an action or movement.",
  "definition_3": "Coercion or physical power used to make someone do something.",
  "definition_4": "The strength or influence exerted on an object.",
  "example_1": "The police force was called in to control the large crowd.",
  "example_2": "A powerful natural force caused the severe erosion of the cliffs."
 },
 {
  "word": "forehead",
  "part_of_speech": "n",
  "translation": "מֵצַח",
  "definition_1": "The part of the face above the eyes and below the hair.",
  "definition_2": "The front part of the human head between the eyebrows and the hairline.",
  "definition_3": "The surface of the frontal bone of the skull.",
  "definition_4": "The area of skin at the very front of the head.",
  "example_1": "She wiped the sweat from her forehead with the back of her hand.",
  "example_2": "He had a small scar just above his left eyebrow on his forehead."
 },
 {
  "word": "forgetful",
  "part_of_speech": "adj",
  "translation": "שכחן",
  "definition_1": "Often forgetting things, having a poor memory.",
  "definition_2": "Tending to neglect things or fail to remember them.",
  "definition_3": "Easily forgetting details or obligations.",
  "definition_4": "Not mindful of things or not paying attention.",
  "example_1": "My grandfather has become quite forgetful in his old age.",
  "example_2": "She is so forgetful that she always leaves her keys somewhere."
 },
 {
  "word": "garage (business)",
  "part_of_speech": "n",
  "translation": "מוסך (עסק)",
  "definition_1": "A business where cars are repaired, serviced, and sold.",
  "definition_2": "A building for keeping a motor vehicle.",
  "definition_3": "A commercial establishment for vehicle maintenance.",
  "definition_4": "A repair shop for automobiles.",
  "example_1": "I need to take my car to the local garage for an oil change.",
  "example_2": "He works as a mechanic at the small independent garage."
 },
 {
  "word": "gate (airport)",
  "part_of_speech": "n",
  "translation": "שער; שער יציאה (שדה תעופה)",
  "definition_1": "The point in an airport where passengers enter or leave the aircraft.",
  "definition_2": "A barrier that may be opened or closed to control entry or exit.",
  "definition_3": "An entrance or exit point, often a movable barrier in a wall or fence.",
  "definition_4": "A number designating a specific entrance at an airport terminal.",
  "example_1": "Hurry up! Our flight is boarding at Gate 32.",
  "example_2": "The farmer installed a new wooden gate to keep the cows in the field."
 },
 {
  "word": "gentleman",
  "part_of_speech": "n",
  "translation": "ג'נטלמן; אדון",
  "definition_1": "A polite or honorable man, often of high social status.",
  "definition_2": "A man who is courteous and considerate toward others.",
  "definition_3": "A term used to address or refer to a man (formal).",
  "definition_4": "A man of good behavior and manners.",
  "example_1": "He was a true gentleman, always opening doors for the women.",
  "example_2": "Ladies and gentlemen, please take your seats for the show."
 },
 {
  "word": "get away with sth",
  "part_of_speech": "phrasal verb",
  "translation": "לחמוק מעונש; להתחמק",
  "definition_1": "To do something bad and not be caught or punished for it.",
  "definition_2": "To succeed in avoiding the consequences of a wrong action.",
  "definition_3": "To manage to do something without being criticized or noticed.",
  "definition_4": "To escape from blame or trouble after performing a wrongdoing.",
  "example_1": "The thief thought he could get away with stealing the jewels.",
  "example_2": "I tried to tell a joke, but I didn't get away with it."
 },
 {
  "word": "get in",
  "part_of_speech": "phrasal verb",
  "translation": "להיכנס; להגיע",
  "definition_1": "To enter a place, often a vehicle or a building.",
  "definition_2": "To arrive at a destination.",
  "definition_3": "To be accepted into a school or organization.",
  "definition_4": "To submit an application or piece of work.",
  "example_1": "Hurry up and get in the car, we're already late.",
  "example_2": "What time does your train get in to the station?"
 },
 {
  "word": "ghost",
  "part_of_speech": "n",
  "translation": "רוח רפאים",
  "definition_1": "The spirit of a dead person that appears to the living.",
  "definition_2": "A faint or shadowy trace of something past.",
  "definition_3": "A disembodied soul believed to haunt a place.",
  "definition_4": "An image that remains on the eye after the real object is gone.",
  "example_1": "The old house is rumored to be haunted by a ghost.",
  "example_2": "She swears she saw a white figure, but it might have been a ghost."
 },
 {
  "word": "giant",
  "part_of_speech": "n",
  "translation": "ענק (אדם או יצור)",
  "definition_1": "A legendary human-like being of huge size and great strength.",
  "definition_2": "A person or thing that is notably large, powerful, or successful.",
  "definition_3": "A very large and powerful organization or business.",
  "definition_4": "A person of outstanding talent or achievement.",
  "example_1": "In the fairy tale, the hero had to trick the ferocious giant.",
  "example_2": "The company is a technological giant in the software industry."
 },
 {
  "word": "giant",
  "part_of_speech": "adj",
  "translation": "ענקי; עצום",
  "definition_1": "Extremely large or powerful.",
  "definition_2": "Describes something that is far beyond the average size.",
  "definition_3": "Of colossal or huge dimensions.",
  "definition_4": "Very great in size, degree, or intensity.",
  "example_1": "They discovered a giant footprint near the lake.",
  "example_2": "The project involved a giant leap in engineering technology."
 },
 {
  "word": "grow tired\/old\/calm, etc.",
  "part_of_speech": "phrase",
  "translation": "הופך להיות (עייף\/זקן\/רגוע וכו')",
  "definition_1": "To gradually become or start to be in a specified state.",
  "definition_2": "To enter a new condition or stage over time.",
  "definition_3": "To experience a change from one state to another.",
  "definition_4": "Used to describe a progressive transition of feeling or condition.",
  "example_1": "After two hours of hiking, I started to grow tired.",
  "example_2": "As the evening progressed, the loud room began to grow calm."
 },
 {
  "word": "hang about\/around",
  "part_of_speech": "phrasal verb",
  "translation": "להסתובב\/להתבטל (בלי מטרה)",
  "definition_1": "To spend time in a place aimlessly, often waiting for something.",
  "definition_2": "To loiter or remain in an area without a clear purpose.",
  "definition_3": "To remain in a location instead of leaving.",
  "definition_4": "To delay leaving a place.",
  "example_1": "The teenagers often hang around the park after school.",
  "example_2": "We decided to hang about the train station until our friends arrived."
 },
 {
  "word": "hang out",
  "part_of_speech": "phrasal verb",
  "translation": "לבלות (במקום מסוים); להסתובב",
  "definition_1": "To spend time relaxing or socializing in a particular location.",
  "definition_2": "To frequent a place or be a regular visitor.",
  "definition_3": "To spend time together with friends.",
  "definition_4": "To live or stay in a place for a period (informal).",
  "example_1": "On weekends, we like to hang out at the coffee shop downtown.",
  "example_2": "Where do you and your friends usually hang out?"
 },
 {
  "word": "harbor\/harbour",
  "part_of_speech": "n",
  "translation": "נמל; מפרץ (מחסה)",
  "definition_1": "A place on the coast where ships and boats can find shelter.",
  "definition_2": "A port or dock where ships are loaded and unloaded.",
  "definition_3": "A protected inlet of the sea.",
  "definition_4": "A place of refuge or safety.",
  "example_1": "Dozens of fishing boats were anchored safely in the harbor.",
  "example_2": "The city's economy relies heavily on its busy commercial harbour."
 },
 {
  "word": "heaven",
  "part_of_speech": "n",
  "translation": "שמיים; גן עדן",
  "definition_1": "The place where God or the gods live; the ultimate dwelling place of the righteous after death.",
  "definition_2": "A state of supreme happiness and bliss.",
  "definition_3": "The sky, especially the atmosphere or outer space (often used in the plural: the heavens).",
  "definition_4": "A place or condition of great beauty and comfort.",
  "example_1": "The clouds parted, revealing a bright blue patch of heaven.",
  "example_2": "Winning the championship felt like a little piece of heaven."
 },
 {
  "word": "heel",
  "part_of_speech": "n",
  "translation": "עָקֵב",
  "definition_1": "The rounded back part of the human foot.",
  "definition_2": "The part of a shoe or sock that covers this part of the foot.",
  "definition_3": "The solid piece on the bottom of a shoe that supports the back of the foot.",
  "definition_4": "A person who behaves badly or dishonestly (informal).",
  "example_1": "She had to buy new shoes because the heel on her old ones was broken.",
  "example_2": "After a long run, I felt a pain in my right heel."
 },
 {
  "word": "hell",
  "part_of_speech": "n",
  "translation": "גיהנום",
  "definition_1": "The place where evil people are believed to go after death to suffer punishment.",
  "definition_2": "A state or place of great suffering, misery, or chaos.",
  "definition_3": "Used to express anger, annoyance, or emphasis (informal).",
  "definition_4": "A terribly unpleasant or difficult experience.",
  "example_1": "He swore that driving in the city traffic was pure hell.",
  "example_2": "Religious texts often describe hell as a place of eternal fire."
 },
 {
  "word": "horror",
  "part_of_speech": "n",
  "translation": "זוועה; אימה",
  "definition_1": "An intense feeling of fear, shock, or disgust.",
  "definition_2": "A genre of fiction or film intended to cause these feelings.",
  "definition_3": "Something that causes a terrible feeling of dread.",
  "definition_4": "A strong dislike or moral outrage.",
  "example_1": "The witness described the accident with a look of pure horror on his face.",
  "example_2": "She enjoys reading books in the horror genre, full of suspense."
 },
 {
  "word": "hunt (chase)",
  "part_of_speech": "v",
  "translation": "לצוד; לרדוף",
  "definition_1": "To chase and kill wild animals for food or sport.",
  "definition_2": "To search for something or someone very carefully.",
  "definition_3": "To pursue an animal or person in order to catch them.",
  "definition_4": "To look through an area to find a specific item or person.",
  "example_1": "In the fall, many people go out to hunt deer in the forest.",
  "example_2": "The police are still hunting for the missing evidence."
 },
 {
  "word": "hurry up sb\/sth or hurry sb\/sth up",
  "part_of_speech": "phrasal verb",
  "translation": "לזרז (מישהו\/משהו)",
  "definition_1": "To cause someone or something to move or happen more quickly.",
  "definition_2": "To hasten an action or person.",
  "definition_3": "To make something finish or be completed sooner.",
  "definition_4": "To urge someone to increase their speed.",
  "example_1": "The boss told me to hurry up the delivery, as the client is waiting.",
  "example_2": "If you don't hurry up, we will miss the beginning of the movie."
 },
 {
  "word": "hut",
  "part_of_speech": "n",
  "translation": "צריף; בקתה פשוטה",
  "definition_1": "A small, simple, and often temporary dwelling or shelter.",
  "definition_2": "A crude or makeshift cabin.",
  "definition_3": "A small wooden shed or house.",
  "definition_4": "A building with very basic facilities.",
  "example_1": "They spent the night in a wooden fishing hut near the lake.",
  "example_2": "The hikers found a small hut they could use for shelter during the storm."
 },
 {
  "word": "immoral",
  "part_of_speech": "adj",
  "translation": "לא מוסרי",
  "definition_1": "Not conforming to accepted standards of morality.",
  "definition_2": "Going against what is considered right or proper behavior.",
  "definition_3": "Bad or evil in terms of moral judgment.",
  "definition_4": "Unethical and contrary to established moral principles.",
  "example_1": "Cheating on your partner is widely considered an immoral act.",
  "example_2": "The politician was accused of making immoral business decisions."
 },
 {
  "word": "in tears",
  "part_of_speech": "phrase",
  "translation": "בוכה; דומע",
  "definition_1": "Crying, with tears coming from the eyes.",
  "definition_2": "In a state of weeping or distress.",
  "definition_3": "Shedding tears due to sadness, joy, or pain.",
  "definition_4": "Describes someone who is actively crying.",
  "example_1": "She was so happy with the gift that she was in tears.",
  "example_2": "After the argument, he left the room and his friend was in tears."
 },
 {
  "word": "initial (letter of alphabet)",
  "part_of_speech": "n",
  "translation": "אות ראשונה (של שם)",
  "definition_1": "The first letter of a word, especially a person's name.",
  "definition_2": "A letter used to represent the full name of a person.",
  "definition_3": "The very beginning or first part of something.",
  "definition_4": "An abbreviation consisting of the first letter of each word.",
  "example_1": "I recognized the handwriting by the distinctive flourish of his initials.",
  "example_2": "Her full name is Mary Jane Smith, so her initials are M.J.S."
 },
 {
  "word": "insult",
  "part_of_speech": "v",
  "translation": "להעליב",
  "definition_1": "To speak to or treat someone with disrespect or rudeness.",
  "definition_2": "To say or do something that offends another person.",
  "definition_3": "To make someone feel angry or dishonored.",
  "definition_4": "To show a lack of respect by an offensive remark or action.",
  "example_1": "I didn't mean to insult your cooking, I just wasn't hungry.",
  "example_2": "He felt that the low salary offer was a personal insult."
 },
 {
  "word": "insurance",
  "part_of_speech": "n",
  "translation": "ביטוח",
  "definition_1": "An agreement where you pay a company money and they pay you back if you suffer a loss.",
  "definition_2": "A contract providing financial protection against a risk.",
  "definition_3": "A system to guarantee compensation for a specific loss.",
  "definition_4": "Financial coverage in case of damage, illness, or death.",
  "example_1": "You must have car insurance before you can drive legally.",
  "example_2": "I called my health insurance company to confirm my coverage."
 },
 {
  "word": "iron",
  "part_of_speech": "v",
  "translation": "לגהץ",
  "definition_1": "To make clothes smooth by using a hot device.",
  "definition_2": "To press fabric with a heated flat object to remove creases.",
  "definition_3": "To remove wrinkles from laundry.",
  "definition_4": "To smooth something out, literally or figuratively.",
  "example_1": "I need to iron my shirt before I wear it to the interview.",
  "example_2": "She takes her time to perfectly iron every piece of clothing."
 },
 {
  "word": "iron",
  "part_of_speech": "n",
  "translation": "מגהץ; ברזל",
  "definition_1": "A heavy, flat appliance used for pressing clothes.",
  "definition_2": "A strong, hard, magnetic metallic element.",
  "definition_3": "An essential mineral found in the body and in certain foods.",
  "definition_4": "A golf club with a metal head.",
  "example_1": "The building's frame was constructed from strong cast iron.",
  "example_2": "The electric iron heated up quickly and was ready to use."
 },
 {
  "word": "jog",
  "part_of_speech": "v",
  "translation": "לרוץ ריצה קלה",
  "definition_1": "To run at a slow, steady pace, often for exercise.",
  "definition_2": "To run lightly and easily.",
  "definition_3": "To move or push slightly (e.g., to jog someone's memory).",
  "definition_4": "To participate in a light form of running for fitness.",
  "example_1": "I like to jog in the park every morning before work.",
  "example_2": "He went for a quick jog to clear his mind after the meeting."
 },
 {
  "word": "jump (in fright)",
  "part_of_speech": "v",
  "translation": "לקפוץ (תנועה פתאומית בהפתעה)",
  "definition_1": "To make a sudden, quick movement, often because of fear or surprise.",
  "definition_2": "To push oneself off a surface and into the air.",
  "definition_3": "To move suddenly upward or forward.",
  "definition_4": "To react with a startled movement.",
  "example_1": "The cat made me jump when it suddenly appeared behind me.",
  "example_2": "I jumped when the phone rang loudly in the quiet room."
 },
 {
  "word": "jury",
  "part_of_speech": "n",
  "translation": "חבר מושבעים",
  "definition_1": "A group of ordinary citizens selected to hear evidence and decide a verdict in a legal case.",
  "definition_2": "The group that judges a competition or contest.",
  "definition_3": "A body of people sworn to give a decision on a matter.",
  "definition_4": "The group responsible for making a final, official judgment.",
  "example_1": "The jury retired to the deliberation room to discuss the case.",
  "example_2": "She was called to serve on a jury for the first time."
 },
 {
  "word": "knit",
  "part_of_speech": "v",
  "translation": "לסרוג",
  "definition_1": "To make clothing or fabric by interlocking loops of yarn with needles.",
  "definition_2": "To join or link together closely.",
  "definition_3": "To draw eyebrows together in a frown.",
  "definition_4": "To repair a broken bone by growing new tissue (e.g., the bone is knitting).",
  "example_1": "My grandmother loves to knit sweaters for all her grandchildren.",
  "example_2": "She spends her evenings knitting socks and scarves."
 },
 {
  "word": "laser",
  "part_of_speech": "n",
  "translation": "לייזר",
  "definition_1": "A device that produces a powerful, narrow beam of light.",
  "definition_2": "A focused beam of light used in various technologies (e.g., medicine, industry).",
  "definition_3": "An acronym for Light Amplification by Stimulated Emission of Radiation.",
  "definition_4": "A concentrated, monochromatic light source.",
  "example_1": "The doctor used a powerful laser to perform the delicate surgery.",
  "example_2": "A small red laser beam was used to point at the screen during the presentation."
 },
 {
  "word": "lead (winning)",
  "part_of_speech": "n",
  "translation": "יתרון; הובלה",
  "definition_1": "The position ahead of all others in a race or competition.",
  "definition_2": "The amount by which one competitor is ahead of the others.",
  "definition_3": "The main role in a play or movie.",
  "definition_4": "An item of information or clue that guides a search or investigation.",
  "example_1": "Our team took the lead in the second half of the game.",
  "example_2": "The runner held a comfortable lead right up until the finish line."
 },
 {
  "word": "learning",
  "part_of_speech": "n",
  "translation": "למידה; השכלה",
  "definition_1": "The acquisition of knowledge or skills through study, experience, or being taught.",
  "definition_2": "Knowledge gained through education or experience.",
  "definition_3": "The process of obtaining new skills or understanding.",
  "definition_4": "Scholarly activity or deep knowledge.",
  "example_1": "Lifelong learning is crucial for professional development.",
  "example_2": "The scientist dedicated his entire life to the pursuit of learning."
 },
 {
  "word": "lightning",
  "part_of_speech": "n",
  "translation": "ברק",
  "definition_1": "The visible flash of light caused by an electrical discharge during a thunderstorm.",
  "definition_2": "A sudden, large electrical spark in the atmosphere.",
  "definition_3": "A brilliant flash of light in the sky.",
  "definition_4": "Extremely fast speed (used as an adjective, e.g., lightning speed).",
  "example_1": "We saw a brilliant flash of lightning followed by a clap of thunder.",
  "example_2": "The photographer managed to capture the perfect picture of the lightning."
 },
 {
  "word": "literary",
  "part_of_speech": "adj",
  "translation": "ספרותי",
  "definition_1": "Concerning the writing, study, or content of literature.",
  "definition_2": "Relating to books or creative writing, especially high-quality writing.",
  "definition_3": "Describes language that is formal and written rather than spoken.",
  "definition_4": "Having knowledge of literature.",
  "example_1": "She won a prestigious award for her latest literary achievement.",
  "example_2": "The discussion focused on the literary themes in Shakespeare's plays."
 },
 {
  "word": "loaf",
  "part_of_speech": "n",
  "translation": "ככר (לחם)",
  "definition_1": "A mass of baked bread, typically shaped for slicing.",
  "definition_2": "An entire unit of bread or similar food baked in one piece.",
  "definition_3": "A mass of food, such as meat or sugar, shaped like a loaf of bread.",
  "definition_4": "A single, undivided mass of bread.",
  "example_1": "I bought a fresh loaf of sourdough bread from the bakery.",
  "example_2": "Please slice the entire loaf for the sandwiches."
 },
 {
  "word": "loose",
  "part_of_speech": "adj",
  "translation": "רופף; משוחרר",
  "definition_1": "Not firmly or tightly fixed in place.",
  "definition_2": "Not fitting tightly or closely (e.g., clothes).",
  "definition_3": "Free from restraint or restriction.",
  "definition_4": "Not dense or compact in structure.",
  "example_1": "The screw in the table leg was loose and needed to be tightened.",
  "example_2": "She prefers to wear comfortable, loose-fitting clothes at home."
 },
 {
  "word": "madam (polite way of speaking to a woman)",
  "part_of_speech": "n",
  "translation": "גברת (פנייה מנומסת לאישה)",
  "definition_1": "A polite and formal way to address or refer to a woman.",
  "definition_2": "Used as a title for a woman in charge of a household or establishment.",
  "definition_3": "The female equivalent of \"sir.\"",
  "definition_4": "A courteous term of address for a woman whose name is unknown.",
  "example_1": "Excuse me, madam, you seem to have dropped your wallet.",
  "example_2": "The hotel receptionist greeted me with a polite, 'Good morning, madam.'"
 },
 {
  "word": "magnificent",
  "part_of_speech": "adj",
  "translation": "מרהיב; נהדר; מפואר",
  "definition_1": "Extremely beautiful, impressive, or great.",
  "definition_2": "Grand in appearance or style.",
  "definition_3": "Excellent, wonderful, or superb.",
  "definition_4": "Worthy of high praise or admiration.",
  "example_1": "The view from the top of the mountain was absolutely magnificent.",
  "example_2": "She gave a magnificent performance that earned a standing ovation."
 },
 {
  "word": "make (arrive)",
  "part_of_speech": "v",
  "translation": "להגיע",
  "definition_1": "To succeed in reaching a place or arriving on time.",
  "definition_2": "To create or construct something.",
  "definition_3": "To force or cause someone to do something.",
  "definition_4": "To manage to attend an event.",
  "example_1": "We had to run to the station to make the 8:15 train.",
  "example_2": "I'm sorry, I won't be able to make the meeting tomorrow."
 },
 {
  "word": "marriage",
  "part_of_speech": "n",
  "translation": "נישואין",
  "definition_1": "The legally or formally recognized union of two people as partners in a personal relationship.",
  "definition_2": "The state of being married.",
  "definition_3": "A close, successful combination of two things.",
  "definition_4": "The ceremony itself, or the institution of being husband and wife.",
  "example_1": "They celebrated fifty years of happy marriage last year.",
  "example_2": "The country recently passed a law recognizing same-sex marriage."
 },
 {
  "word": "mask",
  "part_of_speech": "n",
  "translation": "מסכה",
  "definition_1": "A covering worn over all or part of the face to disguise or protect.",
  "definition_2": "A protective face covering used to filter the air (e.g., medical mask).",
  "definition_3": "A way of hiding your true feelings or character.",
  "definition_4": "An object worn to change one's identity for a costume party.",
  "example_1": "She wore a black velvet mask to the costume ball.",
  "example_2": "You are required to wear a protective mask when working with chemicals."
 },
 {
  "word": "mate",
  "part_of_speech": "n",
  "translation": "חבר; בן\/בת זוג",
  "definition_1": "A friend or companion (especially in British English).",
  "definition_2": "A person's husband, wife, or sexual partner.",
  "definition_3": "A breeding partner of an animal.",
  "definition_4": "A subordinate officer on a merchant ship.",
  "example_1": "Hey, mate, can you help me carry these boxes?",
  "example_2": "Lions often stay with the same mate for many years."
 },
 {
  "word": "mess",
  "part_of_speech": "n",
  "translation": "בלגן; בלאגן; אי-סדר",
  "definition_1": "A dirty, untidy, or disorderly condition.",
  "definition_2": "A situation that is confusing or difficult to deal with.",
  "definition_3": "A place or state of extreme untidiness.",
  "definition_4": "A state of trouble or difficulty.",
  "example_1": "The children left a huge mess in the living room after playing.",
  "example_2": "I need to sort out the financial mess before the end of the year."
 },
 {
  "word": "mineral water",
  "part_of_speech": "n",
  "translation": "מים מינרליים",
  "definition_1": "Water from a natural spring that contains various dissolved minerals.",
  "definition_2": "Bottled water that is often sparkling and rich in salts.",
  "definition_3": "Water that is believed to be beneficial for health due to its content.",
  "definition_4": "Drinking water with a specific chemical composition.",
  "example_1": "Would you like sparkling or still mineral water with your meal?",
  "example_2": "He prefers the taste of filtered tap water over expensive mineral water."
 },
 {
  "word": "mix up sb\/sth or mix sb\/sth up",
  "part_of_speech": "phrasal verb",
  "translation": "לבלבל (אדם\/דבר); לערבב",
  "definition_1": "To confuse two or more people or things with each other.",
  "definition_2": "To fail to distinguish between different items or individuals.",
  "definition_3": "To put things together in a disordered fashion.",
  "definition_4": "To create confusion or disorder.",
  "example_1": "I always mix up the twins because they look so much alike.",
  "example_2": "The airline mixed up my suitcase with another passenger's luggage."
 },
 {
  "word": "monster",
  "part_of_speech": "n",
  "translation": "מפלצת",
  "definition_1": "A large, ugly, and frightening imaginary creature.",
  "definition_2": "An extremely wicked or cruel person.",
  "definition_3": "An animal or thing of abnormal size or appearance.",
  "definition_4": "A legendary frightening beast.",
  "example_1": "The book is about a benevolent monster who lives under a bridge.",
  "example_2": "He became a financial monster by taking over dozens of smaller companies."
 },
 {
  "word": "moral",
  "part_of_speech": "n",
  "translation": "מוסר השכל; לקח",
  "definition_1": "A lesson, especially a practical one, that can be drawn from a story or experience.",
  "definition_2": "Standards of behavior and principles of right and wrong.",
  "definition_3": "A person's sense of right and wrong.",
  "definition_4": "The teaching or message embedded in a narrative.",
  "example_1": "The moral of the story is that honesty is always the best policy.",
  "example_2": "Despite his mistakes, he never lost his strong sense of personal moral."
 },
 {
  "word": "naked",
  "part_of_speech": "adj",
  "translation": "עירום",
  "definition_1": "Not wearing any clothes or covering.",
  "definition_2": "Bare, without any layer or disguise.",
  "definition_3": "Exposed or uncovered.",
  "definition_4": "Used to describe an object that is not protected or shielded.",
  "example_1": "He couldn't go swimming because he forgot his suit and refused to go in naked.",
  "example_2": "The trees stood naked and gray after the leaves fell off."
 },
 {
  "word": "nasty",
  "part_of_speech": "adj",
  "translation": "מגעיל; רע; דוחה",
  "definition_1": "Very unpleasant to see, smell, or taste.",
  "definition_2": "Unkind or malicious in behavior or character.",
  "definition_3": "Harmful or dangerous.",
  "definition_4": "Difficult or serious (used for injuries or weather).",
  "example_1": "That wound looks very nasty; you should clean it immediately.",
  "example_2": "I found a nasty stain on my new shirt."
 },
 {
  "word": "navy",
  "part_of_speech": "n",
  "translation": "חיל הים",
  "definition_1": "The branch of a country's military that fights at sea using ships.",
  "definition_2": "The total fleet of ships used for naval warfare.",
  "definition_3": "The military organization responsible for operations on the water.",
  "definition_4": "A deep, dark blue color.",
  "example_1": "He decided to enlist in the navy right after finishing school.",
  "example_2": "The country deployed its entire battle navy to the area."
 },
 {
  "word": "neat",
  "part_of_speech": "adj",
  "translation": "מסודר; נקי",
  "definition_1": "Tidy, orderly, and well-organized.",
  "definition_2": "Simple but effective; clever (often used for ideas).",
  "definition_3": "Served without water or ice (e.g., a drink).",
  "definition_4": "Describes something that is clean, precise, and skillfully done.",
  "example_1": "Her desk is always incredibly neat, with everything in its place.",
  "example_2": "That's a neat solution to the complex problem."
 },
 {
  "word": "next door",
  "part_of_speech": "phrase",
  "translation": "הבית ליד; בשכנות",
  "definition_1": "In the next house or apartment; adjacent.",
  "definition_2": "Located immediately beside a specific place.",
  "definition_3": "Describes a place very close to yours.",
  "definition_4": "Living or being located in the property closest to your own.",
  "example_1": "Our new neighbors who moved in next door are very quiet.",
  "example_2": "I'll just pop into the shop next door to buy some milk."
 },
 {
  "word": "not believe your eyes\/ears",
  "part_of_speech": "phrase",
  "translation": "לא להאמין למראה עינייך\/מה שאתה שומע",
  "definition_1": "To be extremely surprised or shocked by something you see or hear.",
  "definition_2": "To find a sight or sound so extraordinary that you think it must be false.",
  "definition_3": "To be utterly astonished by a visual or auditory experience.",
  "definition_4": "A phrase expressing immense disbelief due to a startling event.",
  "example_1": "When I saw the price, I could not believe my eyes.",
  "example_2": "She was so happy about the news that she could not believe her ears."
 },
 {
  "word": "nut",
  "part_of_speech": "n",
  "translation": "אגוז",
  "definition_1": "A hard-shelled fruit containing an edible kernel.",
  "definition_2": "A small block of metal with a threaded hole, used with a bolt.",
  "definition_3": "A crazy or eccentric person (informal).",
  "definition_4": "An edible kernel enclosed in a woody shell.",
  "example_1": "The recipe calls for a handful of chopped walnuts and other nuts.",
  "example_2": "Be careful not to lose the tiny nut that holds the wheel in place."
 },
 {
  "word": "on a diet",
  "part_of_speech": "phrase",
  "translation": "בדיאטה",
  "definition_1": "Restricting oneself to small amounts or special kinds of food in order to lose weight.",
  "definition_2": "Following a specific eating plan for health or weight control reasons.",
  "definition_3": "Actively trying to manage one's food intake.",
  "definition_4": "Currently limiting what one eats to achieve a health goal.",
  "example_1": "No dessert for me, thank you; I'm on a diet.",
  "example_2": "The doctor recommended that he go on a diet to improve his blood pressure."
 },
 {
  "word": "on board",
  "part_of_speech": "phrase",
  "translation": "על הסיפון; על המטוס\/רכבת\/אוטובוס",
  "definition_1": "Present on a ship, train, plane, or other vehicle.",
  "definition_2": "Being part of a team or organization.",
  "definition_3": "Agreeing with a plan or idea (informal).",
  "definition_4": "Physically situated on the vehicle used for travel.",
  "example_1": "All the passengers are now on board, and the plane is ready for takeoff.",
  "example_2": "I'm glad to have you on board for this new and exciting project."
 },
 {
  "word": "on display",
  "part_of_speech": "phrase",
  "translation": "מוצג; בתצוגה",
  "definition_1": "Visible for people to look at, especially in a public place.",
  "definition_2": "Arranged for public exhibition.",
  "definition_3": "Being shown or exhibited for viewing.",
  "definition_4": "Easily noticeable or available for others to see.",
  "example_1": "The museum's oldest artifacts are on display in the main hall.",
  "example_2": "His anger was clearly on display for everyone to witness."
 },
 {
  "word": "on duty\/off duty",
  "part_of_speech": "phrase",
  "translation": "בתפקיד\/מחוץ לתפקיד",
  "definition_1": "Working, performing one's professional job (on duty).",
  "definition_2": "Not working, free from professional responsibilities (off duty).",
  "definition_3": "Available and required to perform assigned tasks.",
  "definition_4": "Describing a period when a person, especially a professional, is or is not at work.",
  "example_1": "The guard cannot talk to you right now because he is on duty.",
  "example_2": "A police officer is rarely truly off duty; they must act when a crime occurs."
 },
 {
  "word": "orchestra",
  "part_of_speech": "n",
  "translation": "תזמורת",
  "definition_1": "A large group of musicians playing different instruments together, directed by a conductor.",
  "definition_2": "The area in a theater where the musicians sit (also called the pit).",
  "definition_3": "A musical ensemble of strings, woodwind, brass, and percussion.",
  "definition_4": "A large, highly-organized group performing classical music.",
  "example_1": "The city orchestra played a beautiful symphony by Beethoven.",
  "example_2": "She plays the violin in the school's youth orchestra."
 },
 {
  "word": "pack",
  "part_of_speech": "n",
  "translation": "חבילה; להקה; צרור",
  "definition_1": "A group of wild animals that hunt together (e.g., wolves).",
  "definition_2": "A collection of things wrapped or tied together for carrying.",
  "definition_3": "A set of related items, such as a deck of cards.",
  "definition_4": "A large number or quantity of something.",
  "example_1": "The lost hiker was worried about the pack of wolves nearby.",
  "example_2": "I need to buy a new pack of envelopes from the post office."
 },
 {
  "word": "painful",
  "part_of_speech": "adj",
  "translation": "כואב",
  "definition_1": "Causing physical or emotional suffering or discomfort.",
  "definition_2": "Describing an injury or illness that causes a sensation of pain.",
  "definition_3": "Difficult or unpleasant to deal with.",
  "definition_4": "Causing a bad sensation in the body or mind.",
  "example_1": "The dentist said the procedure would be only slightly painful.",
  "example_2": "It was a painful memory that she tried hard to forget."
 },
 {
  "word": "pale",
  "part_of_speech": "adj",
  "translation": "חיוור",
  "definition_1": "Having a light color, or lighter than usual.",
  "definition_2": "Describes a person's skin that is whiter than normal, usually due to illness or fear.",
  "definition_3": "Lacking intensity or brightness.",
  "definition_4": "Not strong or intense in color.",
  "example_1": "She looked very pale after the doctor gave her the bad news.",
  "example_2": "The walls of the room were painted a pale shade of blue."
 },
 {
  "word": "passage (connecting way)",
  "part_of_speech": "n",
  "translation": "מעבר (דרך מחברת)",
  "definition_1": "A narrow way allowing people to pass, such as a corridor or tunnel.",
  "definition_2": "A section or portion of a written work or music.",
  "definition_3": "The act of moving through or past something.",
  "definition_4": "A long, narrow area connecting different rooms or areas.",
  "example_1": "We walked down the dark, secret passage to the back exit.",
  "example_2": "The ship had a smooth passage across the stormy ocean."
 },
 {
  "word": "pavement",
  "part_of_speech": "n",
  "translation": "מדרכה (בריטי); ריצוף",
  "definition_1": "A paved surface, especially the sidewalk next to a road (British English).",
  "definition_2": "The hard surface of a road or street.",
  "definition_3": "A path for pedestrians at the side of a street.",
  "definition_4": "A surface layer designed for walking or driving on.",
  "example_1": "The children were playing on the pavement outside their house.",
  "example_2": "I slipped on the icy pavement and hurt my knee."
 },
 {
  "word": "peak",
  "part_of_speech": "n",
  "translation": "פסגה; שיא",
  "definition_1": "The pointed top of a mountain.",
  "definition_2": "The point of greatest success, intensity, or activity.",
  "definition_3": "The highest point or level.",
  "definition_4": "The visor on the front of a cap.",
  "example_1": "The hikers reached the mountain peak just as the sun was setting.",
  "example_2": "The store is always at its sales peak right before the holidays."
 },
 {
  "word": "penalty",
  "part_of_speech": "n",
  "translation": "עונש; קנס",
  "definition_1": "A punishment for breaking a rule or a law.",
  "definition_2": "A disadvantage or suffering due to an action or omission.",
  "definition_3": "A fine or payment imposed for breaking a contract or rule.",
  "definition_4": "A disadvantage awarded against a team for breaking rules in a sport.",
  "example_1": "The referee awarded a penalty kick to the opposing team.",
  "example_2": "There is a severe penalty for late submission of tax forms."
 },
 {
  "word": "pill",
  "part_of_speech": "n",
  "translation": "גלולה",
  "definition_1": "A small, solid piece of medicine that you swallow whole.",
  "definition_2": "A tablet containing a dose of medication.",
  "definition_3": "A small, rounded mass of material.",
  "definition_4": "Something annoying or unpleasant that one has to endure (e.g., a bitter pill).",
  "example_1": "The doctor prescribed a pill to help me sleep better.",
  "example_2": "You should take this pill twice a day after your meals."
 },
 {
  "word": "pin",
  "part_of_speech": "n",
  "translation": "סיכה; נעץ",
  "definition_1": "A thin piece of metal with a sharp point and a rounded head, used for fastening.",
  "definition_2": "A small, pointed piece of jewelry that fastens onto clothing.",
  "definition_3": "A metal fastener used to hold parts of a machine together.",
  "definition_4": "The object a bowler aims at in the sport of bowling.",
  "example_1": "She used a safety pin to secure the flower to her dress.",
  "example_2": "Use a drawing pin to attach the notice to the board."
 },
 {
  "word": "pity",
  "part_of_speech": "n",
  "translation": "רחמים; חמלה",
  "definition_1": "A feeling of sorrow and sympathy for the suffering or unhappiness of others.",
  "definition_2": "A cause for regret or disappointment (e.g., \"What a pity\").",
  "definition_3": "Compassionate sadness for someone who is struggling.",
  "definition_4": "A feeling of sorrow aroused by misfortune.",
  "example_1": "It's a great pity that they had to cancel the entire event.",
  "example_2": "She looked at the stray dog with feelings of pity and concern."
 },
 {
  "word": "pray",
  "part_of_speech": "v",
  "translation": "להתפלל",
  "definition_1": "To address a god or spirit with reverence, usually to express thanks or make a request.",
  "definition_2": "To hope very much for something to happen.",
  "definition_3": "To communicate with a deity.",
  "definition_4": "To implore or earnestly request something.",
  "example_1": "Every night before bed, she would pray for her family's safety.",
  "example_2": "I just pray that the flight won't be delayed because of the storm."
 },
 {
  "word": "pregnant",
  "part_of_speech": "adj",
  "translation": "בהיריון",
  "definition_1": "Carrying a developing embryo or fetus in the uterus.",
  "definition_2": "Having a baby or babies developing inside the body.",
  "definition_3": "Describes a woman or female animal that is expecting offspring.",
  "definition_4": "Full of meaning or importance (figurative use).",
  "example_1": "The doctor confirmed that she was three months pregnant.",
  "example_2": "They are excited because their cat is finally pregnant."
 },
 {
  "word": "priest",
  "part_of_speech": "n",
  "translation": "כומר; כהן דת",
  "definition_1": "A religious minister authorized to perform religious rites, especially in Christianity.",
  "definition_2": "A person whose office is to perform sacrifice or other sacred functions.",
  "definition_3": "A cleric who has been ordained to administer the sacraments.",
  "definition_4": "A religious leader in a church or other place of worship.",
  "example_1": "The priest gave a moving sermon about forgiveness.",
  "example_2": "He spoke with the priest about his decision to join the monastery."
 },
 {
  "word": "propose (suggest marriage)",
  "part_of_speech": "v",
  "translation": "להציע (נישואין)",
  "definition_1": "To ask someone to marry you.",
  "definition_2": "To suggest a plan or idea for consideration.",
  "definition_3": "To put forward a name or plan formally.",
  "definition_4": "To make a formal suggestion for action.",
  "example_1": "He got down on one knee at the restaurant to propose to her.",
  "example_2": "The committee will propose a change to the company's vacation policy."
 },
 {
  "word": "pump",
  "part_of_speech": "n",
  "translation": "משאבה",
  "definition_1": "A device used to raise, transfer, or compress fluids or gases.",
  "definition_2": "A machine for forcing air or liquid into or out of something.",
  "definition_3": "A particular type of shoe with a low-cut front.",
  "definition_4": "The equipment used to dispense petrol at a gas station.",
  "example_1": "The swimming pool needs a new water pump to keep it clean.",
  "example_2": "I used the bicycle pump to inflate the flat tire."
 },
 {
  "word": "pump",
  "part_of_speech": "v",
  "translation": "לשאוב; לנפח (במשאבה)",
  "definition_1": "To force liquid or gas to move using a device.",
  "definition_2": "To inflate something, like a tire, with air.",
  "definition_3": "To force a lot of information or money into something quickly.",
  "definition_4": "To push something rapidly and repeatedly (e.g., your heart is pumping).",
  "example_1": "The firefighters had to pump the water out of the flooded basement.",
  "example_2": "He started to pump his fist in the air when his team scored."
 },
 {
  "word": "queue",
  "part_of_speech": "n",
  "translation": "תור (בריטי)",
  "definition_1": "A line of people or vehicles waiting for something.",
  "definition_2": "A single file line of people, often waiting their turn.",
  "definition_3": "A list of tasks or data waiting to be processed by a computer system.",
  "definition_4": "A braid of hair hanging down the back.",
  "example_1": "I had to wait in a long queue for tickets to the concert.",
  "example_2": "Please stand in the queue and wait for your number to be called."
 },
 {
  "word": "racket (sport)",
  "part_of_speech": "n",
  "translation": "מחבט (ספורט)",
  "definition_1": "A light, bat-like object used in tennis or badminton to hit the ball.",
  "definition_2": "A loud, unpleasant noise or clamor.",
  "definition_3": "A dishonest or illegal scheme for obtaining money.",
  "definition_4": "A piece of sports equipment with a netted frame for hitting a ball.",
  "example_1": "She bought a new tennis racket that was lighter than her old one.",
  "example_2": "The neighbors complained about the loud racket coming from the party."
 },
 {
  "word": "rainbow",
  "part_of_speech": "n",
  "translation": "קשת בענן",
  "definition_1": "An arch of colors seen in the sky, caused by the sun shining through water droplets.",
  "definition_2": "A multicolored arc appearing after or during rain.",
  "definition_3": "A symbol of hope or promise.",
  "definition_4": "A spectacular optical phenomenon.",
  "example_1": "After the brief shower, a beautiful rainbow appeared over the valley.",
  "example_2": "The artist painted a vibrant rainbow in the background of the landscape."
 },
 {
  "word": "range (mountains)",
  "part_of_speech": "n",
  "translation": "רכס (הרים)",
  "definition_1": "A set of mountains or hills connected in a line.",
  "definition_2": "A full set of products, services, or items of a particular type.",
  "definition_3": "The extent to which something can be affected or measured.",
  "definition_4": "A distance or area over which something operates or extends.",
  "example_1": "We could see the entire snow-capped mountain range from the lodge.",
  "example_2": "The new cars have an incredible driving range of 500 miles."
 },
 {
  "word": "refund",
  "part_of_speech": "n",
  "translation": "החזר (כספי)",
  "definition_1": "An amount of money paid back to a customer because they returned a product.",
  "definition_2": "A repayment of money.",
  "definition_3": "The amount of money given back after a purchase or overpayment.",
  "definition_4": "A sum of money returned.",
  "example_1": "I asked for a full refund after realizing the shoes were the wrong size.",
  "example_2": "The store offers a hassle-free refund policy on all items."
 },
 {
  "word": "refund",
  "part_of_speech": "v",
  "translation": "להחזיר (כסף); להשיב",
  "definition_1": "To pay back money to someone, usually because they returned a product or overpaid.",
  "definition_2": "To reimburse a customer.",
  "definition_3": "To give back an amount of money.",
  "definition_4": "To repay the cost of an item or service.",
  "example_1": "The airline promised to refund my ticket cost since the flight was canceled.",
  "example_2": "They will refund the difference if you find the same item cheaper elsewhere."
 },
 {
  "word": "regards",
  "part_of_speech": "n",
  "translation": "ברכות; דרישת שלום",
  "definition_1": "Greetings or expressions of respect or friendly feeling (used in the plural).",
  "definition_2": "A way to send polite wishes to another person.",
  "definition_3": "Attention or consideration.",
  "definition_4": "Often used at the end of a formal or semi-formal letter.",
  "example_1": "Please give my best regards to your parents when you see them.",
  "example_2": "He sent his kindest regards from his business trip in Europe."
 },
 {
  "word": "republic",
  "part_of_speech": "n",
  "translation": "רפובליקה",
  "definition_1": "A state in which supreme power is held by the people and their elected representatives.",
  "definition_2": "A country where the head of state is a president rather than a monarch.",
  "definition_3": "A form of government where the citizens choose their leaders.",
  "definition_4": "A political system not based on a hereditary ruler.",
  "example_1": "France is a famous example of a democratic republic.",
  "example_2": "The new nation was founded as a free and sovereign republic."
 },
 {
  "word": "resort",
  "part_of_speech": "n",
  "translation": "אתר נופש; מוצא אחרון",
  "definition_1": "A place where many people go for vacation or recreation.",
  "definition_2": "The act of turning to a source of help in a difficult situation (e.g., as a last resort).",
  "definition_3": "A popular place for leisure activities.",
  "definition_4": "A place frequently visited for relaxation or sport.",
  "example_1": "We stayed at a luxury ski resort in the Swiss Alps.",
  "example_2": "The lawyer decided to use a lawsuit as a last resort."
 },
 {
  "word": "rob",
  "part_of_speech": "v",
  "translation": "לשדוד",
  "definition_1": "To take money or property illegally from a person or place, often using force or threat.",
  "definition_2": "To steal from a bank, store, or individual.",
  "definition_3": "To commit the crime of robbery.",
  "definition_4": "To deprive someone of something unfairly.",
  "example_1": "Two masked men tried to rob the jewelry store late last night.",
  "example_2": "He was arrested for attempting to rob a tourist in the city center."
 },
 {
  "word": "romantic",
  "part_of_speech": "adj",
  "translation": "רומנטי",
  "definition_1": "Relating to or involving love or a loving relationship.",
  "definition_2": "Suggestive of an idealized and exciting quality.",
  "definition_3": "Expressing love or desire.",
  "definition_4": "Characterized by feelings of excitement and mystery.",
  "example_1": "He planned a very romantic dinner for their anniversary.",
  "example_2": "Paris is often considered one of the most romantic cities in the world."
 },
 {
  "word": "rope",
  "part_of_speech": "n",
  "translation": "חבל",
  "definition_1": "A length of strong, thick cord made from twisted strands.",
  "definition_2": "A very thick and strong string used for pulling or tying things.",
  "definition_3": "A cord used for climbing or securing boats.",
  "definition_4": "A thick line of material.",
  "example_1": "We used a strong nylon rope to pull the car out of the mud.",
  "example_2": "Tie the packages together with this piece of rope."
 },
 {
  "word": "rub out sth or rub sth out",
  "part_of_speech": "phrasal verb",
  "translation": "למחוק (עם מחק); לחסל",
  "definition_1": "To remove writing or marks, usually by rubbing with an eraser.",
  "definition_2": "To completely get rid of something, such as a mistake or trace.",
  "definition_3": "To kill someone (slang\/informal).",
  "definition_4": "To erase a written or drawn item.",
  "example_1": "I made a spelling mistake, so I had to rub it out.",
  "example_2": "The teacher asked the student to rub out the drawing from the board."
 },
 {
  "word": "rubber (substance)",
  "part_of_speech": "n",
  "translation": "גומי; מחק",
  "definition_1": "A strong, elastic substance made from a plant or synthetically.",
  "definition_2": "A piece of this material used to erase pencil marks (British English).",
  "definition_3": "A synthetic material that is flexible and waterproof.",
  "definition_4": "An eraser for correcting mistakes.",
  "example_1": "The soles of these shoes are made from durable recycled rubber.",
  "example_2": "I need a better rubber to completely remove this pencil line."
 },
 {
  "word": "rubbish (waste; bad quality)",
  "part_of_speech": "n",
  "translation": "זבל; אשפה; שטויות",
  "definition_1": "Waste material or unwanted things that are thrown away (trash\/garbage).",
  "definition_2": "Something that is of very poor quality or skill.",
  "definition_3": "Nonsense or absurd ideas.",
  "definition_4": "Materials destined for disposal.",
  "example_1": "Please put all the food containers in the rubbish bin.",
  "example_2": "His latest novel is absolute rubbish; it's poorly written."
 },
 {
  "word": "rude",
  "part_of_speech": "adj",
  "translation": "גס רוח; חצוף",
  "definition_1": "Impolite, offensively bold, or showing a lack of respect.",
  "definition_2": "Not subtle or refined (e.g., a rude shock).",
  "definition_3": "Describes an action or person that is disrespectful.",
  "definition_4": "Insensitive or unpolished in manner.",
  "example_1": "It was rude of him to answer the phone during dinner.",
  "example_2": "The customer service agent was very rude and unhelpful."
 },
 {
  "word": "scandal",
  "part_of_speech": "n",
  "translation": "שערורייה",
  "definition_1": "An action or event that is shocking and causes strong public outrage.",
  "definition_2": "An event that brings disgrace and moral disapproval.",
  "definition_3": "Damage to reputation caused by improper behavior.",
  "definition_4": "A widely publicized incident of morally or legally improper behavior.",
  "example_1": "The politician resigned after a major financial scandal broke.",
  "example_2": "The discovery of the hidden documents caused a huge public scandal."
 },
 {
  "word": "scratch",
  "part_of_speech": "n",
  "translation": "שריטה; נזק קל",
  "definition_1": "A small, shallow cut or mark on a surface or skin.",
  "definition_2": "The sound made by a sharp object being drawn across a surface.",
  "definition_3": "Minor injury to the skin that is a break in the surface.",
  "definition_4": "A starting point (e.g., from scratch).",
  "example_1": "Be careful not to leave a scratch on the new wooden floor.",
  "example_2": "She only got a small scratch on her arm when she fell."
 },
 {
  "word": "scratch (hurt, damage)",
  "part_of_speech": "v",
  "translation": "לשרוט; לפגוע",
  "definition_1": "To mark a surface with a sharp object.",
  "definition_2": "To rub your skin with your fingernails to relieve itching.",
  "definition_3": "To cause a shallow wound or minor damage.",
  "definition_4": "To withdraw from a competition.",
  "example_1": "The cat tried to scratch at the door to be let inside.",
  "example_2": "I need to scratch this mosquito bite; it's so itchy."
 },
 {
  "word": "sculpture",
  "part_of_speech": "n",
  "translation": "פסל; פיסול",
  "definition_1": "The art of making two or three-dimensional forms by carving or molding.",
  "definition_2": "A work of art made by carving wood, stone, or clay.",
  "definition_3": "A three-dimensional artistic representation.",
  "definition_4": "The process of creating figures or designs in solid material.",
  "example_1": "The artist displayed a new abstract metal sculpture in the gallery.",
  "example_2": "She is studying sculpture at the local art college."
 },
 {
  "word": "see off sb or see sb off",
  "part_of_speech": "phrasal verb",
  "translation": "ללוות (מישהו שעוזב\/מגיע); להיפטר מ",
  "definition_1": "To go to an airport or station to say goodbye to someone who is leaving.",
  "definition_2": "To force someone to leave a place.",
  "definition_3": "To defeat an opponent (informal).",
  "definition_4": "To accompany a traveler to the beginning of their journey.",
  "example_1": "My family came to the airport to see me off before my flight.",
  "example_2": "We had to see off the salesman who wouldn't leave our house."
 },
 {
  "word": "selfish",
  "part_of_speech": "adj",
  "translation": "אנוכי",
  "definition_1": "Caring only about oneself and not about other people.",
  "definition_2": "Lacking consideration for others; centered only on personal gain.",
  "definition_3": "Thinking too much about your own needs and not enough about others.",
  "definition_4": "Putting one's own interests before the interests of others.",
  "example_1": "It was very selfish of him to take the last slice of cake without asking.",
  "example_2": "She decided to stop being so selfish and volunteer her time."
 },
 {
  "word": "separate (husband\/wife)",
  "part_of_speech": "v",
  "translation": "להיפרד (בני זוג)",
  "definition_1": "To end a relationship, especially a marriage, without getting a legal divorce.",
  "definition_2": "To move or be moved apart.",
  "definition_3": "To divide into distinct parts.",
  "definition_4": "To become disconnected or disjointed.",
  "example_1": "The couple decided to separate for six months before filing for divorce.",
  "example_2": "The machine is designed to separate the paper from the plastic."
 },
 {
  "word": "shade (no sunlight)",
  "part_of_speech": "n",
  "translation": "צל",
  "definition_1": "A place that is slightly dark because sunlight is blocked by an object.",
  "definition_2": "The quality of relative darkness caused by being sheltered from light.",
  "definition_3": "A degree of darkness or lightness in a color (a hue).",
  "definition_4": "Something that protects from the sun or bright light.",
  "example_1": "It was so hot that we rested in the cool shade of the large tree.",
  "example_2": "The paint color has a slightly darker shade of blue than I expected."
 },
 {
  "word": "shake your head",
  "part_of_speech": "phrase",
  "translation": "לנער את הראש (סימן לשלילה\/אי הסכמה)",
  "definition_1": "To turn your head from side to side to signal 'no' or to express disagreement.",
  "definition_2": "An action used to show denial, refusal, or disappointment.",
  "definition_3": "To move the head in a rapid, side-to-side motion.",
  "definition_4": "To move your head to express disbelief or sadness.",
  "example_1": "I asked if he was ready, and he just silently shook his head.",
  "example_2": "The doctor could only shake his head in frustration at the patient's refusal to listen."
 },
 {
  "word": "shave",
  "part_of_speech": "v",
  "translation": "להתגלח",
  "definition_1": "To cut the hair very close to the skin, typically from the face or legs.",
  "definition_2": "To remove a thin layer from a surface.",
  "definition_3": "To remove beard or body hair with a razor.",
  "definition_4": "To barely pass or escape a difficult situation.",
  "example_1": "He has to shave every morning before going to work.",
  "example_2": "I try to shave a few minutes off my usual running time."
 },
 {
  "word": "shave",
  "part_of_speech": "n",
  "translation": "גילוח",
  "definition_1": "The act of cutting hair very close to the skin.",
  "definition_2": "The result of the act of using a razor.",
  "definition_3": "A very close miss or narrow escape (informal).",
  "definition_4": "An instance of removing facial or body hair.",
  "example_1": "He needs a clean shave before the wedding ceremony.",
  "example_2": "That car passed me so closely, it was a close shave!"
 },
 {
  "word": "shore",
  "part_of_speech": "n",
  "translation": "חוף (ים\/אגם)",
  "definition_1": "The land along the edge of a sea, lake, or large area of water.",
  "definition_2": "The boundary where a body of water meets the land.",
  "definition_3": "The edge or border of a coastal region.",
  "definition_4": "The land lying immediately adjacent to a body of water.",
  "example_1": "We spent the afternoon walking along the sandy shore.",
  "example_2": "The ship was heading back to shore after a week at sea."
 },
 {
  "word": "show sb around \/ round",
  "part_of_speech": "phrasal verb",
  "translation": "להראות למישהו את הסביבה\/המקום",
  "definition_1": "To act as a guide and point out the interesting features of a place to a visitor.",
  "definition_2": "To take a person on a tour of a specific location.",
  "definition_3": "To guide someone through a building or area so they can see everything.",
  "definition_4": "To introduce a place to a newcomer.",
  "example_1": "When you arrive, I'd be happy to show you around the city.",
  "example_2": "The manager offered to show us round the new factory."
 },
 {
  "word": "shut (sb) up",
  "part_of_speech": "phrasal verb",
  "translation": "להשתיק (מישהו); לסתום (פיו)",
  "definition_1": "To stop someone from talking or making noise (often considered rude).",
  "definition_2": "To close a place or object completely.",
  "definition_3": "To force a person to be silent.",
  "definition_4": "To stop someone from saying something.",
  "example_1": "The librarian had to tell the noisy students to shut up.",
  "example_2": "I wish he would shut up about his boring vacation."
 },
 {
  "word": "sidewalk",
  "part_of_speech": "n",
  "translation": "מדרכה (אמריקאי)",
  "definition_1": "A paved area for pedestrians next to a road (American English).",
  "definition_2": "A path made of concrete or asphalt alongside a street.",
  "definition_3": "A walkway for people, separate from the vehicular traffic.",
  "definition_4": "The surface on which people walk at the side of a street.",
  "example_1": "Always walk on the sidewalk and not in the street.",
  "example_2": "The vendor set up his hot dog stand right on the busy sidewalk."
 },
 {
  "word": "sigh",
  "part_of_speech": "v",
  "translation": "להיאנח",
  "definition_1": "To exhale deeply and audibly, often to express relief, tiredness, or sadness.",
  "definition_2": "To make a long, deep sound expressing emotion or weariness.",
  "definition_3": "To utter a sound that indicates sorrow or exhaustion.",
  "definition_4": "To long for something greatly.",
  "example_1": "He sighed heavily when he realized he still had hours of work left.",
  "example_2": "She sighed with relief when she finally found her missing keys."
 },
 {
  "word": "sigh",
  "part_of_speech": "n",
  "translation": "אנחה",
  "definition_1": "A long, fixed, and intent look.",
  "definition_2": "The sound produced when one exhales deeply.",
  "definition_3": "An expression of weariness, sadness, or content.",
  "definition_4": "A deep breath that often communicates a feeling without words.",
  "example_1": "I heard a loud sigh from the person waiting impatiently in the queue.",
  "example_2": "The deep sigh indicated her complete frustration with the situation."
 },
 {
  "word": "silk",
  "part_of_speech": "n",
  "translation": "משי",
  "definition_1": "A fine, smooth, natural fiber produced by silkworms.",
  "definition_2": "A soft, light, and lustrous fabric made from this fiber.",
  "definition_3": "A luxurious, delicate material used for clothing.",
  "definition_4": "The fine, soft thread on a corn cob.",
  "example_1": "She wore a beautiful evening dress made of pure silk.",
  "example_2": "The scarf felt smooth as silk against her skin."
 },
 {
  "word": "sit up\/stand up straight",
  "part_of_speech": "phrase",
  "translation": "לשבת\/לעמוד ישר",
  "definition_1": "To assume a vertical, upright posture without slouching.",
  "definition_2": "To maintain a rigid and correct posture.",
  "definition_3": "To keep your back and spine aligned and not hunched over.",
  "definition_4": "To move your body into an erect position.",
  "example_1": "The teacher reminded the children to sit up straight at their desks.",
  "example_2": "When the general walked in, all the soldiers immediately stood up straight."
 },
 {
  "word": "slave",
  "part_of_speech": "n",
  "translation": "עֶבֶד",
  "definition_1": "A person who is the property of another and forced to work without pay.",
  "definition_2": "Someone completely controlled by a person, habit, or desire.",
  "definition_3": "A person in a system of forced labor.",
  "definition_4": "A person who is subject to another's will.",
  "example_1": "Historically, the economy of the region relied on the labor of slaves.",
  "example_2": "He was a slave to his addiction and couldn't stop drinking."
 },
 {
  "word": "sleeve",
  "part_of_speech": "n",
  "translation": "שרוול",
  "definition_1": "The part of a garment that covers all or part of the arm.",
  "definition_2": "The part of a shirt, coat, or jacket that the arm goes through.",
  "definition_3": "A cover or casing into which an object is inserted.",
  "definition_4": "The tubular part of a piece of clothing.",
  "example_1": "She tore the sleeve of her jacket on a sharp branch.",
  "example_2": "Roll up your sleeves and start working on this task."
 },
 {
  "word": "sore",
  "part_of_speech": "adj",
  "translation": "כואב; רגיש",
  "definition_1": "Painful or aching, typically from injury or infection.",
  "definition_2": "Describes a part of the body that is tender and painful to touch.",
  "definition_3": "Feeling very angry or upset about something (informal).",
  "definition_4": "Causing grief or unhappiness.",
  "example_1": "I have a sore throat and a fever, so I'm staying home.",
  "example_2": "After the long hike, my legs were sore and stiff."
 },
 {
  "word": "split up",
  "part_of_speech": "phrasal verb",
  "translation": "להיפרד; להתפצל",
  "definition_1": "To end a relationship (a couple).",
  "definition_2": "To divide into two or more groups.",
  "definition_3": "To break apart or become separated.",
  "definition_4": "To stop living or working together.",
  "example_1": "After two years of dating, they decided to split up.",
  "example_2": "We need to split up into two teams to cover more ground."
 },
 {
  "word": "sportsman",
  "part_of_speech": "n",
  "translation": "ספורטאי",
  "definition_1": "A man who plays sports, especially as a professional.",
  "definition_2": "A man who engages in sports or physical activities.",
  "definition_3": "A person who exhibits fair play and good conduct.",
  "definition_4": "A person fond of outdoor sports, such as hunting or fishing.",
  "example_1": "He is a talented young sportsman with a bright future in basketball.",
  "example_2": "The veteran sportsman announced his retirement after a successful career."
 },
 {
  "word": "spot (notice)",
  "part_of_speech": "v",
  "translation": "להבחין; לזהות",
  "definition_1": "To see or notice someone or something that is difficult to find.",
  "definition_2": "To detect or recognize visually.",
  "definition_3": "To find or pick out something hidden or distant.",
  "definition_4": "To mark with a small dot.",
  "example_1": "I tried to spot my friend in the huge crowd at the concert.",
  "example_2": "Can you spot the difference between these two pictures?"
 },
 {
  "word": "spy",
  "part_of_speech": "n",
  "translation": "מרגל",
  "definition_1": "A person secretly employed by a government to gather information about enemies.",
  "definition_2": "Someone who keeps watch on others.",
  "definition_3": "A person engaged in espionage.",
  "definition_4": "A secret agent.",
  "example_1": "The foreign spy was captured trying to access the restricted files.",
  "example_2": "I played a children's game called 'I spy with my little eye'."
 },
 {
  "word": "spy",
  "part_of_speech": "v",
  "translation": "לרגל",
  "definition_1": "To work as a secret agent to gather information about a country or organization.",
  "definition_2": "To notice or see, especially suddenly.",
  "definition_3": "To watch closely and secretly.",
  "definition_4": "To secretly monitor the actions of others.",
  "example_1": "The agency sent an operative to spy on their competitor's developments.",
  "example_2": "We could see the children spying on us from behind the curtain."
 },
 {
  "word": "squeeze",
  "part_of_speech": "v",
  "translation": "לסחוט; ללחוץ",
  "definition_1": "To firmly press something, especially with your fingers, to force liquid out or change its shape.",
  "definition_2": "To manage to fit into a small or crowded space.",
  "definition_3": "To apply pressure to extract something.",
  "definition_4": "To hug someone tightly.",
  "example_1": "Can you squeeze a little more juice out of those oranges?",
  "example_2": "There's room for one more; I can squeeze into the back seat."
 },
 {
  "word": "squeeze",
  "part_of_speech": "n",
  "translation": "לחיצה; סחיטה",
  "definition_1": "An act of pressing something firmly.",
  "definition_2": "A tight, affectionate hug.",
  "definition_3": "A difficult or restricted space (e.g., a tight squeeze).",
  "definition_4": "The process of obtaining liquid or juice by pressing.",
  "example_1": "Give me a quick squeeze before you leave for your trip.",
  "example_2": "Getting through the narrow doorway was a tight squeeze."
 },
 {
  "word": "stare",
  "part_of_speech": "v",
  "translation": "לבהות",
  "definition_1": "To look fixedly and intently at something with eyes wide open.",
  "definition_2": "To look at someone or something for a long time without interruption.",
  "definition_3": "To gaze fixedly in one direction.",
  "definition_4": "To look with an expression of surprise, curiosity, or rudeness.",
  "example_1": "It's impolite to stare at people you don't know.",
  "example_2": "He couldn't help but stare at the bizarre painting on the wall."
 },
 {
  "word": "stare",
  "part_of_speech": "n",
  "translation": "בהייה",
  "definition_1": "A long, fixed, and intent look.",
  "definition_2": "An instance of gazing directly at something.",
  "definition_3": "A fixed, often unwelcome, gaze.",
  "definition_4": "An expression of intense concentration or surprise.",
  "example_1": "She couldn't ignore the uncomfortable stare from the stranger across the room.",
  "example_2": "With a silent stare, the teacher waited for the students to calm down."
 },
 {
  "word": "stay over",
  "part_of_speech": "phrasal verb",
  "translation": "לישון בבית של מישהו (להישאר ללילה)",
  "definition_1": "To remain as a guest in someone's home for the night.",
  "definition_2": "To sleep at a place other than your own home.",
  "definition_3": "To spend the night at a friend's house.",
  "definition_4": "To visit and remain overnight.",
  "example_1": "My cousin is coming to stay over this weekend.",
  "example_2": "Since it was so late, we decided to stay over at their house."
 },
 {
  "word": "stay up",
  "part_of_speech": "phrasal verb",
  "translation": "להישאר ער; ללכת לישון מאוחר",
  "definition_1": "To remain awake past the usual time of going to bed.",
  "definition_2": "To keep yourself from sleeping.",
  "definition_3": "To remain in a good condition or form.",
  "definition_4": "To wait for someone or something to arrive late at night.",
  "example_1": "We decided to stay up late to watch the meteor shower.",
  "example_2": "I had to stay up all night to finish writing my essay."
 },
 {
  "word": "steep",
  "part_of_speech": "adj",
  "translation": "תלול; חד",
  "definition_1": "Rising or falling sharply; having an incline that is difficult to climb.",
  "definition_2": "Describes a price or demand that is excessively high.",
  "definition_3": "Having a sharp slope or gradient.",
  "definition_4": "Almost perpendicular in slope.",
  "example_1": "Be careful driving; the mountain road is very steep and winding.",
  "example_2": "I complained about the steep price of the concert tickets."
 },
 {
  "word": "step back \/ forward \/ over, etc.",
  "part_of_speech": "phrasal verb",
  "translation": "לצעוד (אחורה\/קדימה\/מעל וכו')",
  "definition_1": "To move one's foot and place it in a specified direction.",
  "definition_2": "To briefly move in a particular direction.",
  "definition_3": "To temporarily distance oneself from a situation to gain perspective.",
  "definition_4": "To take a short, directed movement with the feet.",
  "example_1": "Please step back from the edge of the platform.",
  "example_2": "The speaker asked the volunteers to step forward."
 },
 {
  "word": "step on\/in sth",
  "part_of_speech": "phrasal verb",
  "translation": "לדרוך על\/בתוך משהו",
  "definition_1": "To place your foot on or into an object or substance.",
  "definition_2": "To tread upon something accidentally.",
  "definition_3": "To press a foot down, often on a pedal or small object.",
  "definition_4": "To crush or press down with the foot.",
  "example_1": "Watch out, don't step on the broken glass on the floor.",
  "example_2": "I accidentally stepped in a puddle and soaked my shoes."
 },
 {
  "word": "stick (short branch, rod)",
  "part_of_speech": "n",
  "translation": "מקל; זרד",
  "definition_1": "A thin, long piece of wood that has fallen or been cut from a tree.",
  "definition_2": "A long, thin object used for a specific purpose (e.g., walking, sport).",
  "definition_3": "A thin, cylindrical piece of material (e.g., a stick of butter).",
  "definition_4": "A rod or piece of wood that is typically slender.",
  "example_1": "The dog loves to chase the stick when I throw it in the park.",
  "example_2": "The boy used a thin stick to draw figures in the sand."
 },
 {
  "word": "strangely enough",
  "part_of_speech": "phrase",
  "translation": "באופן מוזר; זה מוזר מספיק",
  "definition_1": "Used to introduce a fact or event that is surprising or unexpected.",
  "definition_2": "A phrase indicating that the following statement is true but unusual.",
  "definition_3": "Surprisingly, or contrary to what one would expect.",
  "definition_4": "An expression used when mentioning an odd coincidence.",
  "example_1": "Strangely enough, the flight was completely empty today.",
  "example_2": "Strangely enough, we were wearing the exact same outfit."
 },
 {
  "word": "stream (small river)",
  "part_of_speech": "n",
  "translation": "נחל; זרם",
  "definition_1": "A small, narrow river.",
  "definition_2": "A steady, continuous flow of liquid or gas.",
  "definition_3": "A constant movement of people or vehicles.",
  "definition_4": "A continuous flow of data over a network (e.g., video streaming).",
  "example_1": "We followed the small mountain stream until we reached the waterfall.",
  "example_2": "There was a constant stream of visitors entering the art museum."
 },
 {
  "word": "stretch",
  "part_of_speech": "v",
  "translation": "למתוח; להתמתח",
  "definition_1": "To extend one's limbs or body to their full length.",
  "definition_2": "To pull something to make it longer or wider.",
  "definition_3": "To extend over a distance or a period of time.",
  "definition_4": "To increase in size or capacity.",
  "example_1": "I like to stretch my legs after sitting for a long time.",
  "example_2": "The material is very elastic and can stretch quite a bit."
 },
 {
  "word": "stretch",
  "part_of_speech": "n",
  "translation": "מתיחה; קטע (דרך)",
  "definition_1": "An act of extending one's body or limbs.",
  "definition_2": "A continuous area or expanse of land or water.",
  "definition_3": "The capacity to be drawn out or extended.",
  "definition_4": "A movement performed to loosen muscles.",
  "example_1": "Take a deep breath and perform a full-body stretch.",
  "example_2": "The final stretch of the race was the hardest part of the marathon."
 },
 {
  "word": "strict",
  "part_of_speech": "adj",
  "translation": "קפדני; מחמיר",
  "definition_1": "Demanding that rules are obeyed precisely; rigorous.",
  "definition_2": "Limiting someone's freedom or action.",
  "definition_3": "Defined or enforced rigorously.",
  "definition_4": "Complete and absolute (e.g., in strict confidence).",
  "example_1": "The library has a very strict policy about returning books late.",
  "example_2": "His parents were very strict about his bedtime during the week."
 },
 {
  "word": "string (thin rope; musical instrument)",
  "part_of_speech": "n",
  "translation": "חוט; מיתר",
  "definition_1": "Strong, thin cord or thick thread used for tying or binding.",
  "definition_2": "A set of threads on a musical instrument (e.g., guitar, violin) that produce sound.",
  "definition_3": "A sequence of connected items or events.",
  "definition_4": "A long, continuous piece of thread.",
  "example_1": "Please tie the box closed with a piece of string.",
  "example_2": "One of the violin's strings snapped during the performance."
 },
 {
  "word": "stripe",
  "part_of_speech": "n",
  "translation": "פס",
  "definition_1": "A long, narrow band or line different in color or texture from the area next to it.",
  "definition_2": "A mark on an animal's body that is a contrasting color.",
  "definition_3": "A line of color forming a pattern.",
  "definition_4": "A mark of rank on a military uniform.",
  "example_1": "The shirt had bold blue and white stripes.",
  "example_2": "Zebras are easily recognized by their distinct black and white stripes."
 },
 {
  "word": "suit (look attractive)",
  "part_of_speech": "v",
  "translation": "להתאים; להחמיא",
  "definition_1": "To look attractive on a person.",
  "definition_2": "To be appropriate for a particular person, occasion, or purpose.",
  "definition_3": "To meet the needs or requirements of someone.",
  "definition_4": "To be convenient for a specific time or schedule.",
  "example_1": "That shade of green really suits your skin tone.",
  "example_2": "Does three o'clock tomorrow afternoon suit you for our meeting?"
 },
 {
  "word": "swear (curse)",
  "part_of_speech": "v",
  "translation": "לקלל",
  "definition_1": "To use offensive language or curse words.",
  "definition_2": "To promise solemnly or declare a statement is true.",
  "definition_3": "To take an oath.",
  "definition_4": "To make a commitment to do something.",
  "example_1": "Please don't swear in front of the young children.",
  "example_2": "I swear that I will never lie to you again."
 },
 {
  "word": "sweep",
  "part_of_speech": "v",
  "translation": "לטאטא; לגרור",
  "definition_1": "To clean a floor or surface using a broom.",
  "definition_2": "To move quickly and forcefully in a particular direction.",
  "definition_3": "To pass quickly over or through an area.",
  "definition_4": "To win every game or round in a competition (informal).",
  "example_1": "Could you sweep the kitchen floor before the guests arrive?",
  "example_2": "The strong winds began to sweep the sand across the beach."
 },
 {
  "word": "sword",
  "part_of_speech": "n",
  "translation": "חֶרֶב",
  "definition_1": "A weapon with a long metal blade and a handle, used for cutting or thrusting.",
  "definition_2": "A long-bladed weapon typically used in historical battles.",
  "definition_3": "A symbol of military power or honor.",
  "definition_4": "A sharp, pointed implement for fighting.",
  "example_1": "The knight pulled his shining sword from its scabbard.",
  "example_2": "The museum displayed a collection of antique Japanese swords."
 },
 {
  "word": "tail",
  "part_of_speech": "n",
  "translation": "זנב",
  "definition_1": "The rear-most part of an animal's body, often a flexible appendage.",
  "definition_2": "The end or last part of something.",
  "definition_3": "The rear section of an aircraft.",
  "definition_4": "The reverse side of a coin (the opposite of 'heads').",
  "example_1": "The happy dog wagged its tail excitedly when its owner came home.",
  "example_2": "She decided to tie her long hair back into a high ponytail or a 'horse tail'."
 },
 {
  "word": "take a risk",
  "part_of_speech": "phrase",
  "translation": "לקחת סיכון",
  "definition_1": "To do something that involves a possibility of danger or loss.",
  "definition_2": "To proceed with an action despite knowing the potential negative consequences.",
  "definition_3": "To accept the chance of failure for a potential benefit.",
  "definition_4": "To dare to do something challenging or uncertain.",
  "example_1": "Investing in the new startup is a big decision; you have to take a risk.",
  "example_2": "She decided to take a risk and quit her job to start her own company."
 },
 {
  "word": "take sb out or take out sb",
  "part_of_speech": "phrasal verb",
  "translation": "להוציא (מישהו) לבילוי; להרוג",
  "definition_1": "To invite someone to go with you to a movie, restaurant, or other social event.",
  "definition_2": "To remove or escort someone from a place.",
  "definition_3": "To kill or destroy someone or something (slang\/military).",
  "definition_4": "To begin a romantic relationship by going on a date.",
  "example_1": "He decided to take his girlfriend out for dinner on her birthday.",
  "example_2": "The doctor had to take out the patient's wisdom tooth."
 },
 {
  "word": "tap",
  "part_of_speech": "n",
  "translation": "ברז (מים)",
  "definition_1": "A device used to control the flow of water from a pipe (British English).",
  "definition_2": "A light, gentle knock or touch.",
  "definition_3": "A device for drawing liquid from a container.",
  "definition_4": "The rhythmic sound made by lightly hitting a surface.",
  "example_1": "Don't leave the water tap running while you brush your teeth.",
  "example_2": "I heard a quiet tap on the window, so I looked outside."
 },
 {
  "word": "temple",
  "part_of_speech": "n",
  "translation": "מִקדָש; רָקָה (צד הראש)",
  "definition_1": "A building devoted to the worship of a god or gods.",
  "definition_2": "A large, impressive religious structure.",
  "definition_3": "The flat part on either side of the forehead, near the eye.",
  "definition_4": "A sacred place for religious ceremonies.",
  "example_1": "We visited the ancient Buddhist temple high up in the mountains.",
  "example_2": "He rubbed his temples as a sign of his growing headache."
 },
 {
  "word": "territory",
  "part_of_speech": "n",
  "translation": "טריטוריה; שטח",
  "definition_1": "An area of land under the control of a ruler or state.",
  "definition_2": "An area defended by an animal or group against others.",
  "definition_3": "A specific geographical region.",
  "definition_4": "An area or domain of knowledge or activity.",
  "example_1": "The government declared the newly discovered island as its territory.",
  "example_2": "The salesman was assigned a large territory that covered three states."
 },
 {
  "word": "terror",
  "part_of_speech": "n",
  "translation": "טרור; אימה; פחד",
  "definition_1": "Extreme fear or dread.",
  "definition_2": "The use of violence and threats to frighten people for political aims.",
  "definition_3": "An intense state of overwhelming fear.",
  "definition_4": "Something that causes extreme fear.",
  "example_1": "The unexpected explosion filled the crowd with sheer terror.",
  "example_2": "The police are working to prevent acts of terror in the capital."
 },
 {
  "word": "tie sb\/sth up or tie up sb\/sth",
  "part_of_speech": "phrasal verb",
  "translation": "לקשור (מישהו\/משהו)",
  "definition_1": "To secure someone or something with rope or string so they cannot move.",
  "definition_2": "To complete the final details of a deal or arrangement.",
  "definition_3": "To keep someone busy so they cannot do other things.",
  "definition_4": "To bind an object or a person.",
  "example_1": "The robbers used a rope to tie up the security guard.",
  "example_2": "I'm sorry I can't talk now; I'm completely tied up with another project."
 },
 {
  "word": "tournament",
  "part_of_speech": "n",
  "translation": "טורניר; תחרות",
  "definition_1": "A series of games or contests in which competitors play until a final winner is determined.",
  "definition_2": "A competition involving many rounds.",
  "definition_3": "A formal event where people test their skill against each other.",
  "definition_4": "A contest for a championship.",
  "example_1": "The school team won the regional basketball tournament this year.",
  "example_2": "The chess tournament lasted for three long days."
 },
 {
  "word": "track (athletics)",
  "part_of_speech": "n",
  "translation": "מסלול (אתלטיקה)",
  "definition_1": "A path or circuit for races, especially running.",
  "definition_2": "The rails on which a train runs.",
  "definition_3": "A mark or series of marks left by a person, animal, or vehicle.",
  "definition_4": "A single song or piece of music on an album.",
  "example_1": "The runner set a new record on the 400-meter track.",
  "example_2": "We used the footprints in the mud to follow the animal's track."
 },
 {
  "word": "tragedy",
  "part_of_speech": "n",
  "translation": "טרגדיה; אסון",
  "definition_1": "An event causing great suffering, destruction, and distress.",
  "definition_2": "A play dealing with tragic events and having an unhappy ending.",
  "definition_3": "A great misfortune or disaster.",
  "definition_4": "A serious drama in which the main character suffers or dies.",
  "example_1": "The sudden loss of life in the fire was a terrible tragedy.",
  "example_2": "Shakespeare's most famous works are often classic tragedies."
 },
 {
  "word": "triangle",
  "part_of_speech": "n",
  "translation": "משולש",
  "definition_1": "A geometric shape with three sides and three angles.",
  "definition_2": "A musical instrument that is a steel rod bent into this shape.",
  "definition_3": "A situation involving three people in a relationship (often romantic).",
  "definition_4": "A polygon with the minimum number of sides.",
  "example_1": "The architect designed the roof in the shape of a perfect triangle.",
  "example_2": "The percussionist waited for his cue to play the triangle."
 },
 {
  "word": "tube",
  "part_of_speech": "n",
  "translation": "צינור; רכבת תחתית (בריטי)",
  "definition_1": "A long, hollow cylinder of metal, plastic, or glass for conveying something.",
  "definition_2": "The London Underground railway system (British English).",
  "definition_3": "A small, flexible container for products like toothpaste.",
  "definition_4": "A passageway in the body, such as the bronchial tubes.",
  "example_1": "I ride the tube to work every day when I'm in London.",
  "example_2": "The plumber had to replace a broken copper tube under the sink."
 },
 {
  "word": "undressed",
  "part_of_speech": "adj",
  "translation": "לא לבוש; מתפשט",
  "definition_1": "Not wearing any clothes or having very few clothes on.",
  "definition_2": "The state of having removed one's clothing.",
  "definition_3": "Bare or exposed.",
  "definition_4": "Describes something that has not been decorated or prepared (e.g., undressed salad).",
  "example_1": "The baby was undressed and ready for his bath.",
  "example_2": "He was embarrassed to be caught undressed when the alarm went off."
 },
 {
  "word": "unpack",
  "part_of_speech": "v",
  "translation": "לפרוק (מטען); לפתוח (מזוודה)",
  "definition_1": "To remove the contents of a suitcase, box, or package.",
  "definition_2": "To take things out of their storage or transportation container.",
  "definition_3": "To remove items that have been packed for a trip or move.",
  "definition_4": "To analyze or discuss the components of an idea.",
  "example_1": "As soon as we arrived, I started to unpack my clothes.",
  "example_2": "It took them three days to completely unpack all the boxes from the move."
 },
 {
  "word": "van",
  "part_of_speech": "n",
  "translation": "ואן; רכב מסחרי\/מיניבוס",
  "definition_1": "A medium-sized motor vehicle, usually box-shaped, used for transporting goods or people.",
  "definition_2": "A covered vehicle used for moving furniture or delivering packages.",
  "definition_3": "A large road vehicle used for group transport.",
  "definition_4": "A smaller version of a truck.",
  "example_1": "The delivery driver arrived in a white cargo van.",
  "example_2": "We rented a large passenger van for the family road trip."
 },
 {
  "word": "verse (poetry; part of poem, song)",
  "part_of_speech": "n",
  "translation": "פסוק; בית (בשיר\/שירה)",
  "definition_1": "A group of lines forming a unit in a poem or song (a stanza).",
  "definition_2": "Writing arranged in metrical rhythm (poetry).",
  "definition_3": "A numbered section of a chapter in the Bible.",
  "definition_4": "A rhythmic piece of poetry.",
  "example_1": "Can you sing the second verse of that song again?",
  "example_2": "The preacher read a verse from the New Testament."
 },
 {
  "word": "weapon",
  "part_of_speech": "n",
  "translation": "נשק",
  "definition_1": "An object used for fighting or hunting.",
  "definition_2": "A tool used to cause damage or to defend oneself.",
  "definition_3": "Anything used to gain an advantage or attack an opponent (figurative).",
  "definition_4": "An instrument of attack or defense.",
  "example_1": "The suspect was arrested for carrying a concealed weapon.",
  "example_2": "His sharp wit and intelligence are his most powerful weapons."
 },
 {
  "word": "web (spider)",
  "part_of_speech": "n",
  "translation": "קורים (עכביש)",
  "definition_1": "A fine network of threads constructed by a spider.",
  "definition_2": "A complex system of interconnected things or people.",
  "definition_3": "Short for the World Wide Web (the internet).",
  "definition_4": "A net-like structure.",
  "example_1": "I had to duck to avoid walking right into a large spider web.",
  "example_2": "The detective discovered a complicated web of lies."
 },
 {
  "word": "wheat",
  "part_of_speech": "n",
  "translation": "חיטה",
  "definition_1": "A cereal grain that is the most important food crop in the world.",
  "definition_2": "The plant from which flour is made, used to bake bread.",
  "definition_3": "A grain used in making bread, pasta, and cereals.",
  "definition_4": "The essential crop grown in large fields.",
  "example_1": "The golden fields of wheat were ready for harvest.",
  "example_2": "Many people around the world eat products made from wheat flour every day."
 }
