[
  {
    "word": "a little something",
    "collision_group_id": "a little sth",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A small, often thoughtful, gift or gesture.",
      "An unspecified small amount of something.",
      "A treat or special item, usually food or drink.",
      "Something of minor importance or value."
    ],
    "examples": [
      "I got you a little something for your birthday.",
      "Here's a little something to thank you for your help."
    ]
  },
  {
    "word": "aggressive",
    "collision_group_id": "aggressive",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Ready or likely to attack or confront.",
      "Behaving in a forceful or determined way.",
      "Characterized by hostility or forcefulness.",
      "Pursuing one's aims and interests forcefully."
    ],
    "examples": [
      "The aggressive dog barked at everyone who walked by.",
      "She has an aggressive style of negotiation that often gets results."
    ]
  },
  {
    "word": "air force",
    "collision_group_id": "air force",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The branch of a nation's armed services that conducts military operations in the air.",
      "A military organization primarily for airborne warfare.",
      "The aviation branch of a country's military forces.",
      "A national military organization for fighting in the air."
    ],
    "examples": [
      "He decided to join the air force after finishing high school.",
      "The air force conducted a series of drills over the weekend."
    ]
  },
  {
    "word": "alarm",
    "collision_group_id": "alarm",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An anxious awareness of danger.",
      "A warning sound or device.",
      "Sudden fear or distress caused by an awareness of danger.",
      "A mechanism that gives a warning of a dangerous or unusual situation."
    ],
    "examples": [
      "The sudden noise caused alarm throughout the building.",
      "Did you remember to set the alarm for 6 a.m.?"
    ]
  },
  {
    "word": "all is well",
    "collision_group_id": "all is well",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Everything is in a satisfactory state.",
      "An expression of reassurance that there are no problems.",
      "A phrase indicating that a situation is calm and under control.",
      "Used to state that everything is fine or secure."
    ],
    "examples": [
      "Despite the storm, we checked the house and all is well.",
      "The doctor called to say the test results are back and all is well."
    ]
  },
  {
    "word": "all over the place",
    "collision_group_id": "all over the place",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "In a state of disorder or disarray; scattered.",
      "Everywhere; in many different locations.",
      "Lacking a clear plan or focus; disorganized.",
      "Exhibiting erratic or inconsistent behavior."
    ],
    "examples": [
      "His books and papers were all over the place.",
      "Her thoughts seemed to be all over the place during the meeting."
    ]
  },
  {
    "word": "ambassador",
    "collision_group_id": "ambassador",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An accredited diplomat sent by a country as its official representative to a foreign country.",
      "A person who acts as a representative or promoter of a specified activity.",
      "The highest-ranking diplomat who represents a state.",
      "An official envoy, especially one of high rank."
    ],
    "examples": [
      "The French ambassador to the United States attended the event.",
      "She is a brand ambassador for the new line of cosmetics."
    ]
  },
  {
    "word": "arrow",
    "collision_group_id": "arrow",
    "pos": "n",
    "family": "sign",
    "translation_meaning": "",
    "definitions": [
      "A symbol used to point or indicate direction.",
      "A slender stick with a sharp point, shot from a bow.",
      "A mark or sign resembling an arrow, used to show direction.",
      "A graphical symbol on a computer screen indicating position or options."
    ],
    "examples": [
      "Follow the red arrow on the sign to find the exit.",
      "The archer released the arrow and it hit the target."
    ]
  },
  {
    "word": "artistic",
    "collision_group_id": "artistic",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Having or revealing natural creative skill.",
      "Relating to art or artists.",
      "Aesthetically pleasing or done with skill and taste.",
      "Characterized by a natural ability in art."
    ],
    "examples": [
      "She has a very artistic temperament and loves to paint.",
      "The artistic design of the building was praised by critics."
    ]
  },
  {
    "word": "at fault",
    "collision_group_id": "at fault",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Responsible for a mistake or wrongdoing.",
      "Being the cause of an undesirable situation.",
      "In the wrong; blameworthy.",
      "Having made an error."
    ],
    "examples": [
      "The investigation determined that the other driver was at fault for the accident.",
      "He was clearly at fault and had to apologize."
    ]
  },
  {
    "word": "bank",
    "collision_group_id": "bank_river",
    "pos": "n",
    "family": "river",
    "translation_meaning": "",
    "definitions": [
      "The land alongside or sloping down to a river or lake.",
      "A stretch of rising land at the edge of a body of water.",
      "The side of a river, stream, or canal.",
      "An area of sloping ground bordering a river."
    ],
    "examples": [
      "We had a picnic on the grassy bank of the river.",
      "The river overflowed its banks during the flood."
    ]
  },
  {
    "word": "bank account",
    "collision_group_id": "bank account",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An arrangement made with a bank whereby one may deposit and withdraw money.",
      "A financial account maintained by a bank for a customer.",
      "A record of the financial transactions between a customer and a bank.",
      "An account with a bank that allows for monetary deposits and withdrawals."
    ],
    "examples": [
      "She opened a new bank account to save for a car.",
      "He transferred the money from his savings to his checking bank account."
    ]
  },
  {
    "word": "bargain",
    "collision_group_id": "bargain",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A thing bought or offered for sale more cheaply than is usual or expected.",
      "An agreement between two or more people or groups as to what each will do for the other.",
      "Something acquired at a price advantageous to the buyer.",
      "A discussion of the terms of an agreement."
    ],
    "examples": [
      "This coat was a real bargain at half price.",
      "After some negotiation, they struck a bargain."
    ]
  },
  {
    "word": "base",
    "collision_group_id": "base_military",
    "pos": "n",
    "family": "military",
    "translation_meaning": "",
    "definitions": [
      "A headquarters or station for armed forces.",
      "A place from which a military force operates.",
      "A fortified place used as a center of operations.",
      "An installation owned and operated by the military."
    ],
    "examples": [
      "The soldiers returned to the military base after their mission.",
      "The naval base is located on the coast."
    ]
  },
  {
    "word": "bay",
    "collision_group_id": "bay",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A broad inlet of the sea where the land curves inward.",
      "A large body of water connected to an ocean or sea.",
      "A recessed area or space in a room or building.",
      "A compartment in an aircraft for carrying bombs or cargo."
    ],
    "examples": [
      "We sailed our boat across the bay.",
      "The house has a beautiful bay window overlooking the garden."
    ]
  },
  {
    "word": "be expecting (a baby)",
    "collision_group_id": "expecting_baby",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To be pregnant.",
      "To be anticipating the birth of one's child.",
      "To be in the state of pregnancy.",
      "A common phrase used to say that someone is going to have a baby."
    ],
    "examples": [
      "Sarah and Tom are expecting their first child in May.",
      "She announced to her family that she was expecting."
    ]
  },
  {
    "word": "believe it or not",
    "collision_group_id": "believe it or not",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Used to introduce a surprising but true statement.",
      "A phrase indicating that what follows is unlikely but factual.",
      "An expression used to emphasize the truth of an astonishing fact.",
      "Said when telling someone about something that is true but seems improbable."
    ],
    "examples": [
      "Believe it or not, he managed to finish the entire project in one day.",
      "She's 50 years old, believe it or not."
    ]
  },
  {
    "word": "bell",
    "collision_group_id": "bell",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A hollow metal object, typically cup-shaped, that makes a ringing sound when struck.",
      "An electrical device that makes a ringing sound.",
      "The sound made by a bell.",
      "Anything shaped like a bell."
    ],
    "examples": [
      "The church bell chimed at noon.",
      "Please ring the front door bell when you arrive."
    ]
  },
  {
    "word": "bench",
    "collision_group_id": "bench",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A long seat for several people, typically made of wood or metal.",
      "A long, sturdy work table used by a carpenter or mechanic.",
      "The seat on which a judge sits in a court of law.",
      "The players on a sports team who are not currently playing in a game."
    ],
    "examples": [
      "They sat on a park bench and watched the ducks.",
      "The mechanic placed the tools on his work bench."
    ]
  },
  {
    "word": "blow up (something/somebody)",
    "collision_group_id": "blow up",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To explode or cause to explode.",
      "To inflate something with air, such as a tire or balloon.",
      "To greatly enlarge a photograph.",
      "To suddenly become very angry."
    ],
    "examples": [
      "The terrorists threatened to blow up the plane.",
      "Could you help me blow up these balloons for the party?"
    ]
  },
  {
    "word": "boiled",
    "collision_group_id": "boil_family",
    "pos": "adj",
    "family": "boiling,adj",
    "translation_meaning": "",
    "definitions": [
      "Cooked in boiling water.",
      "Having been heated to the point of boiling.",
      "Subjected to the action of boiling liquid.",
      "Food that has been prepared by boiling."
    ],
    "examples": [
      "I would like a hard-boiled egg for breakfast.",
      "The recipe calls for boiled potatoes."
    ]
  },
  {
    "word": "brake",
    "collision_group_id": "brake",
    "pos": "v, n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A device for slowing or stopping a moving vehicle, typically by applying pressure to the wheels.",
      "To make a moving vehicle slow down or stop by using a brake.",
      "Something that has a slowing or stopping effect.",
      "The act of using a brake."
    ],
    "examples": [
      "He slammed on the brakes to avoid hitting the deer.",
      "You need to brake gently on icy roads."
    ]
  },
  {
    "word": "branch",
    "collision_group_id": "branch_business",
    "pos": "n",
    "family": "business",
    "translation_meaning": "",
    "definitions": [
      "A local office or shop of a large company or organization.",
      "A division or subdivision of a larger or more complex whole.",
      "A part of a tree which grows out from the trunk.",
      "A smaller stream or river that flows into a larger one."
    ],
    "examples": [
      "The bank has branches all over the country.",
      "He works in the London branch of the company."
    ]
  },
  {
    "word": "brick",
    "collision_group_id": "brick",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A small rectangular block of fired or sun-dried clay, used in building.",
      "A rectangular-shaped object.",
      "A reliable and helpful person.",
      "The material from which bricks are made."
    ],
    "examples": [
      "The house was built with red bricks.",
      "He bought a brick of cheese at the store."
    ]
  },
  {
    "word": "bucket",
    "collision_group_id": "bucket",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A roughly cylindrical open container with a handle, used to carry things.",
      "The amount that a bucket can hold.",
      "A container for catching or holding liquid.",
      "A scoop on a machine, used for digging or lifting."
    ],
    "examples": [
      "He filled the bucket with water from the well.",
      "The children took a bucket and spade to the beach."
    ]
  },
  {
    "word": "bug",
    "collision_group_id": "bug",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A small insect.",
      "An error in a computer program or system.",
      "A hidden microphone for listening to conversations.",
      "A mild illness or infection."
    ],
    "examples": [
      "There's a bug crawling on the window.",
      "I think I've caught a stomach bug."
    ]
  },
  {
    "word": "bull",
    "collision_group_id": "bull",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An uncastrated adult male bovine animal.",
      "The male of certain other large animals, such as the elephant and whale.",
      "A person who buys shares of stock in expectation of a price rise.",
      "Nonsense; foolish talk."
    ],
    "examples": [
      "The farmer led the bull out of the field.",
      "He was being a bull in a china shop, making a mess of everything."
    ]
  },
  {
    "word": "bunch",
    "collision_group_id": "bunch",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A number of things of the same type, growing or fastened together.",
      "A group of people.",
      "A large amount of something.",
      "A set of keys."
    ],
    "examples": [
      "She picked a bunch of flowers from the garden.",
      "A bunch of us are going to the movies tonight."
    ]
  },
  {
    "word": "burst into tears",
    "collision_group_id": "burst into tears",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To suddenly start crying.",
      "To begin to weep uncontrollably and abruptly.",
      "To have a sudden emotional outbreak of crying.",
      "To break down and cry unexpectedly."
    ],
    "examples": [
      "When she heard the sad news, she burst into tears.",
      "The little boy burst into tears when he fell and scraped his knee."
    ]
  },
  {
    "word": "bury",
    "collision_group_id": "bury",
    "pos": "v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To put or hide under ground.",
      "To place a dead body in a grave.",
      "To cover something or someone completely.",
      "To involve oneself deeply in something."
    ],
    "examples": [
      "The dog buried its bone in the garden.",
      "He was buried in the local cemetery."
    ]
  },
  {
    "word": "butcher",
    "collision_group_id": "butcher",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A person whose trade is cutting up and selling meat in a shop.",
      "A person who slaughters and prepares animals for food.",
      "A person who has killed someone brutally.",
      "To spoil something by doing it very badly."
    ],
    "examples": [
      "I bought some sausages from the local butcher.",
      "The film director completely butchered the original novel."
    ]
  },
  {
    "word": "cab",
    "collision_group_id": "cab",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A taxi.",
      "The driver's compartment in a truck, bus, or train.",
      "A horse-drawn carriage for public hire.",
      "A shelter on a crane or other large machine for the operator."
    ],
    "examples": [
      "We took a cab to the airport.",
      "The truck driver climbed into the cab."
    ]
  },
  {
    "word": "cabin",
    "collision_group_id": "cabin",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A small wooden shelter or house in a wild or remote area.",
      "A private room or compartment on a ship.",
      "The area for passengers in an aircraft.",
      "The driver's compartment in a truck or locomotive."
    ],
    "examples": [
      "They rented a cabin in the mountains for their vacation.",
      "Please remain in your seats inside the cabin until the plane has stopped."
    ]
  },
  {
    "word": "catalog/catalogue",
    "collision_group_id": "catalog",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A complete list of items, typically one in alphabetical or other systematic order.",
      "A publication containing a list of products available for purchase.",
      "To make a systematic list of items of the same type.",
      "A list of all the books or resources in a library."
    ],
    "examples": [
      "I ordered the shirt from a mail-order catalog.",
      "The librarian is working to catalog all the new books."
    ]
  },
  {
    "word": "cave",
    "collision_group_id": "cave",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A large underground chamber, typically of natural origin, in a hillside or cliff.",
      "To give way or collapse.",
      "To yield or submit under pressure.",
      "A natural hollow in the earth."
    ],
    "examples": [
      "The explorers discovered a hidden cave in the mountainside.",
      "The roof of the old mine finally caved in."
    ]
  },
  {
    "word": "certificate",
    "collision_group_id": "certificate",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An official document attesting a certain fact.",
      "A document confirming the successful completion of a course of study.",
      "A document recording a fact such as birth, marriage, or death.",
      "An official document giving details to show that something is true."
    ],
    "examples": [
      "She received a certificate for completing the training program.",
      "You will need to show your birth certificate to get a passport."
    ]
  },
  {
    "word": "charge",
    "collision_group_id": "charge_energy",
    "pos": "v",
    "family": "energy supply",
    "translation_meaning": "",
    "definitions": [
      "To restore electrical energy to a battery or device.",
      "To demand an amount as a price for a service rendered or goods supplied.",
      "To formally accuse someone of something, especially an offense under law.",
      "To rush forward in attack."
    ],
    "examples": [
      "I need to charge my phone before we leave.",
      "How much do you charge for a haircut?"
    ]
  },
  {
    "word": "check in",
    "collision_group_id": "check_in_out",
    "pos": "v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To register one's arrival at a hotel, airport, or event.",
      "To report one's presence or arrival.",
      "To drop off luggage for a flight.",
      "To contact someone to make sure they are okay."
    ],
    "examples": [
      "We need to check in at the hotel before 3 PM.",
      "You must check in your baggage at least an hour before your flight."
    ]
  },
  {
    "word": "check out",
    "collision_group_id": "check_in_out",
    "pos": "v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To settle one's hotel bill before leaving.",
      "To leave a hotel after paying the bill.",
      "To investigate or look at something interesting.",
      "To borrow an item, such as a book, from a library."
    ],
    "examples": [
      "Guests must check out of the hotel by 11 a.m.",
      "Let's check out that new restaurant tonight."
    ]
  },
  {
    "word": "Cheers!",
    "collision_group_id": "cheers",
    "pos": "exclam",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A friendly expression said just before you drink an alcoholic beverage.",
      "An expression of good wishes, used as a toast.",
      "Used to say thank you.",
      "Used to say goodbye."
    ],
    "examples": [
      "They all raised their glasses and said, 'Cheers!'",
      "'Here's that book you wanted.' 'Oh, cheers!'"
    ]
  },
  {
    "word": "cold",
    "collision_group_id": "cold_adj",
    "pos": "adj",
    "family": "unfriendly",
    "translation_meaning": "",
    "definitions": [
      "Lacking affection or warmth of feeling; unemotional.",
      "Of or at a low or relatively low temperature.",
      "Not friendly or welcoming.",
      "A common viral infection of the nose and throat."
    ],
    "examples": [
      "She gave him a cold stare.",
      "It's cold outside, so wear a coat."
    ]
  },
  {
    "word": "collar",
    "collision_group_id": "collar",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The part of a shirt, dress, coat, or blouse that fastens around or frames the neck.",
      "A band of leather or other material put around the neck of a domestic animal.",
      "To seize, grasp, or apprehend someone.",
      "A connecting band on a pipe or shaft."
    ],
    "examples": [
      "He wore a shirt with a white collar.",
      "The dog's collar had a tag with its name on it."
    ]
  },
  {
    "word": "crash",
    "collision_group_id": "crash_family",
    "pos": "v, n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To have an accident in a vehicle.",
      "To make a sudden loud noise.",
      "To fail suddenly, used for computers or systems.",
      "To stay somewhere temporarily, especially overnight."
    ],
    "examples": [
      "The car crashed into a tree.",
      "My computer crashed and I lost all my work."
    ]
  },
  {
    "word": "cross",
    "collision_group_id": "cross_symbol",
    "pos": "n",
    "family": "symbol",
    "translation_meaning": "",
    "definitions": [
      "A mark, object, or figure formed by two short intersecting lines or pieces (+ or ×).",
      "The symbol of the Christian religion.",
      "A mixture of two different things.",
      "To go across or to the other side of something."
    ],
    "examples": [
      "She wore a small gold cross around her neck.",
      "Put a cross in the box next to your choice."
    ]
  },
  {
    "word": "customs",
    "collision_group_id": "customs",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The official department that administers and collects the duties levied by a government on imported goods.",
      "The place at a port, airport, or frontier where officials check incoming goods, travelers, or luggage.",
      "Taxes imposed on imported goods.",
      "A traditional and widely accepted way of behaving or doing something that is specific to a particular society."
    ],
    "examples": [
      "We had to go through customs when we arrived in the country.",
      "It is a custom to shake hands when you meet someone."
    ]
  },
  {
    "word": "date",
    "collision_group_id": "date_goingout",
    "pos": "n",
    "family": "going out",
    "translation_meaning": "",
    "definitions": [
      "A social or romantic appointment or engagement.",
      "A particular day of the month or year.",
      "A sweet, dark brown, oval fruit with a stone.",
      "The period of time to which an artifact or structure belongs."
    ],
    "examples": [
      "He asked her out on a date.",
      "What's the date today?"
    ]
  },
  {
    "word": "deck",
    "collision_group_id": "deck_ship",
    "pos": "n",
    "family": "floor on ship",
    "translation_meaning": "",
    "definitions": [
      "A floor of a ship or boat.",
      "A pack of playing cards.",
      "A wooden platform built outdoors, attached to a house.",
      "The equipment for playing recorded sound, such as a cassette deck."
    ],
    "examples": [
      "We went up on deck to get some fresh air.",
      "Let's play a game of cards; do you have a deck?"
    ]
  },
  {
    "word": "defeat",
    "collision_group_id": "defeat",
    "pos": "v, n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To win a victory over someone in a battle, game, or other competition.",
      "The state of having been defeated.",
      "To prevent something from succeeding.",
      "An instance of being defeated."
    ],
    "examples": [
      "Our team suffered a heavy defeat in the final match.",
      "They were determined to defeat the enemy."
    ]
  },
  {
    "word": "devil",
    "collision_group_id": "devil",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The supreme spirit of evil in Christianity and Judaism.",
      "A wicked or cruel person.",
      "A mischievous or reckless person.",
      "Used for emphasis in questions or exclamations."
    ],
    "examples": [
      "In many religions, the devil is seen as the embodiment of evil.",
      "Her little brother is a real devil, always getting into trouble."
    ]
  },
  {
    "word": "diagram",
    "collision_group_id": "diagram",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A simplified drawing showing the appearance, structure, or workings of something.",
      "A representation of a plan or scheme.",
      "To represent something by means of a diagram.",
      "A graphical representation of a concept or process."
    ],
    "examples": [
      "The diagram in the manual explains how to assemble the furniture.",
      "He drew a diagram to illustrate his point."
    ]
  },
  {
    "word": "difficult",
    "collision_group_id": "difficult_adj",
    "pos": "adj",
    "family": "not friendly",
    "translation_meaning": "",
    "definitions": [
      "Needing much effort or skill to accomplish, deal with, or understand.",
      "Not easy to please or satisfy.",
      "Problematic or troublesome.",
      "Characterized by hardships or problems."
    ],
    "examples": [
      "He has a reputation for being a difficult person to work with.",
      "This is a very difficult math problem."
    ]
  },
  {
    "word": "dishonest",
    "collision_group_id": "dishonest",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Behaving or prone to behave in an untrustworthy or fraudulent way.",
      "Intended to mislead or deceive.",
      "Not honest; lying, cheating, or stealing.",
      "Lacking in fairness and truthfulness."
    ],
    "examples": [
      "The dishonest salesman lied about the car's condition.",
      "It was dishonest of him to take credit for my work."
    ]
  },
  {
    "word": "disk",
    "collision_group_id": "disk",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A flat, thin, circular object.",
      "A device for storing computer data.",
      "A layer of cartilage separating the vertebrae in the spine.",
      "A round, flat plate used in machinery."
    ],
    "examples": [
      "I saved the file to a floppy disk.",
      "He has a slipped disk in his back."
    ]
  },
  {
    "word": "divorce",
    "collision_group_id": "divorce_family",
    "pos": "n",
    "family": "divorced,adj",
    "translation_meaning": "",
    "definitions": [
      "The legal dissolution of a marriage by a court or other competent body.",
      "A separation between things that were or ought to be connected.",
      "To legally dissolve one's marriage with someone.",
      "The ending of a marriage."
    ],
    "examples": [
      "They decided to get a divorce after five years of marriage.",
      "The high rate of divorce is a major social issue."
    ]
  },
  {
    "word": "Don't ask me!",
    "collision_group_id": "dont_ask",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Used to say that you do not know the answer to a question.",
      "An informal way of stating that you are not the person to ask for information.",
      "A phrase indicating a lack of knowledge or a desire not to answer.",
      "Used to emphatically state one's ignorance about a subject."
    ],
    "examples": [
      "“What time does the store close?” “Don’t ask me, I've never been here before.”",
      "Don't ask me why he did it; I have no idea."
    ]
  },
  {
    "word": "Don't ask!",
    "collision_group_id": "dont_ask",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Used to say that an experience was too bad, strange, or complicated to explain.",
      "A way of saying you do not want to talk about something.",
      "Implies that the story behind a situation is long or unpleasant.",
      "A response indicating that a situation is too difficult or embarrassing to describe."
    ],
    "examples": [
      "“How was your day at work?” “Don't ask!”",
      "She married and divorced a man in the same day? Don't ask."
    ]
  },
  {
    "word": "dreadful",
    "collision_group_id": "dreadful",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Causing or involving great suffering, fear, or unhappiness; extremely bad or serious.",
      "Of very low quality; very bad.",
      "Extremely unpleasant.",
      "Inspiring great dread or fear."
    ],
    "examples": [
      "The weather was dreadful all week.",
      "He made a dreadful mistake."
    ]
  },
  {
    "word": "drink",
    "collision_group_id": "drink_alcohol",
    "pos": "v",
    "family": "alchohol",
    "translation_meaning": "",
    "definitions": [
      "To consume alcohol.",
      "To take a liquid into the mouth and swallow.",
      "A liquid for drinking.",
      "To have a habit of drinking alcohol to excess."
    ],
    "examples": [
      "He doesn't drink alcohol.",
      "Can I have a drink of water?"
    ]
  },
  {
    "word": "drive",
    "collision_group_id": "drive_computer",
    "pos": "n",
    "family": "computer",
    "translation_meaning": "",
    "definitions": [
      "An internal or external device for storing and retrieving data on a computer.",
      "To operate and control the direction and speed of a motor vehicle.",
      "A trip or journey in a car.",
      "An innate, biologically determined urge to attain a goal or satisfy a need."
    ],
    "examples": [
      "Make sure to save your work on the hard drive.",
      "She has a strong drive to succeed."
    ]
  },
  {
    "word": "drop",
    "collision_group_id": "drop_liquid",
    "pos": "n",
    "family": "liquid",
    "translation_meaning": "",
    "definitions": [
      "A small round or pear-shaped portion of liquid that hangs or falls or adheres to a surface.",
      "To let or make something fall vertically.",
      "A fall in amount, quality, or value.",
      "A small, round sweet."
    ],
    "examples": [
      "A drop of rain fell on her nose.",
      "He accidentally dropped his keys."
    ]
  },
  {
    "word": "drunk",
    "collision_group_id": "drunk",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Affected by alcohol to the extent of losing control of one's faculties or behavior.",
      "Having had too much alcohol to drink.",
      "Caused by or relating to excessive consumption of alcohol.",
      "A person who is drunk or who habitually drinks to excess."
    ],
    "examples": [
      "He got drunk at the party last night.",
      "Driving while drunk is a serious offense."
    ]
  },
  {
    "word": "elbow",
    "collision_group_id": "elbow",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The joint between the forearm and the upper arm.",
      "A piece of pipe bent at a sharp angle.",
      "To push someone with one's elbow.",
      "The part of a sleeve covering the elbow."
    ],
    "examples": [
      "He rested his elbow on the table.",
      "She elbowed her way through the crowd."
    ]
  },
  {
    "word": "engagement",
    "collision_group_id": "engage_family",
    "pos": "n",
    "family": "engaged,adj",
    "translation_meaning": "",
    "definitions": [
      "A formal agreement to get married.",
      "An arrangement to do something or go somewhere at a fixed time.",
      "The action of engaging or being engaged.",
      "A fight or battle between armed forces."
    ],
    "examples": [
      "They announced their engagement to their family.",
      "I have a previous engagement and cannot attend the meeting."
    ]
  },
  {
    "word": "explode",
    "collision_group_id": "explode_family",
    "pos": "v",
    "family": "explosion,n",
    "translation_meaning": "",
    "definitions": [
      "To burst or shatter violently and noisily as a result of rapid combustion or decomposition.",
      "To increase suddenly and rapidly in number or extent.",
      "To show a violent emotion.",
      "To disprove a theory or belief."
    ],
    "examples": [
      "The bomb could explode at any moment.",
      "The population of the city has exploded in recent years."
    ]
  },
  {
    "word": "fall in love",
    "collision_group_id": "fall in love",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To develop a deep romantic or sexual attachment to someone.",
      "To begin to feel love for another person.",
      "To be captivated or charmed by someone.",
      "To become infatuated with someone."
    ],
    "examples": [
      "They fell in love after meeting at a friend's party.",
      "It is easy to fall in love with the beautiful scenery of the countryside."
    ]
  },
  {
    "word": "fasten",
    "collision_group_id": "fasten",
    "pos": "v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To close or join securely.",
      "To fix or hold in place.",
      "To direct one's attention or gaze.",
      "To attach something firmly."
    ],
    "examples": [
      "Please fasten your seatbelts.",
      "She fastened the brooch to her dress."
    ]
  },
  {
    "word": "fly",
    "collision_group_id": "fly_insect",
    "pos": "n",
    "family": "insect",
    "translation_meaning": "",
    "definitions": [
      "A flying insect of a large order characterized by a single pair of transparent wings and sucking or piercing mouthparts.",
      "To move through the air using wings.",
      "To travel in an aircraft.",
      "A flap of material covering the opening of a pair of trousers."
    ],
    "examples": [
      "A fly was buzzing around the room.",
      "I need to learn how to fly a kite."
    ]
  },
  {
    "word": "folk",
    "collision_group_id": "folk",
    "pos": "n, adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "People in general.",
      "Originating from the traditional culture of a country or community.",
      "Relating to the traditional art or culture of a community.",
      "One's family or relatives."
    ],
    "examples": [
      "The local folk are very friendly.",
      "She enjoys listening to folk music."
    ]
  },
  {
    "word": "fool",
    "collision_group_id": "fool_family",
    "pos": "n",
    "family": "foolish,adj",
    "translation_meaning": "",
    "definitions": [
      "A person who acts unwisely or imprudently; a silly person.",
      "To trick or deceive someone.",
      "A jester or clown in a medieval court.",
      "A dessert made of puréed fruit mixed with cream or custard."
    ],
    "examples": [
      "I felt like a fool for believing his lies.",
      "You can't fool me that easily."
    ]
  },
  {
    "word": "for fun",
    "collision_group_id": "for fun",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "For enjoyment or amusement, not for a serious purpose.",
      "Done for pleasure rather than for any other reason.",
      "As a form of entertainment.",
      "Just for the sake of enjoyment."
    ],
    "examples": [
      "We decided to play a game of cards just for fun.",
      "She started baking cakes for fun, but now it's her business."
    ]
  },
  {
    "word": "for the fun of it",
    "collision_group_id": "for fun",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "For the simple enjoyment of doing something, without any other motive.",
      "Simply for amusement or pleasure.",
      "For the sake of entertainment and not for a serious reason.",
      "Done purely for one's own enjoyment."
    ],
    "examples": [
      "I don't get paid for it; I just write my blog for the fun of it.",
      "They decided to climb the hill just for the fun of it."
    ]
  },
  {
    "word": "force",
    "collision_group_id": "force_group",
    "pos": "n",
    "family": "group of people",
    "translation_meaning": "",
    "definitions": [
      "An organized body of military personnel or police.",
      "Strength or energy as an attribute of physical action or movement.",
      "Coercion or compulsion, especially with the use or threat of violence.",
      "To make someone do something against their will."
    ],
    "examples": [
      "The government sent in a police force to control the riots.",
      "The force of the explosion was incredible."
    ]
  },
  {
    "word": "forehead",
    "collision_group_id": "forehead",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The part of the face above the eyebrows.",
      "The area of the head between the hairline and the eyes.",
      "The front part of the head.",
      "The brow."
    ],
    "examples": [
      "He wiped the sweat from his forehead.",
      "She has a high forehead."
    ]
  },
  {
    "word": "forgetful",
    "collision_group_id": "forgetful",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Apt or likely not to remember.",
      "Having a poor memory.",
      "Characterized by a tendency to forget.",
      "Negligent or neglectful."
    ],
    "examples": [
      "As he grew older, he became more forgetful.",
      "I'm so forgetful, I left my keys at home again."
    ]
  },
  {
    "word": "garage",
    "collision_group_id": "garage_business",
    "pos": "n",
    "family": "business",
    "translation_meaning": "",
    "definitions": [
      "A building where motor vehicles are repaired.",
      "A building for housing a motor vehicle or vehicles.",
      "A type of popular music with a heavy, syncopated rhythm.",
      "A place that sells fuel for motor vehicles."
    ],
    "examples": [
      "I need to take my car to the garage to get it fixed.",
      "We park our car in the garage."
    ]
  },
  {
    "word": "gate",
    "collision_group_id": "gate_airport",
    "pos": "n",
    "family": "airport",
    "translation_meaning": "",
    "definitions": [
      "A hinged barrier used to close an opening in a wall, fence, or hedge.",
      "The place in an airport where passengers go to get on their plane.",
      "The number of people who pay to enter a sports ground or other venue.",
      "A device that performs a basic logical operation in computing."
    ],
    "examples": [
      "Our flight is boarding at gate 23.",
      "Please close the garden gate behind you."
    ]
  },
  {
    "word": "gentleman",
    "collision_group_id": "gentleman",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A chivalrous, courteous, or honorable man.",
      "A man of good social position, especially one of wealth and leisure.",
      "A polite or formal way of referring to a man.",
      "A man who is polite and well-mannered."
    ],
    "examples": [
      "He was a true gentleman, always holding the door open for others.",
      "Ladies and gentleman, please take your seats."
    ]
  },
  {
    "word": "get away with something",
    "collision_group_id": "get away with sth",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To succeed in avoiding punishment for something.",
      "To do something wrong or risky without being caught or punished.",
      "To escape blame or punishment for a wrongdoing.",
      "To manage to do something undesirable without being discovered."
    ],
    "examples": [
      "He cheated on the exam and thought he could get away with it.",
      "I can't believe she managed to get away with telling such a lie."
    ]
  },
  {
    "word": "get in",
    "collision_group_id": "get in",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To arrive at a place.",
      "To enter a place, especially a building or vehicle.",
      "To be elected to a political position.",
      "To become involved in a difficult situation."
    ],
    "examples": [
      "What time does your train get in?",
      "Quick, get in the car before it starts to rain."
    ]
  },
  {
    "word": "ghost",
    "collision_group_id": "ghost",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An apparition of a dead person which is believed to appear or become manifest to the living.",
      "A faint trace or slight possibility of something.",
      "To end a personal relationship with someone by suddenly and without explanation withdrawing from all communication.",
      "The soul or spirit of a dead person."
    ],
    "examples": [
      "Some people believe they have seen a ghost in the old house.",
      "There wasn't a ghost of a chance that he would win."
    ]
  },
  {
    "word": "giant",
    "collision_group_id": "giant",
    "pos": "n, adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An imaginary being of human form but superhuman size.",
      "A person or thing of unusually great size, ability, or importance.",
      "Of very great size or force; gigantic.",
      "A star of relatively great size and luminosity."
    ],
    "examples": [
      "The story was about a friendly giant who lived in a castle.",
      "That company is a giant in the tech industry."
    ]
  },
  {
    "word": "grow tired/old/calm, etc.",
    "collision_group_id": "grow_state",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To gradually become tired, old, calm, etc.",
      "To pass into a specified state or condition over time.",
      "To develop a particular quality or feeling.",
      "To undergo a gradual change to a new state."
    ],
    "examples": [
      "As the day went on, the children began to grow tired.",
      "He grew calm after hearing the good news."
    ]
  },
  {
    "word": "hang about/around",
    "collision_group_id": "hang_about",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To wait or spend time somewhere, usually doing nothing.",
      "To loiter or wait around without any clear purpose.",
      "To stay in a place longer than is necessary.",
      "To associate with someone."
    ],
    "examples": [
      "They were just hanging around the street corner.",
      "I decided to hang about after the meeting to talk to the speaker."
    ]
  },
  {
    "word": "hang out",
    "collision_group_id": "hang out",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To spend a lot of time in a place or with someone.",
      "To relax and do nothing in particular.",
      "To display something, such as laundry, on a line.",
      "To frequent a particular place."
    ],
    "examples": [
      "The kids like to hang out at the mall on weekends.",
      "We're just going to hang out at my place tonight."
    ]
  },
  {
    "word": "harbor",
    "collision_group_id": "harbor",
    "pos": "n",
    "family": "harbour",
    "translation_meaning": "",
    "definitions": [
      "A place on the coast where vessels may find shelter, especially one protected from rough water.",
      "To keep a thought or feeling, typically a negative one, in one's mind, especially secretly.",
      "To give a home or shelter to.",
      "A port or haven for ships."
    ],
    "examples": [
      "The ships were safe in the harbor during the storm.",
      "He started to harbor doubts about the plan."
    ]
  },
  {
    "word": "heaven",
    "collision_group_id": "heaven",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "In some religions, the place where God or the gods are believed to live and where good people are believed to go when they die.",
      "A place or state of supreme happiness.",
      "The sky, especially as seen from the earth.",
      "A place of great comfort and pleasure."
    ],
    "examples": [
      "She believes that her grandmother is in heaven.",
      "Lying on the beach in the sun is my idea of heaven."
    ]
  },
  {
    "word": "heel",
    "collision_group_id": "heel",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The back part of the human foot below the ankle.",
      "The part of a shoe or stocking that covers the heel.",
      "An inconsiderate or untrustworthy person.",
      "The end of a loaf of bread."
    ],
    "examples": [
      "I have a blister on my heel.",
      "The heel of her shoe broke."
    ]
  },
  {
    "word": "hell",
    "collision_group_id": "hell",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "In some religions, a place of evil and suffering where the wicked are punished after death.",
      "A state or place of great suffering; an ordeal.",
      "Used for emphasis, especially to express anger or surprise.",
      "A situation of extreme difficulty and unpleasantness."
    ],
    "examples": [
      "The final exams were hell.",
      "What the hell are you doing?"
    ]
  },
  {
    "word": "horror",
    "collision_group_id": "horror",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An intense feeling of fear, shock, or disgust.",
      "A thing causing such a feeling.",
      "A genre of fiction which is intended to, or has the capacity to, frighten its readers.",
      "Intense dismay."
    ],
    "examples": [
      "She watched in horror as the building collapsed.",
      "I love watching horror movies, even though they scare me."
    ]
  },
  {
    "word": "hunt",
    "collision_group_id": "hunt_chase",
    "pos": "v",
    "family": "chase",
    "translation_meaning": "",
    "definitions": [
      "To pursue and kill a wild animal for sport or food.",
      "To search determinedly for someone or something.",
      "The act of hunting.",
      "To chase or pursue."
    ],
    "examples": [
      "Lions often hunt in groups.",
      "The police are hunting for the escaped prisoner."
    ]
  },
  {
    "word": "hurry up (somebody/something)",
    "collision_group_id": "hurry up",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To move or act more quickly.",
      "To cause someone to move or act more quickly.",
      "An expression used to urge someone to be faster.",
      "To speed up a process."
    ],
    "examples": [
      "Hurry up, or we'll be late for the movie!",
      "Can you try to hurry up the paperwork?"
    ]
  },
  {
    "word": "hut",
    "collision_group_id": "hut",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A small, simple, single-story building or shelter.",
      "A crude or primitive dwelling.",
      "A temporary shelter for soldiers or campers.",
      "A small shed or cabin."
    ],
    "examples": [
      "They lived in a small wooden hut in the forest.",
      "The hikers took refuge in a mountain hut during the storm."
    ]
  },
  {
    "word": "immoral",
    "collision_group_id": "immoral",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Not conforming to accepted standards of morality.",
      "Not morally good or right; wicked.",
      "Violating moral principles.",
      "Corrupt or unethical."
    ],
    "examples": [
      "Many people consider lying to be immoral.",
      "He was punished for his immoral behavior."
    ]
  },
  {
    "word": "in tears",
    "collision_group_id": "in tears",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Crying or weeping.",
      "In the state of shedding tears.",
      "Visibly upset and crying.",
      "With tears in one's eyes."
    ],
    "examples": [
      "She was in tears after hearing the bad news.",
      "He left the room in tears."
    ]
  },
  {
    "word": "initial",
    "collision_group_id": "initial_letter",
    "pos": "n",
    "family": "letter of alphabet",
    "translation_meaning": "",
    "definitions": [
      "The first letter of a name or word.",
      "Existing or occurring at the beginning.",
      "The first stage of a process.",
      "To mark or sign with one's initials."
    ],
    "examples": [
      "He carved his initials into the tree.",
      "My initial reaction was one of surprise."
    ]
  },
  {
    "word": "insult",
    "collision_group_id": "insult",
    "pos": "v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To speak to or treat with disrespect or scornful abuse.",
      "An offensive or disrespectful remark or action.",
      "To cause offense to someone.",
      "A remark or action that is insulting."
    ],
    "examples": [
      "He was fired for insulting a customer.",
      "She took his comment as a personal insult."
    ]
  },
  {
    "word": "insurance",
    "collision_group_id": "insure_family",
    "pos": "n",
    "family": "insure,v",
    "translation_meaning": "",
    "definitions": [
      "An arrangement by which a company provides a guarantee of compensation for specified loss, damage, illness, or death in return for payment of a premium.",
      "A thing providing protection against a possible eventuality.",
      "The business of providing insurance.",
      "The amount for which something is insured."
    ],
    "examples": [
      "It is important to have car insurance before you drive.",
      "He took out travel insurance before his trip."
    ]
  },
  {
    "word": "iron",
    "collision_group_id": "iron",
    "pos": "v, n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A strong, hard magnetic silvery-gray metal.",
      "A handheld implement with a flat steel base that is heated to smooth clothes.",
      "To smooth clothes with an iron.",
      "A club used in golf for hitting the ball."
    ],
    "examples": [
      "The gate was made of iron.",
      "I need to iron my shirt before the interview."
    ]
  },
  {
    "word": "jog",
    "collision_group_id": "jog_family",
    "pos": "v",
    "family": "jogging,n",
    "translation_meaning": "",
    "definitions": [
      "To run at a steady, gentle pace, especially on a regular basis as a form of exercise.",
      "To nudge or push slightly.",
      "To stimulate someone's memory.",
      "A spell of jogging."
    ],
    "examples": [
      "I like to jog in the park every morning.",
      "Can you jog my memory about what we discussed?"
    ]
  },
  {
    "word": "jump",
    "collision_group_id": "jump_fright",
    "pos": "v",
    "family": "to make a sudden movement (in fright)",
    "translation_meaning": "",
    "definitions": [
      "To push oneself off a surface and into the air by using the muscles in one's legs and feet.",
      "To make a sudden, startled movement.",
      "To move quickly and suddenly.",
      "An act of jumping."
    ],
    "examples": [
      "The loud noise made me jump.",
      "He can jump over the fence."
    ]
  },
  {
    "word": "jury",
    "collision_group_id": "jury",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A body of people sworn to give a verdict in a legal case on the basis of evidence submitted to them in court.",
      "A group of people selected to decide the winner of a competition.",
      "A panel of judges.",
      "A body of citizens that hears testimony and determines the facts in a legal case."
    ],
    "examples": [
      "The jury found the defendant guilty.",
      "She was selected to serve on the jury for the trial."
    ]
  },
  {
    "word": "knit",
    "collision_group_id": "knit",
    "pos": "v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To make a garment or other item by interlocking loops of wool or other yarn with knitting needles or on a machine.",
      "To unite or cause to unite.",
      "To make a frowning expression.",
      "A knitted fabric."
    ],
    "examples": [
      "My grandmother taught me how to knit a scarf.",
      "The community was knit together by a common purpose."
    ]
  },
  {
    "word": "laser",
    "collision_group_id": "laser",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A device that emits light through a process of optical amplification based on the stimulated emission of electromagnetic radiation.",
      "A narrow and intense beam of light.",
      "Light Amplification by Stimulated Emission of Radiation.",
      "Used in surgery, for cutting metal, and in telecommunications."
    ],
    "examples": [
      "The surgeon used a laser to perform the operation.",
      "The cat loved chasing the red dot from the laser pointer."
    ]
  },
  {
    "word": "lead",
    "collision_group_id": "lead_winning",
    "pos": "n",
    "family": "winning",
    "translation_meaning": "",
    "definitions": [
      "The initiative in an action; an example for others to follow.",
      "A position of advantage in a contest; the front place.",
      "To be in charge or command of.",
      "A strap or cord for restraining and guiding a dog or other animal."
    ],
    "examples": [
      "Our team took the lead in the second half of the game.",
      "She followed his lead and invested in the same company."
    ]
  },
  {
    "word": "learning",
    "collision_group_id": "learn_family",
    "pos": "n",
    "family": "learned,adj",
    "translation_meaning": "",
    "definitions": [
      "The acquisition of knowledge or skills through experience, study, or being taught.",
      "Knowledge acquired through study or experience.",
      "The process of gaining knowledge.",
      "A change in behavior resulting from experience."
    ],
    "examples": [
      "The school provides a good environment for learning.",
      "Continuous learning is important for personal and professional growth."
    ]
  },
  {
    "word": "lightning",
    "collision_group_id": "lightning",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The occurrence of a natural electrical discharge of very short duration and high voltage between a cloud and the ground or within a cloud.",
      "A brilliant electric spark discharge in the atmosphere.",
      "Happening very quickly.",
      "A flash of light in the sky caused by an electrical discharge."
    ],
    "examples": [
      "The storm was accompanied by thunder and lightning.",
      "He ran with lightning speed."
    ]
  },
  {
    "word": "literary",
    "collision_group_id": "literary",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Concerning the writing, study, or content of literature, especially of the kind valued for quality of form.",
      "Relating to literature.",
      "Well-read or scholarly.",
      "Associated with authors or scholars."
    ],
    "examples": [
      "She is a well-known literary critic.",
      "The book won a prestigious literary award."
    ]
  },
  {
    "word": "loaf",
    "collision_group_id": "loaf",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A quantity of bread that is shaped and baked in one piece and can be sliced for eating.",
      "A quantity of food formed into a rectangular shape and cooked.",
      "To spend one's time in an aimless, idle way.",
      "A mass of bread baked in a single piece."
    ],
    "examples": [
      "Could you buy a loaf of bread on your way home?",
      "We had a delicious meat loaf for dinner."
    ]
  },
  {
    "word": "loose",
    "collision_group_id": "loose",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Not firmly or tightly fixed in place; detached or able to be detached.",
      "Not fitting tightly or closely.",
      "Not held in confinement or captivity.",
      "To set free; release."
    ],
    "examples": [
      "This button on my shirt is loose.",
      "He prefers to wear loose, comfortable clothing."
    ]
  },
  {
    "word": "madam",
    "collision_group_id": "madam",
    "pos": "n",
    "family": "polite way of speaking to a woman",
    "translation_meaning": "",
    "definitions": [
      "A polite and formal way of addressing a woman.",
      "A woman who is in charge of a group of prostitutes.",
      "Used to address a woman with respect.",
      "A form of address for a woman, particularly one of rank or authority."
    ],
    "examples": [
      "Can I help you, madam?",
      "Yes, madam, I will take care of it right away."
    ]
  },
  {
    "word": "magnificent",
    "collision_group_id": "magnificent",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Extremely beautiful, elaborate, or impressive.",
      "Very good; excellent.",
      "Grand and imposing in appearance.",
      "Splendid or impressive."
    ],
    "examples": [
      "The view from the top of the mountain was magnificent.",
      "She gave a magnificent performance in the play."
    ]
  },
  {
    "word": "make",
    "collision_group_id": "make_arrive",
    "pos": "v",
    "family": "arrive",
    "translation_meaning": "",
    "definitions": [
      "To form something by putting parts together or combining substances; construct; create.",
      "To arrive at or reach a destination.",
      "To cause something to exist or come about.",
      "To compel someone to do something."
    ],
    "examples": [
      "What time do you think we'll make it to the city?",
      "She managed to make the last train home."
    ]
  },
  {
    "word": "marriage",
    "collision_group_id": "marriage",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The legally or formally recognized union of two people as partners in a personal relationship.",
      "A combination or mixture of two or more elements.",
      "The state of being married.",
      "A wedding ceremony."
    ],
    "examples": [
      "Their marriage lasted for over 50 years.",
      "The novel explores the theme of marriage and family."
    ]
  },
  {
    "word": "mask",
    "collision_group_id": "mask",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A covering for all or part of the face, worn as a disguise, or for protection or hygiene.",
      "To conceal something from view.",
      "A likeness of a person's face.",
      "A protective covering worn on the face."
    ],
    "examples": [
      "He wore a mask to the masquerade ball.",
      "The doctor and nurse wore surgical masks."
    ]
  },
  {
    "word": "mate",
    "collision_group_id": "mate",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A friend or companion.",
      "The sexual partner of a bird or other animal.",
      "An officer on a merchant ship subordinate to the master.",
      "To come or bring together for breeding."
    ],
    "examples": [
      "I'm going to the pub with a few of my mates.",
      "The male bird tries to attract a mate with its song."
    ]
  },
  {
    "word": "mess",
    "collision_group_id": "mess",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A dirty or untidy state of things or of a place.",
      "A situation that is confused and full of problems.",
      "To make something dirty or untidy.",
      "A portion of soft or semi-liquid food."
    ],
    "examples": [
      "Your room is a complete mess; please clean it up.",
      "The company is in a financial mess."
    ]
  },
  {
    "word": "mineral water",
    "collision_group_id": "mineral water",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Water containing dissolved mineral salts or gases.",
      "Bottled water that contains minerals and is often carbonated.",
      "Water from a natural spring containing various minerals.",
      "A type of water that is naturally or artificially impregnated with mineral salts or gases."
    ],
    "examples": [
      "I prefer sparkling mineral water to still water.",
      "He ordered a bottle of mineral water with his meal."
    ]
  },
  {
    "word": "mix up (somebody/something)",
    "collision_group_id": "mix up",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To confuse two or more people or things.",
      "To mistake one person or thing for another.",
      "To create a state of confusion or disorder.",
      "To prepare something by combining various ingredients."
    ],
    "examples": [
      "I always mix up their names because they look so similar.",
      "Don't mix up the clean clothes with the dirty ones."
    ]
  },
  {
    "word": "monster",
    "collision_group_id": "monster",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An imaginary creature that is typically large, ugly, and frightening.",
      "A person of exceptional and daunting size, strength, or skill.",
      "A cruelly wicked or evil person.",
      "Extraordinarily large."
    ],
    "examples": [
      "The story was about a sea monster that attacked ships.",
      "He is a monster on the basketball court."
    ]
  },
  {
    "word": "moral",
    "collision_group_id": "moral",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A lesson, especially one concerning what is right or prudent, that can be derived from a story, a piece of information, or an experience.",
      "A person's standards of behavior or beliefs concerning what is and is not acceptable for them to do.",
      "Concerned with the principles of right and wrong behavior.",
      "The ethical significance or practical lesson of a story."
    ],
    "examples": [
      "The moral of the story is to always be honest.",
      "He has a strong moral compass."
    ]
  },
  {
    "word": "naked",
    "collision_group_id": "naked",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Not wearing any clothes.",
      "Exposed and vulnerable; unprotected.",
      "Expressed openly and without disguise.",
      "Without any covering or protection."
    ],
    "examples": [
      "The child was running around naked in the garden.",
      "The naked truth can sometimes be hard to accept."
    ]
  },
  {
    "word": "nasty",
    "collision_group_id": "nasty",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Very bad or unpleasant.",
      "Behaving in an unpleasant or spiteful way.",
      "Offensive or disgusting.",
      "Dangerous or serious."
    ],
    "examples": [
      "There was a nasty smell coming from the kitchen.",
      "He has a nasty habit of interrupting people."
    ]
  },
  {
    "word": "navy",
    "collision_group_id": "navy",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The branch of a nation's armed services that conducts military operations at sea.",
      "A country's fleet of warships.",
      "A dark blue color.",
      "The entire naval force of a country."
    ],
    "examples": [
      "He served in the navy for twenty years.",
      "She wore a navy blue dress."
    ]
  },
  {
    "word": "neat",
    "collision_group_id": "neat",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Arranged in a tidy way; in good order.",
      "Done with or demonstrating skill or efficiency.",
      "(of a drink of liquor) served without a mixer or ice.",
      "Excellent or clever."
    ],
    "examples": [
      "Her handwriting is very neat and easy to read.",
      "He likes to drink his whiskey neat."
    ]
  },
  {
    "word": "next door",
    "collision_group_id": "next door",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "In or to the next house or room.",
      "Living or situated in the adjacent property.",
      "The people who live next to you.",
      "Very near."
    ],
    "examples": [
      "The people who live next door are very friendly.",
      "I'm just going next door to borrow some sugar."
    ]
  },
  {
    "word": "not believe your eyes/ears",
    "collision_group_id": "not believe",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To be very surprised by something you see or hear.",
      "To find something you have seen or heard so shocking that it seems impossible.",
      "To be astonished or incredulous about a sight or sound.",
      "To think that what you are seeing or hearing cannot be real."
    ],
    "examples": [
      "I couldn't believe my eyes when I saw him standing there.",
      "She couldn't believe her ears when they announced she had won."
    ]
  },
  {
    "word": "nut",
    "collision_group_id": "nut_family",
    "pos": "n",
    "family": "peanut,n",
    "translation_meaning": "",
    "definitions": [
      "A fruit consisting of a hard or tough shell around an edible kernel.",
      "A person who is crazy or eccentric.",
      "A small block of metal with a threaded hole through it, for screwing onto a bolt.",
      "A person's head."
    ],
    "examples": [
      "She cracked the nut with a nutcracker.",
      "He's a bit of a nut, but he's harmless."
    ]
  },
  {
    "word": "on a diet",
    "collision_group_id": "on a diet",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Following a special or limited eating plan to lose weight or for medical reasons.",
      "Restricting oneself to small amounts or special kinds of food.",
      "Engaged in a regimen of eating and drinking sparingly.",
      "The state of consuming food in a regulated way."
    ],
    "examples": [
      "I can't eat cake; I'm on a diet.",
      "She has been on a diet for two weeks and has lost five pounds."
    ]
  },
  {
    "word": "on board",
    "collision_group_id": "on board",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "On or in a ship, aircraft, or other vehicle.",
      "In agreement with or supporting a project or idea.",
      "As a member of a team or group.",
      "Present and accounted for."
    ],
    "examples": [
      "Welcome on board the flight to Paris.",
      "We need to get everyone on board with the new plan."
    ]
  },
  {
    "word": "on display",
    "collision_group_id": "on display",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Exhibited publicly.",
      "Placed in a prominent position for people to see.",
      "Being shown or exhibited.",
      "Clearly visible for others to notice."
    ],
    "examples": [
      "The artist's paintings are on display at the gallery.",
      "His lack of manners was on display for everyone to see."
    ]
  },
  {
    "word": "on duty",
    "collision_group_id": "duty_status",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Actively engaged in one's regular work.",
      "Currently at work and responsible for one's job.",
      "On one's shift at work.",
      "Available to perform one's professional responsibilities."
    ],
    "examples": [
      "The security guard is on duty all night.",
      "I can't talk now, I'm on duty."
    ]
  },
  {
    "word": "off duty",
    "collision_group_id": "duty_status",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Not actively engaged in one's regular work.",
      "Not currently at work.",
      "Free from the responsibilities of one's job.",
      "Having finished one's shift at work."
    ],
    "examples": [
      "The police officer was off duty when the incident occurred.",
      "I like to relax and watch movies when I'm off duty."
    ]
  },
  {
    "word": "orchestra",
    "collision_group_id": "orchestra",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A large instrumental ensemble typical of classical music, which combines instruments from different families.",
      "The part of a theater where the orchestra plays, typically in front of the stage.",
      "A group of musicians who play together.",
      "The main floor of a theater."
    ],
    "examples": [
      "She plays the violin in the city orchestra.",
      "We had seats in the orchestra section of the theater."
    ]
  },
  {
    "word": "pack",
    "collision_group_id": "pack",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A small cardboard or paper container and its contents.",
      "A group of wild animals, especially wolves, living and hunting together.",
      "To fill a suitcase or other container with clothes and other items needed for a journey.",
      "A set of playing cards."
    ],
    "examples": [
      "I bought a pack of cigarettes.",
      "A pack of wolves roamed the forest."
    ]
  },
  {
    "word": "painful",
    "collision_group_id": "pain_family",
    "pos": "adj",
    "family": "painless,adj",
    "translation_meaning": "",
    "definitions": [
      "Causing physical pain.",
      "Causing emotional or mental distress.",
      "Difficult or unpleasant.",
      "Affected with pain."
    ],
    "examples": [
      "The injection was painful, but it was over quickly.",
      "It was a painful decision to make."
    ]
  },
  {
    "word": "pale",
    "collision_group_id": "pale",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Light in color or having little color.",
      "(of a person's face) having less color than usual, typically from shock, fear, or illness.",
      "Inferior or unimpressive.",
      "To seem less important when compared with something else."
    ],
    "examples": [
      "She looked pale and tired after being sick.",
      "He wore a pale blue shirt."
    ]
  },
  {
    "word": "passage",
    "collision_group_id": "passage_connecting",
    "pos": "n",
    "family": "connecting way (e.g., hallway, tunnel)",
    "translation_meaning": "",
    "definitions": [
      "A narrow way allowing access between buildings or through a building; a corridor.",
      "The action or process of moving through or past somewhere on the way from one place to another.",
      "A short extract from a book or piece of music.",
      "The passing of time."
    ],
    "examples": [
      "There is a narrow passage between the two houses.",
      "He read a passage from the Bible."
    ]
  },
  {
    "word": "pavement",
    "collision_group_id": "pavement",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A raised paved or asphalted path for pedestrians at the side of a road.",
      "The hard surface of a road or street.",
      "A paved area.",
      "The sidewalk."
    ],
    "examples": [
      "It's safer to walk on the pavement than on the road.",
      "The pavement was cracked and uneven."
    ]
  },
  {
    "word": "peak",
    "collision_group_id": "peak",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The pointed top of a mountain.",
      "The point of highest activity, quality, or achievement.",
      "To reach a highest point, either of a specified value or at a specified time.",
      "A projecting pointed part of a flat cap."
    ],
    "examples": [
      "The mountain peak was covered in snow.",
      "Traffic is at its peak during rush hour."
    ]
  },
  {
    "word": "penalty",
    "collision_group_id": "penalty",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A punishment imposed for breaking a law, rule, or contract.",
      "A disadvantage or unpleasant experience suffered as the result of an action or circumstance.",
      "A punishment for a foul in a sport.",
      "A loss or forfeiture."
    ],
    "examples": [
      "The penalty for speeding is a fine.",
      "The team was awarded a penalty kick."
    ]
  },
  {
    "word": "pill",
    "collision_group_id": "pill",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A small round mass of solid medicine for swallowing whole.",
      "A contraceptive pill.",
      "A tedious or unpleasant person.",
      "A small ball of anything."
    ],
    "examples": [
      "The doctor prescribed some pills for my headache.",
      "She takes a vitamin pill every day."
    ]
  },
  {
    "word": "pin",
    "collision_group_id": "pin",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A thin piece of metal with a sharp point at one end and a round head at the other, used for fastening things together.",
      "To fasten something with a pin.",
      "To hold someone or something firmly in a particular position.",
      "A short metal rod or peg."
    ],
    "examples": [
      "She used a pin to attach the note to the board.",
      "He was pinned under the wreckage of the car."
    ]
  },
  {
    "word": "pity",
    "collision_group_id": "pity",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The feeling of sorrow and compassion caused by the suffering and misfortunes of others.",
      "A cause for regret or disappointment.",
      "To feel pity for someone.",
      "Sympathy and sorrow for the misfortunes of others."
    ],
    "examples": [
      "I feel such pity for the people who lost their homes in the fire.",
      "It's a pity you can't come to the party."
    ]
  },
  {
    "word": "pray",
    "collision_group_id": "pray_family",
    "pos": "v",
    "family": "prayer",
    "translation_meaning": "",
    "definitions": [
      "To address a prayer to God or another deity.",
      "To hope for something very much.",
      "To ask earnestly for something.",
      "To communicate with a god or spirit."
    ],
    "examples": [
      "They pray for peace in the world.",
      "I'm praying that I pass the exam."
    ]
  },
  {
    "word": "pregnant",
    "collision_group_id": "pregnant_family",
    "pos": "adj",
    "family": "pregnancy,n",
    "translation_meaning": "",
    "definitions": [
      "(of a woman or female animal) having a child or young developing in the uterus.",
      "Full of meaning; significant or suggestive.",
      "Carrying an unborn offspring within the body.",
      "Filled with something."
    ],
    "examples": [
      "She is six months pregnant.",
      "There was a pregnant pause in the conversation."
    ]
  },
  {
    "word": "priest",
    "collision_group_id": "priest",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An ordained minister of the Catholic, Orthodox, or Anglican Church having the authority to perform certain rites and administer certain sacraments.",
      "A person who performs religious ceremonies.",
      "An expert or leading figure in a particular field.",
      "A spiritual leader in a religion."
    ],
    "examples": [
      "The priest delivered a sermon on forgiveness.",
      "He decided to become a priest when he was young."
    ]
  },
  {
    "word": "propose",
    "collision_group_id": "propose_family",
    "pos": "v",
    "family": "proposal,n, suggest marriage",
    "translation_meaning": "",
    "definitions": [
      "To put forward an idea or plan for consideration by other people.",
      "To make an offer of marriage to someone.",
      "To nominate someone for an office or position.",
      "To intend to do something."
    ],
    "examples": [
      "He proposed to her on a romantic trip to Paris.",
      "I propose that we adjourn the meeting."
    ]
  },
  {
    "word": "pump",
    "collision_group_id": "pump",
    "pos": "n, v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A mechanical device using suction or pressure to raise or move liquids, compress gases, or force air into inflatable objects such as tires.",
      "To cause a liquid, gas, or other substance to move in a particular direction by or as if by a pump.",
      "A type of shoe that is low-cut and without a strap.",
      "To move something with vigorous, up-and-down action."
    ],
    "examples": [
      "I need to pump up the tires on my bike.",
      "The heart pumps blood through the arteries."
    ]
  },
  {
    "word": "queue",
    "collision_group_id": "queue",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A line or sequence of people or vehicles awaiting their turn to be attended to or to proceed.",
      "To form or wait in a line.",
      "A list of data items, commands, etc., stored so as to be retrievable in a definite order.",
      "A braid of hair worn at the back."
    ],
    "examples": [
      "We had to stand in a long queue to buy tickets.",
      "Please queue here for the bus."
    ]
  },
  {
    "word": "racket",
    "collision_group_id": "racket_sport",
    "pos": "n",
    "family": "sport",
    "translation_meaning": "",
    "definitions": [
      "A bat with a round or oval frame strung with catgut, nylon, etc., used in tennis, badminton, and other games.",
      "A loud, unpleasant noise.",
      "A fraudulent scheme or enterprise.",
      "A type of snowshoe."
    ],
    "examples": [
      "He bought a new tennis racket.",
      "The children were making a terrible racket upstairs."
    ]
  },
  {
    "word": "rainbow",
    "collision_group_id": "rainbow",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An arch of colors visible in the sky, caused by the refraction and dispersion of the sun's light by rain or other water droplets in the atmosphere.",
      "A wide range of related and typically colorful things.",
      "A multi-colored arc in the sky.",
      "A symbol of hope and promise."
    ],
    "examples": [
      "We saw a beautiful rainbow after the rain stopped.",
      "The room was decorated with a rainbow of colors."
    ]
  },
  {
    "word": "range",
    "collision_group_id": "range_mountains",
    "pos": "n",
    "family": "mountains",
    "translation_meaning": "",
    "definitions": [
      "A line or series of mountains or hills.",
      "The area of variation between upper and lower limits on a particular scale.",
      "A set of different things of the same general type.",
      "To vary or extend between specified limits."
    ],
    "examples": [
      "The Rocky Mountains are a major mountain range in North America.",
      "The store offers a wide range of products."
    ]
  },
  {
    "word": "refund",
    "collision_group_id": "refund",
    "pos": "n, v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A repayment of a sum of money.",
      "To pay back money, typically to a customer who is not satisfied with goods or services bought.",
      "The act of refunding money.",
      "An amount of money that is given back."
    ],
    "examples": [
      "I returned the faulty item and got a full refund.",
      "The concert was canceled, so they will refund our tickets."
    ]
  },
  {
    "word": "regards",
    "collision_group_id": "regards",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Best wishes (used to express friendliness in a letter or message).",
      "Respect or esteem.",
      "To consider or think of in a specified way.",
      "A look or gaze."
    ],
    "examples": [
      "Please give my regards to your parents.",
      "He has high regards for his former teacher."
    ]
  },
  {
    "word": "republic",
    "collision_group_id": "republic",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A state in which supreme power is held by the people and their elected representatives, and which has an elected or nominated president rather than a monarch.",
      "A form of government where the country is considered a 'public matter'.",
      "A state with a non-monarchical head of state.",
      "A group with a certain equality between its members."
    ],
    "examples": [
      "France is a republic.",
      "The Roman Republic lasted for over 500 years."
    ]
  },
  {
    "word": "resort",
    "collision_group_id": "resort_n",
    "pos": "n",
    "family": "resort",
    "translation_meaning": "",
    "definitions": [
      "A place that is a popular destination for vacations or recreation, or which is frequented for a particular purpose.",
      "The action of turning to and adopting a strategy or course of action, especially an extreme or undesirable one, so as to resolve a difficult situation.",
      "A vacation spot.",
      "A final option or course of action."
    ],
    "examples": [
      "We stayed at a beautiful beach resort in Mexico.",
      "As a last resort, we will have to sell the car."
    ]
  },
  {
    "word": "rob",
    "collision_group_id": "rob_family",
    "pos": "v",
    "family": "robber,n",
    "translation_meaning": "",
    "definitions": [
      "To take property unlawfully from a person or place by force or threat of force.",
      "To deprive someone of something.",
      "To steal from.",
      "To commit robbery."
    ],
    "examples": [
      "The thieves robbed the bank in the middle of the night.",
      "The injury robbed him of his chance to play in the championship."
    ]
  },
  {
    "word": "romantic",
    "collision_group_id": "romantic_family",
    "pos": "adj",
    "family": "romance,n",
    "translation_meaning": "",
    "definitions": [
      "Conducive to or characterized by the expression of love.",
      "Relating to, or of the nature of, romance.",
      "Fanciful; impractical; unrealistic.",
      "A person with romantic beliefs or attitudes."
    ],
    "examples": [
      "They went for a romantic dinner on their anniversary.",
      "He has a romantic view of the world."
    ]
  },
  {
    "word": "rope",
    "collision_group_id": "rope",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A length of strong, thick cord made by twisting together strands of natural or synthetic fibers.",
      "To catch, fasten, or tie with a rope.",
      "A series of things strung together.",
      "The specific procedures or details of a task."
    ],
    "examples": [
      "He used a rope to tie the boat to the dock.",
      "It took him a while to learn the ropes of the new job."
    ]
  },
  {
    "word": "rub out (something)",
    "collision_group_id": "rub out",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To remove something, especially writing, by rubbing.",
      "To erase something written.",
      "To get rid of something completely.",
      "To kill or murder someone."
    ],
    "examples": [
      "She used an eraser to rub out the mistake.",
      "He tried to rub out the memory of the accident."
    ]
  },
  {
    "word": "rubber",
    "collision_group_id": "rubber_substance",
    "pos": "n",
    "family": "substance",
    "translation_meaning": "",
    "definitions": [
      "A tough elastic polymeric substance made from the latex of a tropical plant or synthetically.",
      "An eraser.",
      "A waterproof overshoe.",
      "A contest consisting of an odd number of games."
    ],
    "examples": [
      "Tires are made of rubber.",
      "Can I borrow your rubber to erase this mistake?"
    ]
  },
  {
    "word": "rubbish",
    "collision_group_id": "rubbish",
    "pos": "n",
    "family": "waste; bad quality",
    "translation_meaning": "",
    "definitions": [
      "Waste material; refuse or litter.",
      "Something that is worthless or of poor quality.",
      "Nonsense.",
      "To criticize severely and reject as worthless."
    ],
    "examples": [
      "Please take the rubbish out to the bin.",
      "What he said was a load of rubbish."
    ]
  },
  {
    "word": "rude",
    "collision_group_id": "rude",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Offensively impolite or ill-mannered.",
      "Rough or unrefined.",
      "Unexpectedly and unpleasantly sharp or abrupt.",
      "Having a startling abruptness."
    ],
    "examples": [
      "It is rude to interrupt people when they are speaking.",
      "He received a rude awakening when he saw the bill."
    ]
  },
  {
    "word": "scandal",
    "collision_group_id": "scandal",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An action or event regarded as morally or legally wrong and causing general public outrage.",
      "Damage to reputation or character caused by public disclosure of immoral or discreditable actions.",
      "Gossip or slander.",
      "A disgraceful or discreditable action."
    ],
    "examples": [
      "The politician was involved in a major financial scandal.",
      "The affair caused a scandal in the small town."
    ]
  },
  {
    "word": "scratch",
    "collision_group_id": "scratch_damage",
    "pos": "n, v",
    "family": "hurt, damage",
    "translation_meaning": "",
    "definitions": [
      "To mark the surface of something with a sharp or pointed object.",
      "A mark made by scratching.",
      "To rub a part of one's body with one's fingernails to relieve an itch.",
      "To withdraw from a competition."
    ],
    "examples": [
      "Be careful not to scratch the new table.",
      "I have a scratch on my arm from the cat."
    ]
  },
  {
    "word": "sculpture",
    "collision_group_id": "sculpture",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The art of making two- or three-dimensional representative or abstract forms, especially by carving stone or wood or by casting metal or plaster.",
      "A work of sculpture.",
      "To create or represent something by sculpting.",
      "The art of carving, modeling, welding, or otherwise producing figurative or abstract works of art in three dimensions."
    ],
    "examples": [
      "The museum has a fine collection of modern sculpture.",
      "He carved a beautiful sculpture of a bird from a piece of wood."
    ]
  },
  {
    "word": "see off (somebody)",
    "collision_group_id": "see off",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To go to a station, airport, etc., to say goodbye to someone who is leaving.",
      "To accompany a person who is departing to their point of departure.",
      "To be present at the departure of someone to bid them farewell.",
      "To repel or drive away an attacker or opponent."
    ],
    "examples": [
      "Her parents came to the airport to see her off.",
      "We went to the train station to see off our friends."
    ]
  },
  {
    "word": "selfish",
    "collision_group_id": "selfish",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Lacking consideration for others; concerned chiefly with one's own personal profit or pleasure.",
      "Concerned primarily with one's own interests, benefits, or welfare.",
      "Motivated by self-interest.",
      "Not willing to share or help others."
    ],
    "examples": [
      "It was selfish of him to eat all the cookies.",
      "She's a selfish person who only thinks about herself."
    ]
  },
  {
    "word": "separate",
    "collision_group_id": "separate_v",
    "pos": "v",
    "family": "husband/wife",
    "translation_meaning": "",
    "definitions": [
      "To cause to be apart; divide.",
      "To stop living together as a married couple.",
      "To form a distinction or boundary between.",
      "To go in different directions."
    ],
    "examples": [
      "They decided to separate after years of unhappiness.",
      "Please separate the white clothes from the colored ones before washing."
    ]
  },
  {
    "word": "shade",
    "collision_group_id": "shade_sunlight",
    "pos": "n",
    "family": "no sunlight",
    "translation_meaning": "",
    "definitions": [
      "Comparative darkness and coolness caused by shelter from direct sunlight.",
      "A color, especially with regard to how light or dark it is or as distinguished from one nearly like it.",
      "To screen from direct light.",
      "A slight amount or degree of something."
    ],
    "examples": [
      "Let's sit in the shade of the tree.",
      "The room was painted in different shades of blue."
    ]
  },
  {
    "word": "shake your head",
    "collision_group_id": "shake head",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To turn one's head from side to side as a way of indicating disapproval, refusal, or sadness.",
      "To express a negative response or disagreement by moving one's head.",
      "To signify 'no' by turning the head.",
      "To show disbelief or disappointment by head movement."
    ],
    "examples": [
      "When I asked if he was coming, he just shook his head.",
      "She shook her head in disbelief at the news."
    ]
  },
  {
    "word": "shave",
    "collision_group_id": "shave",
    "pos": "v, n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To cut the hair off one's face or body.",
      "An act of shaving.",
      "To cut a thin slice from the surface of wood, ice, or other material.",
      "A narrow escape from danger."
    ],
    "examples": [
      "He needs to shave before he goes to work.",
      "That was a close shave; the car almost hit us."
    ]
  },
  {
    "word": "shore",
    "collision_group_id": "shore",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The land along the edge of a sea, lake, or wide river.",
      "Land, as opposed to sea.",
      "To prop up or support with a beam or post.",
      "The coast."
    ],
    "examples": [
      "We walked along the shore and collected seashells.",
      "The ship was anchored just off the shore."
    ]
  },
  {
    "word": "show somebody around",
    "collision_group_id": "show around",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To guide someone around a place to show them the interesting or important parts.",
      "To act as a guide for someone on their first visit to a place.",
      "To lead someone on a tour of a location.",
      "To familiarize a visitor with a place by showing them its main features."
    ],
    "examples": [
      "Let me show you around the office.",
      "When he visited, I showed him around the town."
    ]
  },
  {
    "word": "show somebody round",
    "collision_group_id": "show around",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To guide someone around a place to show them the interesting or important parts.",
      "To act as a guide for someone on their first visit to a place.",
      "To lead someone on a tour of a location.",
      "To familiarize a visitor with a place by showing them its main features."
    ],
    "examples": [
      "Let me show you round the house.",
      "The manager will show you round the factory."
    ]
  },
  {
    "word": "shut (somebody) up",
    "collision_group_id": "shut up",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To stop talking or make someone stop talking.",
      "An impolite way to tell someone to be quiet.",
      "To confine or imprison someone.",
      "To close a business or building."
    ],
    "examples": [
      "He told the noisy children to shut up.",
      "I wish he would just shut up and listen for a moment."
    ]
  },
  {
    "word": "sidewalk",
    "collision_group_id": "sidewalk",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A paved path, usually at the side of a road, for people to walk on.",
      "A pedestrian walkway.",
      "The American English term for pavement.",
      "A paved area for walking alongside a street."
    ],
    "examples": [
      "The children were riding their bikes on the sidewalk.",
      "It's safer to walk on the sidewalk."
    ]
  },
  {
    "word": "sigh",
    "collision_group_id": "sigh",
    "pos": "v, n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To emit a long, deep, audible breath expressing sadness, relief, tiredness, or a similar feeling.",
      "A long, deep, audible exhalation.",
      "To feel a deep yearning for someone or something.",
      "To make a sound resembling a sigh."
    ],
    "examples": [
      "She sighed with relief when she heard the good news.",
      "He gave a heavy sigh of disappointment."
    ]
  },
  {
    "word": "silk",
    "collision_group_id": "silk",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A fine, strong, soft, lustrous fiber produced by silkworms in making cocoons and collected to make thread and fabric.",
      "Thread or fabric made from silk.",
      "A Queen's Counsel in the UK, from the silk gown worn.",
      "Something that is as smooth and soft as silk."
    ],
    "examples": [
      "She wore a beautiful dress made of silk.",
      "The fabric felt as smooth as silk."
    ]
  },
  {
    "word": "sit up straight",
    "collision_group_id": "sit up straight",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To sit with one's back straight.",
      "To adopt an upright sitting posture.",
      "To stop slouching while seated.",
      "A command to sit in a proper, erect position."
    ],
    "examples": [
      "The teacher told the students to sit up straight.",
      "It's better for your posture if you sit up straight."
    ]
  },
  {
    "word": "stand up straight",
    "collision_group_id": "sit up straight",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To stand with one's back straight.",
      "To adopt an upright standing posture.",
      "To stop slouching while standing.",
      "A command to stand in a proper, erect position."
    ],
    "examples": [
      "The sergeant ordered the soldiers to stand up straight.",
      "Try to stand up straight to improve your posture."
    ]
  },
  {
    "word": "slave",
    "collision_group_id": "slave",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A person who is the legal property of another and is forced to obey them.",
      "A person who works very hard without proper remuneration or appreciation.",
      "To work excessively hard.",
      "A device, or part of one, that is controlled by another."
    ],
    "examples": [
      "Historically, many societies were built on the labor of slaves.",
      "He felt like a slave to his job."
    ]
  },
  {
    "word": "sleeve",
    "collision_group_id": "sleeve",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The part of a garment that wholly or partly covers a person's arm.",
      "A protective cover for a record or CD.",
      "A tube fitted over a rod or another tube.",
      "To have a secret plan or idea."
    ],
    "examples": [
      "The sleeves of his shirt were too long.",
      "He has a few tricks up his sleeve."
    ]
  },
  {
    "word": "sore",
    "collision_group_id": "sore",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Painful or aching.",
      "A raw or painful place on the body.",
      "Upset and angry.",
      "Suffering or in pain."
    ],
    "examples": [
      "My muscles are sore after yesterday's workout.",
      "He's a sore loser."
    ]
  },
  {
    "word": "split up",
    "collision_group_id": "split up",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To end a marriage or romantic relationship.",
      "To divide into smaller groups.",
      "To share something between a number of people.",
      "To separate or cause to separate."
    ],
    "examples": [
      "They decided to split up after five years together.",
      "Let's split up into two teams for the game."
    ]
  },
  {
    "word": "sportsman",
    "collision_group_id": "sport_family",
    "pos": "n",
    "family": "sportswoman,n",
    "translation_meaning": "",
    "definitions": [
      "A man who takes part in a sport, especially as a professional.",
      "A person who is fair and generous in their behavior or treatment of others, especially in a contest.",
      "A man who engages in sport.",
      "A person who behaves in a fair and honorable way."
    ],
    "examples": [
      "He is a talented sportsman who excels in several sports.",
      "Even in defeat, he was a true sportsman and congratulated the winner."
    ]
  },
  {
    "word": "spot",
    "collision_group_id": "spot_notice",
    "pos": "v",
    "family": "notice",
    "translation_meaning": "",
    "definitions": [
      "To see, notice, or recognize someone or something that is difficult to detect or that one is searching for.",
      "A small round or roundish mark, differing in color or texture from the surface around it.",
      "A particular place or point.",
      "A small amount of something."
    ],
    "examples": [
      "I spotted my friend in the crowd.",
      "This is a good spot for a picnic."
    ]
  },
  {
    "word": "spy",
    "collision_group_id": "spy",
    "pos": "n, v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A person who secretly collects and reports information on the activities, movements, and plans of an enemy or competitor.",
      "To work as a spy.",
      "To observe something secretly.",
      "A person employed by a government to obtain secret information."
    ],
    "examples": [
      "He was arrested and accused of being a spy.",
      "The children liked to spy on their neighbors."
    ]
  },
  {
    "word": "squeeze",
    "collision_group_id": "squeeze",
    "pos": "v, n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To firmly press something from opposite sides, typically to extract liquid or to change its shape.",
      "An act of squeezing.",
      "To manage to get into or through a restricted space.",
      "A person's romantic partner."
    ],
    "examples": [
      "She squeezed the lemon to get the juice out.",
      "We all managed to squeeze into the small car."
    ]
  },
  {
    "word": "stare",
    "collision_group_id": "stare",
    "pos": "v, n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To look fixedly or vacantly at someone or something with one's eyes wide open.",
      "A long, fixed, or vacant look.",
      "To gaze at someone or something for a long time.",
      "An intense and prolonged look."
    ],
    "examples": [
      "It's rude to stare at people.",
      "He gave me a cold stare."
    ]
  },
  {
    "word": "stay over",
    "collision_group_id": "stay over",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To sleep at someone else's home for one night.",
      "To remain in a place overnight.",
      "To spend the night as a guest.",
      "To stay somewhere for the night."
    ],
    "examples": [
      "Can my friend stay over tonight?",
      "We decided to stay over at a hotel instead of driving home late."
    ]
  },
  {
    "word": "stay up",
    "collision_group_id": "stay up",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To go to bed later than usual.",
      "To remain awake past one's normal bedtime.",
      "To not go to bed.",
      "To remain erect or in position."
    ],
    "examples": [
      "I had to stay up late to finish my homework.",
      "The children were allowed to stay up and watch the movie."
    ]
  },
  {
    "word": "steep",
    "collision_group_id": "steep",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "(of a slope, flight of stairs, or angle) rising or falling sharply; almost perpendicular.",
      "(of a price or demand) unreasonably high; expensive.",
      "To soak (food or tea) in water or other liquid so as to extract its flavor or to soften it.",
      "Having a sharp inclination."
    ],
    "examples": [
      "The hill was too steep to climb.",
      "The price of housing in this area is very steep."
    ]
  },
  {
    "word": "step back",
    "collision_group_id": "step_direction",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To move one or more paces backward.",
      "To withdraw or distance oneself from a situation to gain a better perspective.",
      "A step-like recession in a wall or building frontage.",
      "To pause an activity to think and reflect."
    ],
    "examples": [
      "The police officer told the crowd to step back from the scene.",
      "Sometimes you need to step back from a problem to find the solution."
    ]
  },
  {
    "word": "step forward",
    "collision_group_id": "step_direction",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To move one or more paces forward.",
      "To offer help or services.",
      "To present oneself or come to public notice.",
      "An advance or improvement."
    ],
    "examples": [
      "Please step forward when your name is called.",
      "Several volunteers stepped forward to help with the project."
    ]
  },
  {
    "word": "step over",
    "collision_group_id": "step_direction",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To lift one's foot to pass over an obstacle.",
      "To go over something by taking a step.",
      "To cross a boundary or line.",
      "To ignore or disregard something."
    ],
    "examples": [
      "He had to step over the puddle to avoid getting wet.",
      "You shouldn't step over your authority."
    ]
  },
  {
    "word": "step on/in something",
    "collision_group_id": "step on",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To place one's foot on something.",
      "To tread on something, often accidentally.",
      "To intervene in a situation.",
      "To apply pressure with one's foot."
    ],
    "examples": [
      "Be careful not to step on the broken glass.",
      "I accidentally stepped in a puddle of mud."
    ]
  },
  {
    "word": "stick",
    "collision_group_id": "stick_branch",
    "pos": "n",
    "family": "short branch, rod",
    "translation_meaning": "",
    "definitions": [
      "A thin piece of wood that has fallen or been cut from a tree.",
      "A long, thin piece of something.",
      "To push a pointed object into or through something.",
      "To adhere or cause to adhere to a surface."
    ],
    "examples": [
      "The dog fetched the stick I threw.",
      "Can you help me stick this poster on the wall?"
    ]
  },
  {
    "word": "strangely enough",
    "collision_group_id": "strangely enough",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Used to introduce a fact that is surprising or unexpected.",
      "In a way that is unusual or surprising.",
      "Contrary to what one would expect.",
      "An expression indicating that something is odd but true."
    ],
    "examples": [
      "Strangely enough, I wasn't nervous before the interview.",
      "He had never studied, but strangely enough, he passed the exam."
    ]
  },
  {
    "word": "stream",
    "collision_group_id": "stream_river",
    "pos": "n",
    "family": "small river",
    "translation_meaning": "",
    "definitions": [
      "A small, narrow river.",
      "A continuous flow of liquid, air, or gas.",
      "To transmit or receive data over the internet as a steady, continuous flow.",
      "A current or flow of water or other liquid."
    ],
    "examples": [
      "We crossed a small stream in the forest.",
      "A steady stream of people came to the event."
    ]
  },
  {
    "word": "stretch",
    "collision_group_id": "stretch",
    "pos": "v, n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To straighten or extend one's body or a part of one's body to its full length, typically so as to tighten one's muscles or relieve stiffness.",
      "An act of stretching one's limbs or body.",
      "To be made or be capable of being made longer or wider without tearing or breaking.",
      "A continuous area or period of time."
    ],
    "examples": [
      "It's important to stretch before exercising.",
      "There is a long stretch of road with no houses."
    ]
  },
  {
    "word": "strict",
    "collision_group_id": "strict",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Demanding that rules concerning behavior are obeyed and observed.",
      "Precise in meaning or interpretation.",
      "Following rules or principles exactly.",
      "Rigorous and severe."
    ],
    "examples": [
      "My parents were very strict when I was growing up.",
      "The school has a strict policy on bullying."
    ]
  },
  {
    "word": "string",
    "collision_group_id": "string_rope",
    "pos": "n",
    "family": "thin rope; musical instrument",
    "translation_meaning": "",
    "definitions": [
      "Material consisting of threads of cotton, hemp, or other material twisted together to form a thin cord.",
      "A piece of string.",
      "A set of things tied or threaded together.",
      "A tightly stretched piece of catgut or wire on a musical instrument, which produces a note when vibrated."
    ],
    "examples": [
      "He tied the package with a piece of string.",
      "The guitar has six strings."
    ]
  },
  {
    "word": "stripe",
    "collision_group_id": "stripe",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A long, narrow band or strip, typically of the same width throughout its length, differing in color or texture from the surface on either side of it.",
      "A chevron on a uniform, denoting rank.",
      "A stroke or lash with a whip.",
      "A distinctive character or tendency."
    ],
    "examples": [
      "The shirt has blue and white stripes.",
      "A tiger is known for its black stripes."
    ]
  },
  {
    "word": "suit",
    "collision_group_id": "suit_attractive",
    "pos": "v",
    "family": "look attractive",
    "translation_meaning": "",
    "definitions": [
      "To be convenient for or acceptable to.",
      "To enhance the features, figure, or character of someone.",
      "A set of outer clothes made of the same fabric and designed to be worn together.",
      "A lawsuit."
    ],
    "examples": [
      "That color really suits you.",
      "Does Friday at 3 p.m. suit you for a meeting?"
    ]
  },
  {
    "word": "swear",
    "collision_group_id": "swear_curse",
    "pos": "v",
    "family": "curse",
    "translation_meaning": "",
    "definitions": [
      "To use offensive language, especially as an expression of anger.",
      "To make a solemn statement or promise undertaking to do something or affirming that something is the case.",
      "To take an oath.",
      "To have great confidence in something."
    ],
    "examples": [
      "It's not polite to swear.",
      "I swear I will never lie to you again."
    ]
  },
  {
    "word": "sweep",
    "collision_group_id": "sweep",
    "pos": "v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To clean an area by brushing away dirt or litter with a broom.",
      "To move swiftly and smoothly.",
      "To search an area.",
      "A long, sweeping movement."
    ],
    "examples": [
      "She swept the floor after dinner.",
      "A new craze is sweeping the nation."
    ]
  },
  {
    "word": "sword",
    "collision_group_id": "sword",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A weapon with a long metal blade and a hilt with a hand guard, used for thrusting or striking.",
      "A long, sharp-edged weapon.",
      "Something that has the power to harm or destroy.",
      "A symbol of military power."
    ],
    "examples": [
      "The knight drew his sword and prepared for battle.",
      "The pen is mightier than the sword."
    ]
  },
  {
    "word": "tail",
    "collision_group_id": "tail",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "The hindmost part of an animal, especially when prolonged beyond the rest of the body.",
      "The rear part of an airplane.",
      "To follow and observe someone closely, especially in secret.",
      "The final, more distant, or less important part of something."
    ],
    "examples": [
      "The dog wagged its tail happily.",
      "The detective decided to tail the suspect."
    ]
  },
  {
    "word": "take a risk",
    "collision_group_id": "take a risk",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To do something that might have a negative or dangerous result.",
      "To expose oneself to a chance of loss or harm.",
      "To gamble or take a chance on something.",
      "To proceed with an action despite the possibility of an adverse outcome."
    ],
    "examples": [
      "He decided to take a risk and start his own business.",
      "Sometimes you have to take a risk to achieve great things."
    ]
  },
  {
    "word": "take somebody out",
    "collision_group_id": "take out",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To go with someone to a restaurant, movie, or other social event, and usually pay for them.",
      "To remove something from a place.",
      "To kill or disable someone.",
      "To obtain an official document or service."
    ],
    "examples": [
      "He's taking his girlfriend out for her birthday.",
      "Please take out the trash before you leave."
    ]
  },
  {
    "word": "tap",
    "collision_group_id": "tap",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A device by which a flow of liquid or gas from a pipe or container can be controlled.",
      "To strike someone or something with a quick, light blow.",
      "A quick, light blow.",
      "To draw liquid from a cask, barrel, or other container."
    ],
    "examples": [
      "Please turn off the tap when you are finished.",
      "She tapped him on the shoulder to get his attention."
    ]
  },
  {
    "word": "temple",
    "collision_group_id": "temple",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A building devoted to the worship, or regarded as the dwelling place, of a god or gods or other objects of religious reverence.",
      "The flat part of either side of the head between the forehead and the ear.",
      "A place of worship.",
      "A building dedicated to religious or spiritual activities."
    ],
    "examples": [
      "The ancient temple was built on a hilltop.",
      "He had a throbbing pain in his left temple."
    ]
  },
  {
    "word": "territory",
    "collision_group_id": "territory",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "An area of land under the jurisdiction of a ruler or state.",
      "An area defended by an animal or group of animals against others of the same species.",
      "An area in which one has rights, responsibilities, or knowledge.",
      "A region or district."
    ],
    "examples": [
      "The country is fighting to protect its territory.",
      "The cat marked its territory."
    ]
  },
  {
    "word": "terror",
    "collision_group_id": "terror_family",
    "pos": "n",
    "family": "terrorism terrorist n n, adj",
    "translation_meaning": "",
    "definitions": [
      "Extreme fear.",
      "The use of violence and intimidation in the pursuit of political aims.",
      "A person or thing that causes extreme fear.",
      "A state of intense fear."
    ],
    "examples": [
      "She screamed in terror when she saw the spider.",
      "The reign of terror lasted for several years."
    ]
  },
  {
    "word": "tie somebody/something up",
    "collision_group_id": "tie up",
    "pos": "",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To bind someone's arms and legs so they cannot move.",
      "To fasten something with a rope or cord.",
      "To occupy someone's time so they are not available for other activities.",
      "To invest money so that it is not easily available for use."
    ],
    "examples": [
      "The robbers tied up the security guard.",
      "I'm tied up in meetings all day."
    ]
  },
  {
    "word": "tournament",
    "collision_group_id": "tournament",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A series of contests between a number of competitors, who compete for an overall prize.",
      "A competition for teams or single players in which a series of games is played.",
      "A medieval pageant in which knights competed on horseback.",
      "A series of games or contests that make up a single competition."
    ],
    "examples": [
      "Our school's basketball team won the championship tournament.",
      "She is competing in a chess tournament this weekend."
    ]
  },
  {
    "word": "track",
    "collision_group_id": "track_athletics",
    "pos": "n",
    "family": "athletics",
    "translation_meaning": "",
    "definitions": [
      "A prepared course or circuit for racing, running, or other sports.",
      "A mark or line of marks left by a person, animal, or vehicle in passing.",
      "To follow the course or trail of someone or something.",
      "A song or piece of music on a record, CD, or digital playlist."
    ],
    "examples": [
      "He is a star athlete on the track team.",
      "The police tracked the suspect to his hiding place."
    ]
  },
  {
    "word": "tragedy",
    "collision_group_id": "tragedy_family",
    "pos": "n",
    "family": "tragic,adj",
    "translation_meaning": "",
    "definitions": [
      "An event causing great suffering, destruction, and distress, such as a serious accident, crime, or natural catastrophe.",
      "A play dealing with tragic events and having an unhappy ending, especially one concerning the downfall of the main character.",
      "A disastrous event.",
      "A story with a sad or unhappy ending."
    ],
    "examples": [
      "The earthquake was a terrible tragedy for the entire country.",
      "Shakespeare's 'Hamlet' is a classic tragedy."
    ]
  },
  {
    "word": "triangle",
    "collision_group_id": "triangle",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A plane figure with three straight sides and three angles.",
      "A percussion instrument consisting of a steel rod bent into a triangle, open at one corner.",
      "A group of three related people or things.",
      "A three-sided polygon."
    ],
    "examples": [
      "A triangle has three sides and three angles.",
      "She played the triangle in the school orchestra."
    ]
  },
  {
    "word": "tube",
    "collision_group_id": "tube",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A long, hollow cylinder of metal, plastic, glass, etc., for holding or conveying liquids or gases.",
      "The underground electric railway system in London.",
      "A flexible container for a semiliquid substance.",
      "A television set."
    ],
    "examples": [
      "I squeezed the last bit of toothpaste out of the tube.",
      "We took the tube to get across London."
    ]
  },
  {
    "word": "undressed",
    "collision_group_id": "undressed",
    "pos": "adj",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "Not wearing clothes; naked.",
      "To take off one's clothes.",
      "Without a dressing or sauce.",
      "In a state of being unclothed."
    ],
    "examples": [
      "He got undressed and went to bed.",
      "I prefer my salad undressed."
    ]
  },
  {
    "word": "unpack",
    "collision_group_id": "unpack",
    "pos": "v",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "To open and remove the contents of a suitcase, bag, or container.",
      "To remove something from a packed container.",
      "To analyze something into its component elements.",
      "To take things out of a bag or box."
    ],
    "examples": [
      "The first thing I do when I get to a hotel is unpack my suitcase.",
      "Let's unpack the groceries and put them away."
    ]
  },
  {
    "word": "van",
    "collision_group_id": "van",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A medium-sized motor vehicle, typically without side windows in the rear part, for transporting goods.",
      "The forefront of a movement or trend.",
      "A covered vehicle for transporting goods or people.",
      "A large, box-like vehicle."
    ],
    "examples": [
      "The delivery company uses a fleet of vans.",
      "They helped him move his furniture in a van."
    ]
  },
  {
    "word": "verse",
    "collision_group_id": "verse_poetry",
    "pos": "n",
    "family": "poetry; part of poem, song",
    "translation_meaning": "",
    "definitions": [
      "Writing arranged with a metrical rhythm, typically having a rhyme.",
      "A group of lines that form a unit in a poem or song; a stanza.",
      "One of the short numbered divisions of a chapter in the Bible.",
      "A line of poetry."
    ],
    "examples": [
      "She wrote a beautiful verse for her mother's birthday card.",
      "I only remember the first verse of the song."
    ]
  },
  {
    "word": "weapon",
    "collision_group_id": "weapon",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A thing designed or used for inflicting bodily harm or physical damage.",
      "A means of gaining an advantage or defending oneself.",
      "An instrument of attack or defense.",
      "Something used to injure, defeat, or destroy."
    ],
    "examples": [
      "The police found the murder weapon in the river.",
      "His sharp wit is his most effective weapon."
    ]
  },
  {
    "word": "web",
    "collision_group_id": "web_spider",
    "pos": "n",
    "family": "spider",
    "translation_meaning": "",
    "definitions": [
      "A network of fine threads constructed by a spider from fluid secreted by its spinnerets, used to catch its prey.",
      "A complex system of interconnected elements; a network.",
      "The World Wide Web.",
      "The membrane between the toes of a swimming bird or other aquatic animal."
    ],
    "examples": [
      "A spider was spinning a web in the corner of the room.",
      "The company has a complex web of international suppliers."
    ]
  },
  {
    "word": "wheat",
    "collision_group_id": "wheat",
    "pos": "n",
    "family": "",
    "translation_meaning": "",
    "definitions": [
      "A cereal plant that is the most important kind grown in temperate countries, the grain of which is ground to make flour for bread, pasta, pastry, etc.",
      "The grain of the wheat plant.",
      "A light yellow-brown color.",
      "A type of cereal crop."
    ],
    "examples": [
      "The fields were full of golden wheat.",
      "Bread is made from wheat flour."
    ]
  }
]